{"id":13359,"date":"2016-06-23T23:39:04","date_gmt":"2016-06-23T20:39:04","guid":{"rendered":"https:\/\/stanfy.com\/?p=13359"},"modified":"2019-10-15T12:25:30","modified_gmt":"2019-10-15T09:25:30","slug":"smart-applications-with-machine-learning-the-definitive-guide","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/smart-applications-with-machine-learning-the-definitive-guide\/","title":{"rendered":"Top 6 Most Popular Machine Learning API&#8217;s"},"content":{"rendered":"<p>Have you heard of machine learning? If you&#8217;ve ever used the internet before, your answer is probably yes. Seen as a buzzword by many, machine learning—together with big data, artificial intelligence, and virtual reality—is currently one of the most widely discussed concepts in the technology community.<\/p>\n<p>Buzzword or not, machine learning has long since become something we use every day, one way or another. It&#8217;s working behind the scenes in most of our mobile apps, under the hood of most websites we visit, and is employed by the brands and service providers with whom we interact.<\/p>\n<p>The ubiquity of machine learning has led to the creation of a number of ways to quickly and easily integrate it into virtually any application. On the flip side, it has become even more important to understand clearly what machine learning is, what it isn&#8217;t, and where it should be applied to achieve the best results.<\/p>\n<p class=\"upgrades\">We&#8217;ve also made a PDF-version of this article. <a href=\"https:\/\/www.getdrip.com\/forms\/87318719\/submissions\/new\" data-drip-show-form=\"87318719\">Download<\/a><\/p>\n<h2>Simple Explanation of Machine Learning<\/h2>\n<p>The concept of machine learning, as it&#8217;s being used in smart applications today, is basically a way of making  highly accurate predictions of the future using data (as in Big Data) from the past. This can take various forms, from article recommendations on newspapers&#8217; websites, to fraud detection in online stores, to sentiment analysis of interaction on social networks.<\/p>\n<p>Since machine learning is often intertwined with the concept of artificial intelligence (AI), it&#8217;s also quite important to understand the difference between the two. In fact, machine learning is a subset of artificial intelligence, which, in turn, is the concept that a computer can learn to do anything a human can.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-13395\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/machine-learning-and-AI.png\" alt=\"machine learning and AI\" width=\"450\" height=\"337\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/machine-learning-and-AI.png 615w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/machine-learning-and-AI-300x225.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/machine-learning-and-AI-600x450.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/machine-learning-and-AI-450x337.png 450w\" sizes=\"(max-width: 450px) 100vw, 450px\" \/><\/p>\n<p>As opposed to AI, machine learning algorithms don&#8217;t necessarily act by itself, but rather works with data and supplies certain conclusions and predictions based on its analysis. The core of machine learning consists of a wide variety of algorithms, which should be chosen according to the nature of the task at hand and “trained” with data from the past.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-13397\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/75-and-25-percent-dependance.png\" alt=\"75 and 25 percent dependance\" width=\"450\" height=\"95\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/75-and-25-percent-dependance.png 935w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/75-and-25-percent-dependance-300x63.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/75-and-25-percent-dependance-768x162.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/75-and-25-percent-dependance-600x126.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/75-and-25-percent-dependance-450x95.png 450w\" sizes=\"(max-width: 450px) 100vw, 450px\" \/><\/p>\n<p>This past data is also crucial for validating  the predictions: <strong>normally 75%<\/strong> of the available data would be used for prediction, which would then be compared to the <strong>remaining 25%<\/strong>. This way, one can fine-tune the algorithms by trying to “predict” the past.<\/p>\n<h2>Time to act<\/h2>\n<p>There&#8217;s been no better time to start implementing machine learning in all kinds of applications, Google&#8217;s <strong>Aparna Chennapragada<\/strong> argued in her talk at the recent TNW Europe conference. The evolution of the internet has meant that data has reached a different order of magnitude to what it was ten years ago, with videos, photos, social media posts, and online behaviour data generated by billions of users.<\/p>\n<p>At the same time, most people now have ambient access to enormous computing power. The mobile paradigm changes and enhances the way we interact with our environment—thanks, in no small measure, to machine learning and artificial intelligence algorithms. With huge amounts of data and so many computers at hand, now is the best time to build smart applications, which can help users achieve more and make their everyday lives easier.<\/p>\n<p>One good thing about building smart applications with machine learning is that almost every problem today can be solved with software. These new solutions include entertainment at home, transportation and dispatching cars through traffic, monitoring health and fitness, and so on.<\/p>\n<p>&#8220;If you&#8217;re building a product now that solves a real world problem, chances are you will need to work with information problems, and you&#8217;ll have to figure out how to get it right,&#8221; Chennapragada said.<\/p>\n<p>With the wide variety of information problems we&#8217;re facing, it&#8217;s important to recognise  those cases where machine learning would be an efficient solution. The perfect problem in this case would be one that&#8217;s hard for a human to solve, but easy for the machine.<\/p>\n<p>A good example is machine translation. Despite not always being 100% accurate, it satisfies users in most cases, since without the machine they wouldn&#8217;t be able to translate at all. On the other hand, inaccurate speech recognition is quite frustrating, as the user can actually type the query manually. The easier the problem is for a human, the more difficult it becomes to satisfy your users with a machine learning-based solution.<\/p>\n<p><strong>Werner Vogels<\/strong>, the CTO of Amazon, gave another good example of the use of machine learning in his talk at TNW Conference. The online retail behemoth uses algorithms to fight the paradox of choice, which is that after a certain number of options, the increase in choice actually makes customers less happy.<\/p>\n<p>“If there are only three kinds of toothpaste, you choose one and you&#8217;re happy with your choice,” Vogels said. “But if there are 50, you get confused. You need to make a choice, but you&#8217;re not sure you&#8217;ve chosen the best one. It&#8217;s a big driver for unhappiness.<\/p>\n<blockquote><p>“This is important in grocery stores, but even more important online: we have not 50, but 5,000 toothpastes. Personalisation with machine learning helps reduce choices and make users happier.”<\/p><\/blockquote>\n<h2>The secret sauce<\/h2>\n<p>Personalisation is another requirement that Chennapragada listed amongst the most important features of a smart application. Although there&#8217;s no universal formula for a successful product in this field, there is something that the app creators should keep in mind for reference:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-13393\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/AI-plus-I.png\" alt=\"AI-plus-I\" width=\"740\" height=\"237\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/AI-plus-I.png 1480w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/AI-plus-I-300x96.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/AI-plus-I-768x246.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/AI-plus-I-1024x329.png 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/AI-plus-I-600x193.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/AI-plus-I-450x144.png 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/AI-plus-I-1000x321.png 1000w\" sizes=\"(max-width: 740px) 100vw, 740px\" \/><\/p>\n<p>Artificial intelligence and user interface need little explanation, and “I” means that the product has to adapt to the needs of every user in every scenario. Knowing your audience and their needs is key, and a failure to fulfil these needs  inevitably leads to the product being abandoned.<\/p>\n<p>In addition to knowing the audience, it&#8217;s important to be able to show your users the benefits of your smart application early on, Chennapragada added. A good example of that is Google-owned Waze that uses machine learning and real-time data to predict traffic jams and navigate the user around them. The app adds value from the very first time it&#8217;s launched on the phone—and that&#8217;s something worth aiming for.<\/p>\n<p>A big part of Chennapragada&#8217;s advice on building smart applications with machine learning algorithms can be boiled down to “don&#8217;t frighten your user” and “don&#8217;t screw up in mission critical tasks.” In particular, customers would generally prefer having a predictable interface over saving some time; for example, Google&#8217;s team at some point came up with an algorithm that could dynamically change the icon grid on the smartphone to highlight the apps that the customer was more likely to need at any given moment. The feature never went live.<\/p>\n<p>Overall, the rule of thumb when it comes to building UI for smart apps is that its simplicity should be proportionate to your confidence in AI. Whenever you&#8217;re not entirely sure that the AI has got your user&#8217;s intention correctly, let the latter clarify it further. The more training your algorithms receive this way, the better they become in the future.<\/p>\n<h2>Starting up<\/h2>\n<p>With machine learning gaining popularity across industries, it is slowly but surely becoming as ubiquitous as computing itself. In fact, you don&#8217;t even need to have an in-depth knowledge of coding or computer science to introduce it into your app. With machine learning tools released by a number of companies it can be done within an hour, provided you have sufficient data to start with.<\/p>\n<p>Recently we ran an overview of APIs for natural language processing, most of which employ machine learning algorithms. Let&#8217;s take a look at some of the most popular solutions you can use for other aspects of your new smart applications.<\/p>\n<h3><a href=\"https:\/\/aws.amazon.com\/machine-learning\/\">Amazon Machine Learning<\/a><\/h3>\n<p><a href=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/amazonml01.png\"><img loading=\"lazy\" class=\"wp-image-13411\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/amazonml01.png\" alt=\"Adding a data source for a model on Amazon ML\" width=\"740\" height=\"407\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/amazonml01.png 1480w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/amazonml01-300x165.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/amazonml01-768x422.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/amazonml01-1024x563.png 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/amazonml01-600x330.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/amazonml01-450x248.png 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/amazonml01-1000x550.png 1000w\" sizes=\"(max-width: 740px) 100vw, 740px\" \/><\/a><\/p>\n<p>The retail giant offers a cloud-based machine learning service that it claims is similar to what is used within the company for all sorts of predictions. Examples of possible uses for this product are fraud detection, content personalisation, document classification, and customer churn prediction.<\/p>\n<p>The API comes with SDKs for Java, .NET, Python, PHP, Node.js, and Ruby. Amazon provides ample documentation for the product, which could, nevertheless be slightly  difficult for a non-programmer to follow in some cases. In combination with the Amazon Web Services (AWS) cloud, the solution can scale to &#8220;generate billions of predictions daily, and serve those predictions in real-time and at high throughput.&#8221;<\/p>\n<p>Amazon Machine Learning API charges $0.42 per hour of computing while analysing your data and building models. After that, you&#8217;ll need to pay $0.10 per 1,000 predictions if purchased in a batch, or $0.0001 per real-time prediction. The API is not available on the AWS free tier, which means that you might need to pay for it separately.<\/p>\n<h3><a href=\"https:\/\/azure.microsoft.com\/en-us\/services\/machine-learning\/\">Microsoft Azure ML<\/a><\/h3>\n<p><a href=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-Azure-ML-1.jpg\"><img loading=\"lazy\" class=\"wp-image-13385\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-Azure-ML-1.jpg\" width=\"740\" height=\"416\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-Azure-ML-1.jpg 1480w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-Azure-ML-1-300x169.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-Azure-ML-1-768x432.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-Azure-ML-1-1024x576.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-Azure-ML-1-600x338.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-Azure-ML-1-450x253.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-Azure-ML-1-1000x563.jpg 1000w\" sizes=\"(max-width: 740px) 100vw, 740px\" \/><\/a><\/p>\n<p>Another offering crafted by a major tech corporation, Azure ML is part of a bigger Cortana Intelligence Suite. Similarly to Amazon&#8217;s product, it offers a visual interface that makes it easier to build and train models, and choose algorithms to use.<\/p>\n<p>The product is centred around the Machine Learning Studio, a framework for creation of modular solutions of your own. In addition to documentation, there&#8217;s a sizeable gallery of all kinds of examples and experiments that show different use cases for the service. These include demand estimation, credit risk prediction, sentiment analysis, and hundreds of other applications.<\/p>\n<p>As for the pricing, Microsoft charges a flat monthly fee of $9.99 per workplace—so-called “seat subscription”—as well as additional fees of $1 per hour of experimenting in Studio, $2 per hour of computation with production API, and $0.50 per 1,000 production API transactions.<\/p>\n<h3><a href=\"https:\/\/cloud.google.com\/prediction\/\">Google Cloud Prediction API<\/a><\/h3>\n<p><a href=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Google-Cloud-Prediction-API-1.png\"><img loading=\"lazy\" class=\"wp-image-13386\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Google-Cloud-Prediction-API-1.png\" width=\"740\" height=\"181\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Google-Cloud-Prediction-API-1.png 900w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Google-Cloud-Prediction-API-1-300x73.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Google-Cloud-Prediction-API-1-768x188.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Google-Cloud-Prediction-API-1-600x147.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Google-Cloud-Prediction-API-1-450x110.png 450w\" sizes=\"(max-width: 740px) 100vw, 740px\" \/><\/a><\/p>\n<p>Like its  competitors, Google offers a cloud-based machine learning solution for everyone to play with. Among possible use cases are customer sentiment analysis, spam detection, recommendation systems, and more. There are a few comprehensive how-to guides on creating basic models for these cases that will help you get started.<\/p>\n<p>In addition to the how-tos, Google offers a quite simple developer&#8217;s guide to the API, which goes through syntax and generally explains how the whole thing works.<\/p>\n<p>Prediction API offers customers a free quota of 100 predictions, 5MB of trained data, and 100 streaming updates per day—with a lifetime cap of 20,000 predictions. In the paid tier, you will be charged $10 a month per Google Cloud Platform Console project, which will give you 10,000 predictions and streaming updates. Beyond those, you&#8217;ll pay $0.50 per 1,000 predictions, $0.05 per 1,000 streaming updates, and $0.002\/MB of data trained.<\/p>\n<h2><a href=\"https:\/\/bigml.com\/\">BigML<\/a><\/h2>\n<p><a href=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bigml01.png\"><img loading=\"lazy\" class=\"wp-image-13412\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bigml01.png\" alt=\"BigML model dashboard\" width=\"740\" height=\"389\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bigml01.png 1798w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bigml01-300x158.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bigml01-768x404.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bigml01-1024x539.png 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bigml01-600x316.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bigml01-450x237.png 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bigml01-1000x526.png 1000w\" sizes=\"(max-width: 740px) 100vw, 740px\" \/><\/a><\/p>\n<p>Catering to all kinds of users, from hobbyist developers to enterprises, BigML offers a flexible and well documented machine learning API. Its use cases include market basket analysis, customer segmentation, and predictive maintenance.<\/p>\n<p>For users not closely familiar with machine learning, there&#8217;s a small gallery of user scripts to help you get started. The documentation includes a comprehensive quick start manual that guides the user through the main steps, from feeding the data into the algorithm, to creating a model, to requesting a prediction.<\/p>\n<p>BigML offers a choice of subscriptions priced from $30 to $300 a month, as well as the pay-as-you-go model where you&#8217;re charged per MB of training data, model size, and number of predictions.<\/p>\n<p>In addition to its cloud-based solution, BigML offers the  possibility of deploying the machine learning system on-premise for enterprise customers.<\/p>\n<h2><a href=\"https:\/\/prediction.io\/\">PredictionIO<\/a><\/h2>\n<p><a href=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/PredictionIO.png\"><img loading=\"lazy\" class=\"wp-image-13388\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/PredictionIO.png\" alt=\"Algorithm selection dialog in PredictionIO\" width=\"740\" height=\"344\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/PredictionIO.png 1480w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/PredictionIO-300x139.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/PredictionIO-768x356.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/PredictionIO-1024x475.png 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/PredictionIO-600x279.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/PredictionIO-450x209.png 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/PredictionIO-1000x464.png 1000w\" sizes=\"(max-width: 740px) 100vw, 740px\" \/><\/a><\/p>\n<p>Apparently addressing the audience of developers who would like to be in control of their machine learning deployment, PredictionIO is an open source server that allows users to quickly build predictive engines. The company was acquired by Salesforce in February, but promised that the technology would remain free and open source indefinitely.<\/p>\n<p>PredictionIO offers SDKs for Java (and Android), PHP, Python, and Ruby. There are also a few community-powered SDKs, including ones for Node.js, C#\/.NET, Swift, and more. It also hosts a gallery of engine templates for different kinds of tasks, which would help get your app up and running in no time.<\/p>\n<h2><a href=\"http:\/\/www.alchemyapi.com\/\">AlchemyAPI<\/a><\/h2>\n<p><img loading=\"lazy\" class=\"size-full wp-image-13413\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/alchemyapi01.jpg\" alt=\"AlchemyAPI language analysis example\" width=\"2322\" height=\"1312\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/alchemyapi01.jpg 1480w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/alchemyapi01-300x169.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/alchemyapi01-768x434.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/alchemyapi01-1024x578.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/alchemyapi01-600x339.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/alchemyapi01-450x254.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/alchemyapi01-1000x565.jpg 1000w\" sizes=\"(max-width: 2322px) 100vw, 2322px\" \/><\/p>\n<p>Similarly to PredictionIO, AlchemyAPI began as a startup, but was later acquired by a large corporate. In 2015, IBM purchased the company, planning to integrate its solutions into the Watson platform.<\/p>\n<p>The original API, however, is still available and can be used together with IBM&#8217;s cloud platform Bluemix. We mentioned the Alchemy Language API in the recent natural language processing round-up, but there&#8217;s more to it than just this one use case.<\/p>\n<p>AlchemyAPI offers a machine learning based Visual Recognition API, as well as the recently launched AlchemyData News API. The latter provides an interesting solution for media analysis:<\/p>\n<blockquote><p>“AlchemyData News indexes 250k to 300k English language news and blog articles every day with historical search available for the past 60 days. You can query the News API directly with no need to acquire, enrich and store the data yourself &#8211; enabling you to go beyond simple keyword-based searches.”<\/p><\/blockquote>\n<p>The Visual Recognition API allows users to classify 250 images per day and train a custom classifier using 1000 images for free. Beyond that, users will be charged pay-as-you-go fees for face recognition, image classification, etc. Some of the features will be free to use until July 1, so hurry up if you&#8217;d like to play with the API and decide if it’s for you.<br \/>\n[custom_form form=&#8221;form-inline-subscribe&#8221; topic=&#8221;Product&#8221;]<\/p>\n<h2>Summary<\/h2>\n<p>With the growing number of reasonably priced and easy-to-set-up solutions, it&#8217;s simpler than ever before for app developers to find something that fits their needs perfectly. Following the advice of Werner Vogels, we&#8217;ve only mentioned a few well-tried options, which represent a mere fraction of the wide variety of products available.<\/p>\n<p>If you&#8217;ve added machine learning into your application with any of the APIs we mentioned above, or using an alternative, please share your hands-on experience in the comments section.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you heard of machine learning? If you&#8217;ve ever used the internet before, your answer is probably yes. <\/p>\n","protected":false},"author":63,"featured_media":13374,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[798,6],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"Learn what is machine learning, how it can be used and go through the top 6 most popular machine learning API’s. We share the best of our knowledge!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/smart-applications-with-machine-learning-the-definitive-guide\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Top 6 Most Popular Machine Learning API&#039;s| Choose Best\" \/>\n<meta property=\"og:description\" content=\"Learn what is machine learning, how it can be used and go through the top 6 most popular machine learning API’s. We share the best of our knowledge!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/smart-applications-with-machine-learning-the-definitive-guide\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2016-06-23T20:39:04+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-10-15T09:25:30+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Building-smart-applications-with-machine-learning-The-definitive-guide.png\" \/>\n\t<meta property=\"og:image:width\" content=\"2048\" \/>\n\t<meta property=\"og:image:height\" content=\"1536\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/smart-applications-with-machine-learning-the-definitive-guide\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Building-smart-applications-with-machine-learning-The-definitive-guide.png\",\"width\":2048,\"height\":1536},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/smart-applications-with-machine-learning-the-definitive-guide\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/smart-applications-with-machine-learning-the-definitive-guide\/\",\"name\":\"Top 6 Most Popular Machine Learning API's| Choose Best\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/smart-applications-with-machine-learning-the-definitive-guide\/#primaryimage\"},\"datePublished\":\"2016-06-23T20:39:04+00:00\",\"dateModified\":\"2019-10-15T09:25:30+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\"},\"description\":\"Learn what is machine learning, how it can be used and go through the top 6 most popular machine learning API\\u2019s. We share the best of our knowledge!\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/smart-applications-with-machine-learning-the-definitive-guide\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\",\"name\":\"Anastasiia Hibaieva\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5e777493cd8ae0902fee5b35c44765ce?s=96&d=mm&r=g\",\"caption\":\"Anastasiia Hibaieva\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/13359"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/63"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=13359"}],"version-history":[{"count":0,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/13359\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/13374"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=13359"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=13359"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=13359"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}