{"id":13631,"date":"2016-09-06T15:13:43","date_gmt":"2016-09-06T12:13:43","guid":{"rendered":"https:\/\/stanfy.com\/?p=13631"},"modified":"2019-09-24T21:26:18","modified_gmt":"2019-09-24T18:26:18","slug":"open-source-android-roms-you-can-use-for-your-device","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/open-source-android-roms-you-can-use-for-your-device\/","title":{"rendered":"Open Source Android ROMs You Can Use For Your Device"},"content":{"rendered":"<p>One of the most important tasks faced by hardware developers is choosing the right operating system &#8220;flavour&#8221; to run. While for many vendors selecting Android is a no-brainer due to its open nature and popularity, inside its ecosystem there are a number of different firmware builds to choose from.<\/p>\n<p>The device&#8217;s firmware, also known as ROM (read-only memory), defines how the user will interact with your device, as well as what features will be available both to the developer and the consumer.<\/p>\n<p>In addition to the &#8220;official&#8221; open-source Android ROM known as AOSP (Android open-source project), there are quite a few ROMs, built mostly by enthusiasts, that differ from the original in a variety of ways. Custom firmware could be optimised to run on older and less powerful chips, to be focussed on the security and privacy of the users, or to allow for deeper customisation, and so on.<\/p>\n<p>We&#8217;ve taken a closer look at a few open Android firmware projects that everyone can modify and use to power their own hardware.<\/p>\n<p>This article is a part of a bigger <a href=\"https:\/\/stanfy.com\/embedded-android\/\">guide about Embedded Android<\/a> that intends to cover a broad set of topics about using Android as a platform for embedded devices.<\/p>\n<h2>CyanogenMod<\/h2>\n<p><img loading=\"lazy\" class=\"size-full wp-image-13635\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/cyanogenmod-androidpolice.jpg\" alt=\"Image credit: Android Police\" width=\"2500\" height=\"1667\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/cyanogenmod-androidpolice.jpg 2500w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/cyanogenmod-androidpolice-300x200.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/cyanogenmod-androidpolice-768x512.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/cyanogenmod-androidpolice-1024x683.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/cyanogenmod-androidpolice-600x400.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/cyanogenmod-androidpolice-450x300.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/cyanogenmod-androidpolice-1000x667.jpg 1000w\" sizes=\"(max-width: 2500px) 100vw, 2500px\" \/><\/p>\n<p>Arguably the most well-known Android-based custom firmware, <a href=\"http:\/\/www.cyanogenmod.org\/\">CyanogenMod<\/a> has travelled the path from yet another open-source ROM developed by a few enthusiasts to a piece of software with a company behind it, which profits from contracts with hardware vendors.<\/p>\n<p>Developed by Steve Kondik, aka Cyanogen, in 2009, the ROM was initially an enhanced version of another piece of custom firmware, and only worked with HTC Dream (known as T-Mobile G1 in the US). It gained significant popularity among the enthusiast community, with more developers joining the team in the following months. Since then, the user base of the firmware has been growing steadily.<\/p>\n<p>The latest stable version of the AOSP-based CyanogenMod is built upon Android 6.0.1 Marshmallow, though it&#8217;s not available for all 571 supported devices. The versions based on Android 4.4 KitKat and 5.0 and 5.1 Lollipop are also still supported.<\/p>\n<p>The ROM&#8217;s main advantages compared to the &#8220;stock&#8221; Android and AOSP supplied by device vendors or Google include screen calibration possibilities, advanced gesture support, app-level permission control, sound and interface customisation, button actions assigning, and much more.<\/p>\n<p>Over the years, CyanogenMod has seen a number of controversies, connected first of all to its commercialisation, as well as to the actions of Cyanogen himself. In 2011, Kondik joined Samsung as a software engineer, but kept working on his Android ROM in his spare time. In March 2013, he left the Korean tech giant.<\/p>\n<p>Nearly half a year later, Kondik <a href=\"http:\/\/arstechnica.com\/gadgets\/2013\/09\/cyanogenmod-goes-pro-with-cyanogen-inc-and-7-million-in-funding\/\">announced<\/a> that he had raised $7 million in venture funding for his new company, Cyanogen Inc. The announcement was followed by a lively discussion within the CyanogenMod developers&#8217; community, some members of which thought that their volunteer work had been used by Kondik to make profits. They were also concerned that the source code of CyanogenMod could be closed, which never happened in the end.<\/p>\n<p>What did happen, was that a number of contracts with phone manufacturers were won by CyanogenMod. Among the smartphone models shipped with the CyanogenMod OS were Oppo N1, OnePlus One, Wileyfox Swift and Storm, Alcatel Onetouch Hero 2+, Yu Yureka, and many more.<\/p>\n<p>Cyanogen Inc. has recently gone through <a href=\"http:\/\/www.androidpolice.com\/2016\/07\/22\/sources-cyanogen-inc-is-undergoing-major-layoffs-may-pivot-to-apps\/\">a significant staff cut<\/a>, in which &#8220;roughly 30 out of the 136 people&#8221; it employed were laid off. There are rumours on the market that the commercialisation of the OS has proven to be less lucrative than expected, and chances are that soon CyanogenMod will be developed exclusively by community volunteers again.<\/p>\n<p>The firmware is distributed under the double licence—Apache License 2 and GNU GPL v2—which allows use and distribution of the software without closing the source. Like many other ROMs, CyanogenMod used to be distributed with pre-installed Google-made apps like Gmail, Search, YouTube, etc. This is no longer  the case, however, as in 2009 the corporation reminded the developers that these apps aren&#8217;t licensed for free distribution. Users are still able to install these apps separately, of course.<\/p>\n<p>In addition to that, CyanogenMod uses a number of proprietary device drivers in order to support certain smartphone and tablet models, which could potentially be a source of legal issues. No hardware vendor has officially protested against this over the past seven years, however. One of the other custom ROM distributions—<a href=\"http:\/\/www.replicant.us\/\">Replicant<\/a>—has removed all proprietary drivers from the code base, and currently supports only a few devices.<\/p>\n<p class=\"upgrades\">If you are looking for the help with customization of your own build of Embedded Android that was built from AOSP or any other open-source version just <a data-sumome-listbuilder-id=\"1d56ac5a-0132-41cd-8202-2e2d7ab93c8a\">let us know.<\/a><\/p>\n<h2>AOKP<\/h2>\n<p><a href=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/aokp.jpg\"><img loading=\"lazy\" class=\"wp-image-13636 size-full\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/aokp.jpg\" alt=\"Image Credit: AOKP\" width=\"1177\" height=\"437\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/aokp.jpg 1177w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/aokp-300x111-1.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/aokp-768x285-1.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/aokp-1024x380-1.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/aokp-600x223-1.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/aokp-450x167-1.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/aokp-1000x371-1.jpg 1000w\" sizes=\"(max-width: 1177px) 100vw, 1177px\" \/><\/a><\/p>\n<p>The name <a href=\"http:\/\/aokp.co\/\">Android Open Kang Project<\/a> (AOKP), a wordplay on AOSP, began as a joke when the project started in 2011, but seems to have  stuck. The word &#8220;kang&#8221; is often used by developers and means stolen code, which, of course, has nothing to do with this custom firmware.<\/p>\n<p>AOKP is a lightweight ROM that allows more customisation than the &#8220;vanilla&#8221; option, including custom toggles, advanced LED control, gesture-controlled shortcuts, vibration patterns, application-level permission control, and CPU overclocking.<\/p>\n<p>AOKP&#8217;s original creator Roman Birg <a href=\"http:\/\/www.androidpolice.com\/2014\/01\/24\/android-open-kang-project-founder-roman-birg-joins-cyanogen-incorporated\/\">joined Cyanogen<\/a> in early 2014, which led to a significant slowdown in firmware development. &#8220;Team Kang&#8221; wasn&#8217;t active at all in 2015, which is why there&#8217;s no AOKP ROM based on Android 5.x.<\/p>\n<p>Things changed in 2016, however. A few new faces appeared in the development community, while Birg himself was also reportedly involved in it again. The current version of AOKP, which is based on CyanogenMod 13, is built upon Android 6.0 Marshmallow. The ROM lists about 90 supported devices, some of which are rather different versions of one smartphone or tablet. More than 3.5 million devices were running AOKP as of 2013.<\/p>\n<p>AOKP is distributed under the same licences that cover Android UI (Apache Licence 2) and Linux kernel (GNU GPL v2), which do not limit the use of the firmware in commercial devices, provided the original source code is available for end users to see.<\/p>\n<p>The AOKP custom ROM&#8217;s code base is hosted on GitHub, where everyone is allowed to check it out, make changes and submit a pull request. There&#8217;s also a voting system in place that helps the community to highlight the most important changes and patches.<\/p>\n<p>AOKP is positioned as an aftermarket ROM for end users of smartphones and tablets, and hasn&#8217;t formed any significant partnerships with device manufacturers. There&#8217;s also no way to predict how actively developed the ROM will be in the future, though if you&#8217;re interested in its current code base, it&#8217;s freely available to take and tinker with.<\/p>\n<h2>CopperheadOS<\/h2>\n<p><a href=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/copperheados.png\"><img loading=\"lazy\" class=\"wp-image-13637 size-full\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/copperheados.png\" alt=\"Image Credit: CopperheadOS\" width=\"1090\" height=\"565\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/copperheados.png 1090w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/copperheados-300x156.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/copperheados-768x398.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/copperheados-1024x531.png 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/copperheados-600x311.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/copperheados-450x233.png 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/copperheados-1000x518.png 1000w\" sizes=\"(max-width: 1090px) 100vw, 1090px\" \/><\/a><\/p>\n<p>Based on the Android Open Source Project, <a href=\"https:\/\/copperhead.co\/android\/\">CopperheadOS<\/a> is a security-focused mobile operating system that currently only supports the smartphones and tablets from the Nexus line. It has been created by Copperhead, a two-man &#8220;team of information security researchers, forensic analysts, and software developers&#8221; that helps &#8220;companies keep their sensitive information locked down.&#8221; The company was founded in 2015 and is based in Toronto, Canada.<\/p>\n<p>&#8220;Google&#8217;s Android security team have accepted many of Copperhead&#8217;s patches into their upstream Android Open Source Project (AOSP) code base,&#8221; J.M. Porup wrote in his article about the OS for <a href=\"http:\/\/arstechnica.co.uk\/security\/2016\/08\/copperhead-os-fix-android-security\/\">Ars Technica<\/a>. &#8220;But the  majority of Copperhead&#8217;s security enhancements are not likely ever to reach beyond its small but growing user base, because of performance trade-offs or compatibility issues.&#8221;<\/p>\n<p>Initially the project was based on CyanogenMod, though later on the developers changed their minds.<\/p>\n<p>&#8220;The initial choice of CyanogenMod as the base for the OS was misguided and burned a lot of development time,&#8221; Copperhead co-founder James Donaldson <a href=\"https:\/\/copperhead.co\/blog\/2016\/03\/29\/crowdfunding-partnership-announced\">wrote in the company&#8217;s blog<\/a> in March. &#8220;The project had to be migrated to the Android Open Source Project as the base, with the ambition of supporting many devices scaled back to the Nexus line. We parted ways with one of our 3 co-founders, leaving us with a bigger burden.&#8221;<\/p>\n<p>CopperheadOS brings additional hardening to Android, which includes zero-day exploits protection, enhanced Linux kernel security, stronger sandboxing and isolation of apps, firewall and network security features, etc. Similarly to Replicant, it comes 100 percent free of proprietary software, including hardware drivers and Google apps and services. It also uses an alternative app store, F-Droid, by default.<\/p>\n<p>The source of CopperheadOS can be found in the company&#8217;s GitHub repo. The current version is built upon Android 6.0 Marshmallow. The team also offers an extensive technical overview of the changes it has made to the original AOSP code in order to ensure better protection.<\/p>\n<h2>Replicant<\/h2>\n<p><img loading=\"lazy\" class=\"size-full wp-image-13638\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/replicant-4.2-p51x0-homescreen.jpg\" alt=\"Replicant OS\" width=\"1280\" height=\"800\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/replicant-4.2-p51x0-homescreen.jpg 1280w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/replicant-4.2-p51x0-homescreen-300x188.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/replicant-4.2-p51x0-homescreen-768x480.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/replicant-4.2-p51x0-homescreen-1024x640.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/replicant-4.2-p51x0-homescreen-600x375.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/replicant-4.2-p51x0-homescreen-450x281.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/replicant-4.2-p51x0-homescreen-1000x625.jpg 1000w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" \/><\/p>\n<p>As we already mentioned, <a href=\"http:\/\/www.replicant.us\/\">Replicant<\/a> can be described as CyanogenMod stripped of all proprietary code, which includes hardware drivers. The project was started in 2010 by a team of developers who wanted to create a fully free and pure Android distribution that wouldn&#8217;t use proprietary software.<\/p>\n<p>The ROM supports only nine devices, most of which aren&#8217;t exactly new. Nevertheless, the ROM seems to be in active development these days, although the current stable version is built upon Android 4.2 Jelly Bean. In a recent <a href=\"http:\/\/blog.replicant.us\/2016\/08\/replicant-6-early-work-upstream-work-and-f-droid-issue\/\">blog post<\/a>, Denis ‘GNUtoo’ Carikli wrote that &#8220;Replicant is being updated from Android 4.2 to Android 6.0 by Wolfgang Wiedmeyer.&#8221;<\/p>\n<p>Just like  most of the other custom Android ROMs, Replicant is distributed under Apache License 2.0 and GNU GPLv2. Its source code is hosted by the Free Software Foundation, which also supports the project financially.<\/p>\n<p>Although not without limitations, Replicant could be a good choice for those looking for a totally free software to run on their hardware with the  possibility of adding device drivers where necessary.<\/p>\n<h2>OmniROM<\/h2>\n<p><img loading=\"lazy\" class=\"size-full wp-image-13639\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/omnirom.jpeg\" alt=\"Image credit: thoth19 \/ Oppo.com\" width=\"1350\" height=\"800\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/omnirom.jpeg 1350w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/omnirom-300x178.jpeg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/omnirom-768x455.jpeg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/omnirom-1024x607.jpeg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/omnirom-600x356.jpeg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/omnirom-450x267.jpeg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/omnirom-1000x593.jpeg 1000w\" sizes=\"(max-width: 1350px) 100vw, 1350px\" \/><\/p>\n<p>Started by a team of Android enthusiasts in 2013, <a href=\"https:\/\/omnirom.org\/\">OmniROM<\/a> is believed to be a community-driven response to the commercialisation of CyanogenMod. As a matter of fact, most of its core developers used to be involved with CyanogenMod before Kondik raised funding for Cyanogen Inc.<\/p>\n<p>The ROM is based on AOSP and offers a multitude of advanced UI customisation features, much like the other firmwares in this overview. It also allows for a number of performance tweaks and CPU fine-tuning. However, arguably the biggest thing that team Omni has achieved is a working multi-window mode, which was first shown in 2014.<\/p>\n<p><center><iframe src=\"https:\/\/www.youtube.com\/embed\/f5bcccyBPsU?rel=0\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/center>Currently OmniROM supports 35 devices, some of which have already received &#8220;nightly&#8221; builds of the firmware using Android 6.0. Interestingly, the team at OmniROM has an unconventional approach to nightlies, which it <a href=\"https:\/\/omnirom.org\/about\/\">expressed<\/a> on the ROM&#8217;s website:<\/p>\n<p>&#8220;…the argument that ‘nightlies are not for end users’ is over-used, and no longer valid. We’ve found that the vast majority of users want to get nightly updates to their ROM. For that reason, nightlies aren’t a playground – nightlies are for new features that are finished. You should be able to expect the same stability and reliability from a nightly as you would from a “release” ROM, [as well as being able to] report any bugs that prevent this from happening.&#8221;<\/p>\n<p>Therefore, it appears that anyone willing to check out the ROM shouldn&#8217;t be looking for a &#8220;stable&#8221; release, but should rather download the latest build available.<\/p>\n<p>Since OmniROM is a pronounced non-commercial project, it still remains a volunteer initiative that lives on donations. No hardware manufacturers have pre-installed the firmware on their devices so far, although the Marshmallow-based version of it was quite popular with the users of OnePlus One.<\/p>\n<h2>ParanoidAndroid<\/h2>\n<p><a href=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/ParanoidAndroid_4.42.jpg\"><img loading=\"lazy\" class=\"wp-image-13640 size-full\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/ParanoidAndroid_4.42.jpg\" alt=\"Image Credit: ParanoidAndroid OS\" width=\"1926\" height=\"1204\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/ParanoidAndroid_4.42.jpg 1926w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/ParanoidAndroid_4.42-300x188.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/ParanoidAndroid_4.42-768x480.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/ParanoidAndroid_4.42-1024x640.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/ParanoidAndroid_4.42-600x375.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/ParanoidAndroid_4.42-450x281.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/ParanoidAndroid_4.42-1000x625.jpg 1000w\" sizes=\"(max-width: 1926px) 100vw, 1926px\" \/><\/a><\/p>\n<p>It sounds quite counter-intuitive, but <a href=\"http:\/\/www.paranoidandroid.co\/\">ParanoidAndroid<\/a> isn&#8217;t focused on security and privacy features at all, but rather enjoys a good rhyme. Nevertheless, in 2015 it was called the second-largest custom Android ROM in the world after CyanogenMod and had more than 200,000 users.<\/p>\n<p>Like many ROMs around, ParanoidAndroid pays attention to advanced customisation, enhanced UI, and performance tweaks. The firmware, however, also has a few features that make it stand out from the crowd. These include the floating mode, a tweak similar to OmniROM&#8217;s multi-window mode which allows you to have an app window floating on top of any other app you&#8217;re working with.<\/p>\n<p>It also has the so-called &#8220;pie controls,&#8221; a feature that allows the user to slide from any side of the screen to see a semicircular block of shortcuts to apps and services. This feature is especially useful in the ROM&#8217;s &#8220;immersive mode&#8221; which removes the navigation buttons from the bottom of the screen.<\/p>\n<p>The project was launched in 2011 by Paul Henschel, whose volunteering team worked on the ROM actively until early 2015, when a few key people were poached from there by the phone manufacturer OnePlus. At that time, Oppo-owned OnePlus had had a row with Cyanogen Inc. over licensing in India, and decided to develop its own mobile OS, OxygenOS.<\/p>\n<p>The exodus of a few core developers significantly slowed the pace of Paranoid&#8217;s new releases. In October 2015, a news website <a href=\"http:\/\/www.androidauthority.com\/paranoid-android-calling-it-quits-648429\/\">Android Authority<\/a> learned that the project was all but put on hold.<\/p>\n<p>&#8220;Although [Matt Flaming, one of ParanoidAndroid&#8217;s project leads] didn’t have any official statement to share from the team, Flaming relayed to us that the remaining members at PA have become too busy with their lives to continue working on the project,&#8221; the story went. &#8220;You see, the dev team has always been extremely small, so when everyone seems to have more important things to work on it can be difficult to get work done. Some of the members are focusing on finishing up college and have other important things going on.&#8221;<\/p>\n<p>ParanoidAndroid users and admirers were quite pleased, however, when the team announced the ROM&#8217;s comeback a couple of months ago. The current version of the firmware is built upon Android 6.0.1 Marshmallow, and some 30 devices are supported.<\/p>\n<p>The source code of the ParanoidAndroid ROM is hosted on Github, available for everyone to tinker with. It&#8217;s distributed under the same licences as the Linux kernel and AOSP, which are Apache License 2.0 and GNU GPL v2.<\/p>\n<h2>MIUI<\/h2>\n<p><a href=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/miui.jpg\"><img loading=\"lazy\" class=\"wp-image-13641 size-full\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/miui.jpg\" alt=\"MIUI OS\" width=\"1920\" height=\"1080\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/miui.jpg 1920w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/miui-300x169.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/miui-768x432.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/miui-1024x576.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/miui-600x338.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/miui-450x253.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/miui-1000x563.jpg 1000w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" \/><\/a><\/p>\n<p>This ROM is an aftermarket version of Xiaomi&#8217;s Android build that the company pre-installs on its own devices. As of February 2016, the firmware was supported on more than 340 devices, which includes Xiaomi&#8217;s own hardware.<\/p>\n<p>Initially, <a href=\"http:\/\/en.miui.com\/\">MIUI<\/a> was based on AOSP and CyanogenMod code base. Its kernel was kept proprietary until October 2013, when it was released on Github in accordance with the requirements of the GPL licence. Two years later, Xiaomi also opened kernel sources for a few of its devices, including the Mi3, Mi4, MiNote and Redmi 1S.<\/p>\n<p>The current version of the ROM—MIUI 7—is based on Android Marshmallow and includes useful features like a special child mode, significantly improved large fonts support, video greetings to use for phone calls, and so on. In addition to this, Xiaomi has just announced that MIUI 8 will roll out to its devices this week, which means that it might soon be backported to other phones and tablets.<\/p>\n<p>Since Xiaomi is a company that works mostly on the Chinese market, where Google&#8217;s apps and services are largely banned, it has created a suite of cloud apps of its own, which are included into the firmware. The ROM is now distributed under the double licence common for custom Android firmware—GNU GPL v3 and Apache 2.0.<\/p>\n<p class=\"upgrades\">If you are looking for the help with customization of your own build of Embedded Android that was built from AOSP or any other open-source version just <a data-sumome-listbuilder-id=\"1d56ac5a-0132-41cd-8202-2e2d7ab93c8a\">let us know.<\/a><\/p>\n<h2>Summary<\/h2>\n<p>The choice of custom Android firmware builds is getting wider by the day, but it appears that there are still a few core projects which the community is building upon. Going for one of the most popular and actively developed ROMs would be the least risky option, while those interested in more niche features can try out  lesser-known options. At the end of the day, there&#8217;s always the  possibility of talking  to the developers to try and work out a solution which is tailor-made for your situation.<\/p>\n<p>Have you already tried to get a custom Android ROM working on your hardware? Share your experience in the comments section!<\/p>\n<p style=\"text-align: right;\">Illustration by Alina Kropacheva<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of the most important tasks faced by hardware developers is choosing the right operating system &#8220;flavour&#8221; to run. <\/p>\n","protected":false},"author":63,"featured_media":13635,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[800],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"Having a hard time choosing the right ROM for you embedded software development project? See our comprehensive guide on ROMs for Android.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/open-source-android-roms-you-can-use-for-your-device\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"7 Open-Source ROMs for Android\" \/>\n<meta property=\"og:description\" content=\"Having a hard time choosing the right ROM for you embedded software development project? See our comprehensive guide on ROMs for Android.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/open-source-android-roms-you-can-use-for-your-device\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2016-09-06T12:13:43+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-09-24T18:26:18+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/cyanogenmod-androidpolice.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2500\" \/>\n\t<meta property=\"og:image:height\" content=\"1667\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/open-source-android-roms-you-can-use-for-your-device\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/cyanogenmod-androidpolice.jpg\",\"width\":2500,\"height\":1667,\"caption\":\"Image credit: Android Police\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/open-source-android-roms-you-can-use-for-your-device\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/open-source-android-roms-you-can-use-for-your-device\/\",\"name\":\"7 Open-Source ROMs for Android\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/open-source-android-roms-you-can-use-for-your-device\/#primaryimage\"},\"datePublished\":\"2016-09-06T12:13:43+00:00\",\"dateModified\":\"2019-09-24T18:26:18+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\"},\"description\":\"Having a hard time choosing the right ROM for you embedded software development project? See our comprehensive guide on ROMs for Android.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/open-source-android-roms-you-can-use-for-your-device\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\",\"name\":\"Anastasiia Hibaieva\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5e777493cd8ae0902fee5b35c44765ce?s=96&d=mm&r=g\",\"caption\":\"Anastasiia Hibaieva\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/13631"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/63"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=13631"}],"version-history":[{"count":0,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/13631\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/13635"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=13631"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=13631"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=13631"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}