{"id":16247,"date":"2019-02-25T19:30:09","date_gmt":"2019-02-25T16:30:09","guid":{"rendered":"https:\/\/www.intellectsoft.net\/blog\/?p=16247"},"modified":"2020-08-19T14:26:34","modified_gmt":"2020-08-19T11:26:34","slug":"hospitality-and-hotel-industry-trends","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/hospitality-and-hotel-industry-trends\/","title":{"rendered":"Hotel Industry Trends: From Decades of Innovation — to Digital Transformation"},"content":{"rendered":"\r\n\r\n\r\n<p>Decade after decade since its inception over 150 years ago, the modern hospitality industry has always been the herald of technological innovation. Hotels were first to successfully adopt telephones, intercom, and lighting long before they became common for households and the name elevator superseded the old, odd “ascending room.”  <\/p>\r\n\r\n\r\n\r\n<p>Elaborately designed, guest service-first structures, hotels were separate worlds onto themselves, built to exceed expectations of its clientele over and over again with new technological conveniences and amusements.<\/p>\r\n\r\n\r\n\r\n<p>The world of the modern hotel (especially a luxury hotel) has grown significantly since. Still, the hospitality industry is on yet another technological threshold. New technologies are helping the hotels become not worlds, but entire universes. Where in the past the hospitality industry always tried to exceed expectations of their guests, modern tech will allow to predict them with high precision, attuning the guest experience on-the-go to fit personal demands. More so, all of this will happen automatically and will only require human supervision.<\/p>\r\n\r\n\r\n\r\n<p>From comprehensive smart room solutions to virtual reality to artificial intelligence, join us as we explore the technologies that already started changing the hospitality industry, as well as look at one real-life case study encompassing those technologies.<\/p>\r\n\r\n\r\n\r\n<h2>Smart Rooms &amp; Internet of Things<\/h2>\r\n\r\n\r\n\r\n<p>The digital transformation of the hospitality industry starts with elevating the concept of the room to include the latest technology. Enter smart room — a cloud-based system with IoT devices that gives guests control over their experience with a mobile device, typically an in-room tablet. More specifically, guest can control a wide range of amenities and guest services. This includes lights, conditioning, media devices in every room separately via many IoT sensors; as well chat with concierges, hotel restaurants booking, and instant access to flight schedules. On top of that, the tablets powering a smart room present a new avenue for driving sales with personalised promotional offers for each guest.<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"1024\" height=\"640\" class=\"wp-image-16257\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Modern-hotel-room-pic-1-1024x640.jpg\" alt=\"\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Modern-hotel-room-pic-1-1024x640.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Modern-hotel-room-pic-1-300x188.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Modern-hotel-room-pic-1-768x480.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Modern-hotel-room-pic-1-600x375.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Modern-hotel-room-pic-1-450x281.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Modern-hotel-room-pic-1-1000x625.jpg 1000w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Modern-hotel-room-pic-1.jpg 2000w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\r\n\r\n\r\n\r\n<p>As rooms are at the heart of any hotel experience, their smarter versions will become default for the hotel industry in the nearest future. Concurrently, they will be the cornerstone and the starting point in full-fledged Digital Transformation of the hospitality industry, allowing hotel chains to deliver better experiences, drive sales, and learn more about their guests to continuously improve the services further.<\/p>\r\n\r\n\r\n\r\n<p>The possibilities do not end there, and it is easy to see why the smart room idea has emerged in the first place, becoming one of the top trends in hospitality over the recent years. Whether it is millennials or other generations, modern guests have high expectations from staying at a hotel or resort. If the other services they use in their daily lives are pleasant, easy, fast, and personalised, they expect even more from top-dollar hotels in the age of high technology and market disruptors like Airbnb and VRBO. Guests anticipate a new level of comfort and customer experience — with unique features and services to surprise and help them throughout the stay.<\/p>\r\n\r\n\r\n\r\n<p>This goes in line with one of the overarching hotel industry trends — <a href=\"https:\/\/www.cognizant.com\/whitepapers\/hospitality-in-the-digital-era-codex2543.pdf\" target=\"_blank\" rel=\"noreferrer nofollow noopener\" aria-label=\" (opens in a new tab)\">hyper-personalisation<\/a>. Achieving it will not be possible without smart room solutions and IoT. Therefore, shifting to smart rooms is something no leading hotel chain can miss out on.<\/p>\r\n\r\n\r\n\r\n<h3>Beacon Technology<\/h3>\r\n\r\n\r\n\r\n<p>Although not widely used in the hotel sector today, beacons will become its mainstays in the near future. This compact and cost-efficient devices can send notifications with promotional offers or useful tips to a hotel app, or simply to smartphone. Different in type, sizes, and durability, beacons will help hotels drive sales and improve the guest experience <em><strong>outside the rooms<\/strong><\/em>, including locations with high temperature, swimming pools, and spas. For example, Fontainebleau Miami uses their data from beacons and property management systems to generate early guest check-in and late-stay promotional offers.<\/p>\r\n\r\n\r\n\r\n<p>See our concise guide to beacons to find out <a href=\"https:\/\/www.intellectsoft.net\/blog\/what-are-beacons-and-how-do-they-work\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">more<\/a>.<\/p>\r\n\r\n\r\n\r\n<h2>The Transformation of the Booking Process<\/h2>\r\n\r\n\r\n\r\n\r\n\r\n<h3>Augmented &amp; Virtual Reality<\/h3>\r\n\r\n\r\n\r\n<p><a href=\"https:\/\/qz.com\/1153004\/airbnb-is-working-on-ar-and-vr-applications-for-booking-rooms-and-vacations\/\" target=\"_blank\" rel=\"noreferrer nofollow noopener\" aria-label=\" (opens in a new tab)\">Airbnb<\/a> is already experimenting with Augmented and Virtual reality for the booking process, and hotel chains will follow suit for several reasons. Both technologies eliminate the ongoing guessing game of how the room would look like for the guests, facilitating the buying decision process. Potential guests can also leave markers with notes in the AR environment to notify hotel staff about their wishes and preferences beforehand.   <\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image is-resized\"><img loading=\"lazy\" class=\"wp-image-16249\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Experience-683x1024.jpg\" alt=\"new trends in hospitality industry\" width=\"355\" height=\"532\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Experience-683x1024.jpg 683w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Experience-200x300.jpg 200w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Experience-768x1152.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Experience-600x900.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Experience-300x450.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Experience-667x1000.jpg 667w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Experience.jpg 1707w\" sizes=\"(max-width: 355px) 100vw, 355px\" \/><\/figure>\r\n\r\n\r\n\r\n<p>The experience can unfold on a smartphone, laptop, consumer AR and VR glasses, as well as sophisticated headsets with full-fledged premises previews. Thus, AR and VR give more freedom to users in choosing their hotel, allowing them see and even experience what are they paying for, whether it is an exotic resort in a far away corner of the planet or a popular place of destination somewhere in Europe. This not a fantasy —<a href=\"https:\/\/www.brandchannel.com\/2016\/04\/12\/brandspeak-virtual-reality-brands-041116\/\" target=\"_blank\" rel=\"noreferrer nofollow noopener\" aria-label=\" (opens in a new tab)\"> Marriott Hotels<\/a> offered such a VR experiences several years ago.<\/p>\r\n\r\n\r\n\r\n<h3>Artificial Intelligence<\/h3>\r\n\r\n\r\n\r\n<p>Powered by <a href=\"https:\/\/www.intellectsoft.net\/blog\/artificial-intelligence-and-machine-learning-concise-guide\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">machine learning algorithms<\/a> instead of pre-set commands, AI-driven chatbots will automate and simplify the booking experience. Such algorithms will be trained on call center agents’ conversations and customers’ website booking behaviour to offer the most fitting booking options for each guest, and sometimes even anticipate demand for additional services, and thus creating another way to drive sales.<\/p>\r\n\r\n\r\n\r\n<h3>Mobile<\/h3>\r\n\r\n\r\n\r\n<p>No impressive technology will work on its own when it comes to the booking process: mobile will remain one of the key hotel industry trends in the coming years. Thus, a hotel will need to ensure their branded hotel app has a simple, fluid, and highly functional booking process. For example, a luxury hotel’s mobile app can allow guests book rooms for their fellow travelers and pay for them; or assign rooms in big resort villas to different guests while also leaving individual notes with preference — all in one app, in a simple interface with only a few scrolls.<\/p>\r\n\r\n\r\n\r\n<h2>Artificial Intelligence-driven Customer Experience<\/h2>\r\n\r\n\r\n\r\n<p>In the coming years, as the hotel industry introduces automation, AI chatbots will take center stage as <strong>virtual assistants<\/strong> for every step of the stay. Employing machine learning, this consultants will be part of hotel apps to answer basic queries, for example:<\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li>Do you have a two bedroom available for one night?<\/li>\r\n<li>Does your hotel serve vegetarian dishes?<\/li>\r\n<li>Can I bring my dog along?<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p>Virtual assistants will help, guide, and provide offers for guests throughout the stay based on the data they share with the hotel, as well as their behaviour in the smart room, hotel app, and on the other platforms. A famous yoga coach will lead a morning session at your hotel? The virtual assistant will notify the guest who are interested in yoga with a single messages, proposing to sign up right away. A family staying at one of your properties is visiting the city for a first time? The AI concierge will provide recommendations if they plan to go out. There is a weather emergency at the resort? The chatbot will send a notification with safety tips immediately.<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"1024\" height=\"683\" class=\"wp-image-16250\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Ocean-Resort-at-Evening-1024x683.jpg\" alt=\"\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Ocean-Resort-at-Evening-1024x683.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Ocean-Resort-at-Evening-300x200.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Ocean-Resort-at-Evening-768x512.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Ocean-Resort-at-Evening-600x400.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Ocean-Resort-at-Evening-450x300.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Ocean-Resort-at-Evening-1000x667.jpg 1000w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Ocean-Resort-at-Evening.jpg 2000w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\r\n\r\n\r\n\r\n<p>AI concierges can also help drive better customer services and thus significantly increase  service revenues. For example, one of the guests stays at the same hotel every month and prefers the same Asian restaurant. The virtual concierge will always keep them posted about new and seasonal menu items.<\/p>\r\n\r\n\r\n\r\n<p>Better stated, AI is one the top hospitality trends for the future along with smart rooms. AI-driven solutions will open the doors to hyper-personalisation wide open, and this process has already started. In 2016, one <a href=\"https:\/\/www.cognizant.com\/whitepapers\/hospitality-in-the-digital-era-codex2543.pdf\" target=\"_blank\" rel=\"noreferrer nofollow noopener\" aria-label=\" (opens in a new tab)\">luxury UK hotel developer<\/a> created a smartphone-based AI service to let guests book rooms and request local area recommendations by messaging.<\/p>\r\n\r\n\r\n\r\n<h2>VR &amp; AR Entertainment<\/h2>\r\n\r\n\r\n\r\n<p>In the upcoming decade, the hotel sector will always need to find many fresh ways to keep their guests entertained. Any type of gamification can be appreciated if used in the right area of the hotel experience. Here, AR &amp; VR emerge once again as both future and current trends in the hospitality industry. Guest will definitely enjoy exploring the hotel grounds with Pokemon Go-like experiences, while their kids can play an AR quest that matches the theme of the hotel, discoverings game treasure items as they explore the hotel as well.<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"1024\" height=\"768\" class=\"wp-image-16252\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Infotainment-1-1024x768.jpg\" alt=\"trends in hospitality industry\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Infotainment-1-1024x768.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Infotainment-1-300x225.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Infotainment-1-768x576.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Infotainment-1-600x450.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Infotainment-1-450x338.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/VR-Infotainment-1-1000x750.jpg 1000w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\r\n\r\n\r\n\r\n<p>The possibilities with AR and VR are many; they depend on creativity and, expectedly, the size of investment. For example, <a href=\"https:\/\/www.brandchannel.com\/2016\/04\/12\/brandspeak-virtual-reality-brands-041116\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Marriott Hotels<\/a> surprised their customers with VR postcards, immersing them into headset-driven 3-D travels stories.<\/p>\r\n\r\n\r\n\r\n<h2>Case Study in Hotel Innovation — Smart Rooms, Cloud &amp; Mobile for Luxury Asian Hotel Chain<\/h2>\r\n\r\n\r\n\r\n\r\n\r\n<h3>Smart Rooms<\/h3>\r\n\r\n\r\n\r\n<p>A leading Asian hotel chain approached Intellectsoft for a comprehensive smart room solution for their brand new property. This was the first time the company outsourced software development. Closely collaborating with the client’s team on and off site, we created a tablet-based solution with pre-set designs for each hotel suite.<\/p>\r\n\r\n\r\n\r\n<p>The solution gives guest complete control over room environment, guest services, and maintains the branded premium experience the client is known for.<\/p>\r\n\r\n\r\n\r\n<p><strong>Features Include:<\/strong><\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li>Attune amenities: air conditioning, light, windows, and media centers in every room.<\/li>\r\n<li>Order guest services<\/li>\r\n<li>Chat with staff<\/li>\r\n<li>Order food to room<\/li>\r\n<li>Access all the information about the hotel<\/li>\r\n<li>See flight schedules<\/li>\r\n<li>Stay notified with alerts<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p><strong>Benefits for the Client:<\/strong><\/p>\r\n\r\n\r\n\r\n<ol>\r\n<li>Next-level guest experience with unique, state-of-the-art smart rooms<\/li>\r\n<li>New, wide avenue to drive sales with spot-on promotional offers sent right to the devices<\/li>\r\n<li>Extends and solidifies the hotel’s branded premium experience<\/li>\r\n<li>The client can learn more about their customers with new data, and continuously improve the experience further<\/li>\r\n<li>Cloud-based solution that integrates with other client’s systems<\/li>\r\n<\/ol>\r\n\r\n\r\n\r\n\r\n\r\n<h3>Cloud: Single Architecture for All Operations<\/h3>\r\n\r\n\r\n\r\n<p>Having successfully implemented the smart room solution, Intellectsoft is now helping the client make an ambitious transition from legacy systems to one enterprise architecture model, where all systems have exposed APIs.<br \/><br \/>With this model, the client’s different systems can be re-configured and combined with each other, allowing for flexible and faster creation of new business scenarios and new trends in hospitality industry.<\/p>\r\n\r\n\r\n\r\n<p>For example, a hotel chain has a branded mobile app for the guests, where they can book rooms, access loyalty cards, follow the latest updates, and other. The company plans to add the purchase of tickets for their new entertainment parks built as part of some of the resorts. Instead of establishing this separately, a single cloud architecture where systems have exposed APIs will allow to cut costs and time, largely because the payment processing functionality and the backbone for the functionality are already there. Plus, the feature will essentially be a part of the entire open-ended system where everything is in one place.<\/p>\r\n\r\n\r\n\r\n<h3>Branded Mobile Application<\/h3>\r\n\r\n\r\n\r\n<p>The client also entrusted us to transfer their brand experience to mobile. This resulted in a simple and eye-pleasing mobile app. In a few easy steps, the customers can book rooms for themselves and their travel companions, managing an array of essential options along the way. The application allows the customers to manage their membership and loyalty cards as well. To make the booking process as simple as possible, we also integrated the most popular payment service in the country.<\/p>\r\n\r\n\r\n\r\n<h2>Concluding Thoughts: Gradually Embracing the Hotel Industry Trends<\/h2>\r\n\r\n\r\n\r\n<p>The road to <a href=\"https:\/\/www.intellectsoft.net\/services\/digital-transformation-services\">digital transformation<\/a> is long, but the benefits of taking it are many. The majority of the modern sophisticated technologies can help the hotel industry change in a meaningful way — significantly improving many areas of the guest experience, driving sales, and introducing new, exciting dimensions to both vacations and business trips. What is interesting, the list of technologies forming the bedrock of this transformation does not end on the ones mentioned above. There will be many new trends in the hospitality industry that will help it change in exciting and meaningful ways, towards new bright horizons.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>Top trends in hospitality, plus one comprehensive luxury hotel case study. <\/p>\n","protected":false},"author":63,"featured_media":16271,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[13],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"In the coming years, the hospitality industry trends will help hotels and resorts deliver outstanding guest experiences and become more efficient. Learn more.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/hospitality-and-hotel-industry-trends\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Future Hotel Industry Trends (+ Luxury Hotel Case Study)\" \/>\n<meta property=\"og:description\" content=\"In the coming years, the hospitality industry trends will help hotels and resorts deliver outstanding guest experiences and become more efficient. Learn more.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/hospitality-and-hotel-industry-trends\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2019-02-25T16:30:09+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-08-19T11:26:34+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Beach-Umbrellas.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1300\" \/>\n\t<meta property=\"og:image:height\" content=\"650\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/hospitality-and-hotel-industry-trends\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Beach-Umbrellas.jpg\",\"width\":1300,\"height\":650,\"caption\":\"Hospitality Industry Trends\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/hospitality-and-hotel-industry-trends\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/hospitality-and-hotel-industry-trends\/\",\"name\":\"Future Hotel Industry Trends (+ Luxury Hotel Case Study)\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/hospitality-and-hotel-industry-trends\/#primaryimage\"},\"datePublished\":\"2019-02-25T16:30:09+00:00\",\"dateModified\":\"2020-08-19T11:26:34+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\"},\"description\":\"In the coming years, the hospitality industry trends will help hotels and resorts deliver outstanding guest experiences and become more efficient. Learn more.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/hospitality-and-hotel-industry-trends\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\",\"name\":\"Anastasiia Hibaieva\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5e777493cd8ae0902fee5b35c44765ce?s=96&d=mm&r=g\",\"caption\":\"Anastasiia Hibaieva\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/16247"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/63"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=16247"}],"version-history":[{"count":0,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/16247\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/16271"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=16247"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=16247"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=16247"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}