{"id":17615,"date":"2019-11-29T02:34:18","date_gmt":"2019-11-28T23:34:18","guid":{"rendered":"https:\/\/www.intellectsoft.net\/blog\/?p=17615"},"modified":"2020-03-02T12:41:29","modified_gmt":"2020-03-02T09:41:29","slug":"tech-trends-2020","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/tech-trends-2020\/","title":{"rendered":"5 Tech Trends of 2020 Every CIO Needs to Know"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">If previous years were mostly marked by the exciting evolution of emerging technologies, 2020 will be different. Technology advances will often be accompanied by various public and private issues that companies and the public will need to consider and deal with. Still, this doesn’t mean 2020 won’t hold anything exciting, or that the big-scale adoption of new technologies will stop. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In this article, we will make projections across 5 technology areas:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">AI algorithms in fake news and the future of media<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The not-so-comfortable truth about the state of AR &amp; VR adoption <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Endpoint growth, edge computing, and other IoT industry trends<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Financial organizations embracing a shared ecosystem<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">First steps of face recognition technology in financial services<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">There are many interesting developments to talk about. Let’s start.<\/span><\/p>\n<h2><strong>AI Trends: Algorithms in Media &amp; Fake News<\/strong><\/h2>\n<p><span style=\"font-weight: 400;\">The media industry has already seen AI-driven virtual TV presenters <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=HJcdVjkqiW8&amp;feature=youtu.be\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">in action<\/span><\/a><span style=\"font-weight: 400;\">. The technology paves the way for a potential revolution in the industry, allowing media companies to produce a lot of content on-the-fly.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Still, over the last two years, the public, the media, governmental organizations, and prominent artists have grown increasingly alarmed about how deepfakes can sway opinions online, influencing political events. In 2017, the University of Washington created the notorious <\/span><a href=\"https:\/\/edition.cnn.com\/interactive\/2019\/01\/business\/pentagons-race-against-deepfakes\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">deepfake<\/span><\/a><span style=\"font-weight: 400;\"> video of <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=AmUC4m6w1wo\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">President Barack Obama<\/span><\/a><span style=\"font-weight: 400;\">, there was a doctored video of House Speaker Nancy Pelosi, a deepfake video of Mark Zuckerberg, and <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=bE1KWpoX9Hk\"><span style=\"font-weight: 400;\">other examples<\/span><\/a><span style=\"font-weight: 400;\">. The resemblance between the real and fake political figures proved almost uncanny, prompting discussions about the big perils of deepfake technology and other AI uses. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Today, doctored videos can be spotted upon closer examination, but the technology keeps evolving, while easy-to-use deepfake creation tools are available online. Although <\/span><a href=\"https:\/\/www.theverge.com\/2019\/3\/5\/18251736\/deepfake-propaganda-misinformation-troll-video-hoax\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">current countermeasures<\/span><\/a><span style=\"font-weight: 400;\"> can detect deepfakes and their creators quickly and easily, this may change soon: the technology is evolving, so the countermeasures will need to evolve as well. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Fighting fake articles online will be more challenging, though. MIT’s Computer Science and Artificial Intelligence Laboratory (CSAIL) has been going to great lengths to showcase the scale of the problem. CSAIL has conducted two scientific investigations (publishing a paper for each in the August of 2019), and both showed that current AI-driven fake news detecting systems, no matter how sophisticated, are not effective enough and face many nuanced challenges.<\/span><\/p>\n<p><a href=\"https:\/\/venturebeat.com\/2019\/10\/15\/mit-csail-fights-fake-news-with-ai\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">With other companies joining the battle<\/span><\/a><span style=\"font-weight: 400;\">, (including Facebook), this means that we will definitely see more sophisticated AI tools aimed at reducing the quantity and impact of fake news in 2020 and beyond, across the board. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The laws will follow suit as well. In 2020, we may expect new deepfake and fake news scandals, hearings on that cases, as well as first instances of comprehensive regulation in the most progressive countries. All popular platforms would use AI algorithms to automatically detect and block deepfakes and fake news, as well as trace their creators.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">All in all, trends in AI will be a hot topic in 2020.<\/span><\/p>\n<h2><strong>Augmented &amp; Virtual Reality Trends Slow Down<\/strong><\/h2>\n<p><span style=\"font-weight: 400;\">Although established companies use AR in <\/span><a href=\"https:\/\/www.intellectsoft.net\/blog\/how-brands-use-augmented-reality-in-manufacturing\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">manufacturing<\/span><\/a><span style=\"font-weight: 400;\">, <\/span><a href=\"https:\/\/www.intellectsoft.net\/blog\/microsoft-hololens-usage-in-construction\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">building construction<\/span><\/a><span style=\"font-weight: 400;\">, <\/span><a href=\"https:\/\/www.intellectsoft.net\/blog\/how-ar-apps-changed-the-world\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">retail<\/span><\/a><span style=\"font-weight: 400;\">, and other industries, the general adoption progresses slowly. Games and gamified customer experiences continue to be the main driver for both AR and VR. <\/span><\/p>\n<p><a href=\"https:\/\/www.wired.com\/story\/future-ar-vr-survey\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">According to a survey by XRDC<\/span><\/a><span style=\"font-weight: 400;\">, fifty-nine percent of AR and VR projects are game-related. This won’t change anytime soon, at least for VR. Steam will be pushing its <\/span><a href=\"https:\/\/www.theverge.com\/2019\/11\/22\/20976234\/valve-half-life-alyx-steamvr-index-headset-gaming-storefront-platform\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">SteamVR<\/span><\/a><span style=\"font-weight: 400;\"> platform with the recently announced Half-Life: Alyx, driving the competition on the VR market. Still, the adoption of both technologies continues to grow steadily in other industries, like education and training. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As AR has been growing slowly in the last two years, there is no indication this will change in 2020, despite the release of HoloLens 2 in November 2019. There is the usual back-and-forth in the rumours about Apple’s AR headset, but hard evidence on whatever the company is developing will are non-existent. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Still, we can expect AR to continue breathing new life into familiar experiences. Readers tired of consuming content the old way will definitely enjoy immersive experiences and new story angles enabled by the technology, like those seen in The New York Times <\/span><a href=\"https:\/\/www.nytimes.com\/spotlight\/augmented-reality\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">AR\/VR section<\/span><\/a><span style=\"font-weight: 400;\"> and by <\/span><a href=\"https:\/\/time.com\/5628880\/time-immersive-app-ar-vr\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">TIME’s new AR\/VR app<\/span><\/a><span style=\"font-weight: 400;\">. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As for other augmented reality trends, the technology will also help ecommerce drive sales in 2020 and beyond. As customers are tired of the same types of ads and their ubiquity, brands will follow into the steps of Instagram (who released its <\/span><a href=\"https:\/\/sparkar.facebook.com\/ar-studio\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">Spark AR Studio<\/span><\/a><span style=\"font-weight: 400;\"> to public this year), building AR catalogues of their goods and creating digital experiences with AR lenses in mind. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">AR lenses and filters are booming, but they should be approached carefully by development teams in the future. For example, Instagram removed filters that depict or promote cosmetic surgery amid concerns they <\/span><a href=\"https:\/\/www.bbc.com\/news\/business-50152053\"><span style=\"font-weight: 400;\">harm mental health<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">AR try-in on web pages and in mobile apps would also gain more traction. This option is more cost-effective compared to other AR solutions as well as convenient for users, who would only need to open the camera on their smartphone to try a T-shirt or sunglasses on. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">According to a <\/span><a href=\"https:\/\/www.sciencedirect.com\/science\/article\/abs\/pii\/S002243591930020X\"><span style=\"font-weight: 400;\">study<\/span><\/a><span style=\"font-weight: 400;\"> published by four UK universities, AR improves decision comfort, prompts users to give positive word-of-mouth recommendations, and drives sales of more expensive products.  <\/span><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-17616\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Adobe-Aero-1024x683.jpg\" alt=\"augmented reality trends\" width=\"780\" height=\"520\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Adobe-Aero-1024x683.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Adobe-Aero-300x200.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Adobe-Aero-768x512.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Adobe-Aero-600x400.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Adobe-Aero-450x300.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Adobe-Aero-1000x667.jpg 1000w\" sizes=\"(max-width: 780px) 100vw, 780px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">The big-scale adoption of AR will continue in 2020 with products like Adobe’s <\/span><a href=\"https:\/\/techcrunch.com\/2019\/11\/04\/adobe-launches-aero-its-ar-authoring-app\/\"><span style=\"font-weight: 400;\">Aero<\/span><\/a><span style=\"font-weight: 400;\">, which allows designers to create AR experience without coding easily. The iPad app gives users a step-by-step guide on how to build AR scenes, allowing them to use their existing assets from the Adobe Creative Cloud. The app allows to create basic AR experiences, with the full-fledged version coming to desktop in 2020. <\/span><\/p>\n<h2><strong>Internet of Things — Adoption Continues  <\/strong><\/h2>\n<p><span style=\"font-weight: 400;\">Most of the IoT industry trends are connected to streamlining existing IoT-driven operations further, sustating IoT device growth, and building massive ecosystems.<\/span><\/p>\n<h3><strong>Tapping into IoT Metadata<\/strong><\/h3>\n<p><span style=\"font-weight: 400;\">For the last decade, enterprises have been gathering and using data from smart endpoint devices in their IoT ecosystems to a great extent. The next step will be <\/span><a href=\"https:\/\/www.crn.com\/slide-shows\/internet-of-things\/5-emerging-iot-trends-to-watch-in-2020\/3\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">using that data’s metadata<\/span><\/a><span style=\"font-weight: 400;\"> to drive intelligence systems, increasing the level of personalization further, and giving context to otherwise incomprehensive scenarios in data sets. As a result, the companies will be able to structure unstructured data and improve the process of developing their cognitive systems.<\/span><\/p>\n<h3><strong>Confident Endpoint Growth<\/strong><\/h3>\n<p><span style=\"font-weight: 400;\">Staying on the subject of endpoints, their number will grow in 2020, as devices like smart meters, smart lighting, and smart air conditioning are becoming increasingly common in commercial and residential markets. <\/span><a href=\"https:\/\/www.gartner.com\/en\/newsroom\/press-releases\/2019-08-29-gartner-says-5-8-billion-enterprise-and-automotive-io\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">According to Gartner<\/span><\/a><span style=\"font-weight: 400;\">, the utilities industry, who is the leader in endpoint usage, was operating 1.17 billion endpoints in 2019, and the firm projects the number will grow by 14.6 percent in 2020, reaching 1.37 billion. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Still, the governmental sector will see a more dramatic spike: from 0.53 billion to 0.70 billion (24.3 percent). The quantity of endpoints will also grow substantially in the building automation and physical security industries. <\/span><\/p>\n<h3><strong>Other Internet of Things Trends: Edge Computing, Digital Twins<\/strong><\/h3>\n<p><span style=\"font-weight: 400;\">What else can be expected in the IoT area in 2020? <\/span><a href=\"https:\/\/www.techcentral.ie\/iot-in-2020-awkward-times-ahead\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">According to IDC<\/span><\/a><span style=\"font-weight: 400;\">, enterprises will begin transitioning from cloud-based IoT deployments to edge computing to further streamline IoT deployments and application performance in their ecosystems. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As for big trends in IoT, the Port of Rotterdam, the largest in Europe, has started a massive project of digitizing its every operation, which will continue in 2020. Some parts of the harbor are already automated, but the ports leadership and partners plan to use the digital twin technology and IoT for a complete digital transformation. The end goal is to entirely rid the port of time loss, cargo loss, spills of CO2, and safety incidents. The harbor also wants to berth crewless automated ships somewhere around 2030. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Learn more about the port’s plans and progress in detail in the video:<\/span><\/p>\n<p><iframe title=\"Port of Rotterdam: Europe&#039;s Strongest Digital Twin Case Study | IoT World Europe 2018 webinar\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/1_ihbnUuAAE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/p>\n<h2><strong>Open &amp; Decentralized Finance<\/strong><\/h2>\n<p><span style=\"font-weight: 400;\">In all likelihood, 2020 will be a watermark year for banks and financial institutions, as they face the inevitability of a large-scale transformation. The concept of open finance — an ecosystem of shared services that converges users and companies in one place to enable better efficiency and experiences — will be the overarching trend. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This means that financial organizations will have shared transaction data, IT infrastructure, and cross-compatible systems, while the ecosystem itself will be enabled by distributed technologies and more sophisticated and accessible APIs. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Distributed technology will play a key role in the evolution of the entire industry, giving way to decentralized financial services: lending, borrowing, and other financial operations will be provided on decentralized distributed platforms. Banks will use distributed ledgers to issue bonds (<\/span><a href=\"https:\/\/media.consensys.net\/5-sibos-takeaways-the-future-of-finance-according-to-banks-and-institutions-a45fd53298fe\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">like Societe Generale and Santander did<\/span><\/a><span style=\"font-weight: 400;\">), as digital markets with tokenized financial instruments will emerge. Payments, meanwhile, will be transferred to permission-based distributed networks to enable high security and speed.  <\/span><\/p>\n<h3><strong>Face Recognition in Financial Services<\/strong><\/h3>\n<p><span style=\"font-weight: 400;\">As facial recognition is available in more and more smartphones and can help financial organizations cut costs and simplify operations and customer experiences, we can expect more financial services that use face recognition at different customer touchpoints. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Users will be able to verify different actions related to their accounts in seconds by letting smartphones scan their faces. Still, this will require a high level of security from both the financial institutions, smartphone designers, and software teams behind mobile operating systems.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The concept of a federated identity — using your face to manage all of your financial operations — is also on the table, but it will take time to evolve. Mexico has <\/span><a href=\"https:\/\/observer.com\/2019\/11\/trueface-artificial-intelligence-facial-recognition-future-banking\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span style=\"font-weight: 400;\">already adopted<\/span><\/a><span style=\"font-weight: 400;\"> a biometric security mandate to bring this idea to life, so we can probably expect other countries to follow suit in 2020.<\/span><\/p>\n<h2><strong>Summing Up Technology Trends for 2020<\/strong><\/h2>\n<p><span style=\"font-weight: 400;\">Although major breakthroughs are not in the cards, 2020 will be yet another eventful year for the tech industry and the world. AI will play the most important role at the both sides of the fake news war in 2020, prompting governments to come up with never-before-seen laws. AR adoption has slowed down significantly, and this may continue until Apple releases its first AR device. IoT adoption continues, as companies across industries tap into new types of data, use more endpoints, and find ways to streamline deployments; massive IoT projects like digitization of the Port of Rotterdam are also underway. With no time left to postpone transformation, financial organizations embrace modern times with big plans for setting up shared systems to deliver next-gen user experiences. Finally, face recognition is slowly coming to financial operations. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It’s still going to be exciting. <a href=\"https:\/\/www.linkedin.com\/company\/intellectsoft\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Stay tuned<\/a>.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>See what to expect next year.<\/p>\n","protected":false},"author":61,"featured_media":18967,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[798,641,2,6,797,13,799],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"From AI in fake news to slowing adoption of AR, learn the 5 most important technology trends of 2020.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/tech-trends-2020\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"5 Key Tech Trends of 2020 Every CIO Should Know\" \/>\n<meta property=\"og:description\" content=\"From AI in fake news to slowing adoption of AR, learn the 5 most important technology trends of 2020.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/tech-trends-2020\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2019-11-28T23:34:18+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-03-02T09:41:29+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/top-five-tech-trends-copy-1200x600-1-e1583142080167.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"500\" \/>\n\t<meta property=\"og:image:height\" content=\"250\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/tech-trends-2020\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/top-five-tech-trends-copy-1200x600-1-e1583142080167.jpg\",\"width\":500,\"height\":250},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/tech-trends-2020\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/tech-trends-2020\/\",\"name\":\"5 Key Tech Trends of 2020 Every CIO Should Know\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/tech-trends-2020\/#primaryimage\"},\"datePublished\":\"2019-11-28T23:34:18+00:00\",\"dateModified\":\"2020-03-02T09:41:29+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/d8dce743156f4ef27e9a737909c8608f\"},\"description\":\"From AI in fake news to slowing adoption of AR, learn the 5 most important technology trends of 2020.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/tech-trends-2020\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/d8dce743156f4ef27e9a737909c8608f\",\"name\":\"Timothy Kozak\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/2bafc29023478c3634aff3a0c884ba6e?s=96&d=mm&r=g\",\"caption\":\"Timothy Kozak\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/17615"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=17615"}],"version-history":[{"count":0,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/17615\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/18967"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=17615"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=17615"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=17615"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}