{"id":18060,"date":"2020-01-21T16:27:01","date_gmt":"2020-01-21T13:27:01","guid":{"rendered":"https:\/\/www.intellectsoft.net\/blog\/?p=18060"},"modified":"2020-09-14T19:37:59","modified_gmt":"2020-09-14T16:37:59","slug":"how-ai-is-transforming-the-modern-healthcare-system","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/how-ai-is-transforming-the-modern-healthcare-system\/","title":{"rendered":"How AI Is Transforming The Modern Healthcare System"},"content":{"rendered":"<p>Artificial intelligence (AI) in the medical sphere makes use of algorithms and software to approximate human knowledge when analyzing complex information connected to <a href=\"https:\/\/www.intellectsoft.net\/platforms\/healthcare-it-solutions\" target=\"_blank\" rel=\"noopener noreferrer\">healthcare software solutions<\/a>. AI-based programs are aimed at analyzing how medical prevention or treatment methods are related to the final result.<\/p>\n<p>The medical sphere is the main field of investment in AI. Smart medical products, services, and processes are already being developed by companies such as IBM, Google, Apple, and many others.<\/p>\n<h2>What AI Is and Why It Is Important in Health Care<\/h2>\n<p>Broadly speaking, AI allows computers to learn from their experiences, adapt to set parameters, and perform tasks that used to be performed only by human beings. In most cases of AI implementation, from playing chess to driverless cars, developers must apply deep learning and natural language processing. These technologies make it possible to teach computers to perform certain tasks by processing enormous amounts of data and identifying patterns.<\/p>\n<p>The medical sphere can already be considered one of the most promising in terms of AI usage. AI applications can massively improve the accuracy of diagnoses, simplify the lives of people who have various illnesses, and accelerate the production and release of novel drugs.<\/p>\n<p>Today, doctors use numerous devices to facilitate diagnosis, monitor patients’ conditions, and perform surgical operations. However, it has recently become clear that AI is capable of many other things. For example, social media can help determine the dangers that threaten a person’s health.<\/p>\n<p>The greatest achievement of AI in health care is connected to the collection and storage of data. For instance, electronic medical records (EMRs) store all data about a patient’s illness, the services provided, and other medical documents. However, the EMR market is controlled by a very small group of companies, and the programs themselves can’t be called flawless. The people who use them are irritated by pop-ups.<\/p>\n<p>Also, robots that assist in performing operations are not science fiction anymore. In 2000, Intuitive Surgical released the<a href=\"https:\/\/www.davincisurgery.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"> Da Vinci surgical system<\/a>, which was able to perform coronary bypass surgery. After a large investment, it was also taught how to remove prostate cancer.<\/p>\n<figure id=\"attachment_18071\" aria-describedby=\"caption-attachment-18071\" style=\"width: 700px\" class=\"wp-caption alignnone\"><img loading=\"lazy\" class=\"wp-image-18071\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Da-Vinci-surgical-system-300x150.jpg\" alt=\"Da Vinci surgical system\" width=\"700\" height=\"350\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Da-Vinci-surgical-system-300x150.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Da-Vinci-surgical-system-1024x512.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Da-Vinci-surgical-system-768x384.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Da-Vinci-surgical-system-1536x768.jpg 1536w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Da-Vinci-surgical-system-600x300.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Da-Vinci-surgical-system-450x225.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Da-Vinci-surgical-system-1000x500.jpg 1000w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Da-Vinci-surgical-system.jpg 2048w\" sizes=\"(max-width: 700px) 100vw, 700px\" \/><figcaption id=\"caption-attachment-18071\" class=\"wp-caption-text\">Da Vinci Surgical System<\/figcaption><\/figure>\n<p>Although AI is becoming more and more proficient, doctors still spend a lot of time communicating with patients and conducting diagnostics, but it is believed that in the future, they will only control this process, reducing the workload of therapists. Many of them already use special applications and other tools.<\/p>\n<p>Let’s take a closer look at some examples of AI in health care.<\/p>\n<h2>How AI Is Implemented In Health Care: Examples Of Devices and Other Novel Technology<\/h2>\n<h3>1. Thoroughly Process Patient Data<\/h3>\n<p>For competent treatment and accurate diagnoses, doctors must study patient data: pictures, test results, examination protocols, and anamnesis containing complete information. Sometimes, even experienced doctors are not able to see the full picture because the data is not systematized.<\/p>\n<p>According to Google Labs, one in ten patients suffers because of an incorrect diagnosis. It is believed that AI can solve this problem. Google’s specialists are already working in some hospitals, where the<a href=\"https:\/\/health.google\/\" target=\"_blank\" rel=\"noopener noreferrer\"> Google Deepmind Health<\/a> program analyzes the available information about patients’ symptoms and provides a list of recommendations. The doctor, using the tips from the system, prescribes a course of treatment. The<a href=\"https:\/\/www.ibm.com\/watson-health\" target=\"_blank\" rel=\"noopener noreferrer\"> IBM Watson Health<\/a> program also allows users to make diagnoses; it can recognize cardiomyopathy, thrombosis, heart attacks.<\/p>\n<p>Thanks to AI, it’s possible to assess the impact of drugs on the human body, helping doctors understand how the unique features of the patient’s genetic structure affect the course of the disease and what effect a new drug can have. With the help of the<a href=\"https:\/\/www.ibm.com\/cloud\/healthcare\" target=\"_blank\" rel=\"noopener noreferrer\"> IBM Watson Health Cloud app<\/a>, the doctor receives and analyzes data about the patient’s body from an electronic bracelet and can then select an effective course of treatment.<\/p>\n<h3>2. Diagnostics<\/h3>\n<p>Nowadays, AI can recognize the symptoms of malignant neoplasms to diagnose visual disorders, tuberculosis, and brain disorders. An example is the<a href=\"https:\/\/ada.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"> Ada<\/a> service. This mobile app generates questions, and then the user describes their symptoms, after which Ada searches for information about the problem and gives recommendations. Similar services can indicate diseases, including diabetes. For instance, a special application called<a href=\"https:\/\/www.sensely.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"> Sense.ly<\/a> has been developed for the people who have recently been to the hospital. It analyzes the user’s health status in real-time and then sends this data to the therapist.<\/p>\n<p>Novel technology such as genetic analysis is gaining popularity as DNA analysis makes it possible to identify a person’s predisposition to certain diseases, such as diabetes, stomach ulcers, and more. Furthermore, one project,<a href=\"https:\/\/www.northshore.org\/pharmacogenomics\/\" target=\"_blank\" rel=\"noopener noreferrer\"> MedClueRx<\/a>, allows users to determine which medications can help with depression, epilepsy, and diseases of the nervous system.<\/p>\n<p>We can’t help but mention a service that can replace a personal doctor.<a href=\"https:\/\/medwhat.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"> MedWhat AI<\/a> is a mobile phone app with a built-in speech recognition function. The app takes an interest in the user’s health and answers various questions, such as how to get rid of a headache.<\/p>\n<p>In the near future, MedWhat will grant access to patients’ medical history and genetic information.<\/p>\n<h3>3. Processing Huge Amounts Of Information<\/h3>\n<p>It’s a well-known fact that AI can process several thousand pages per second when searching for the necessary information. Every twenty minutes or so, a new medical article appears in the world. Therefore, an AI-based decision support system, CDSS, was created to help medical workers. It combines information and data on patients’ health indicators and their medical history.<\/p>\n<h3>4. The Creation Of Drugs<\/h3>\n<p>Drugs are complex organic compounds, and finding the right structure takes a long time. Before getting to the market, a drug goes through many checks and tests, but that does not guarantee that the drug will be effective. More than 50% of new cancer drugs do not have a noticeable effect on the patient.<\/p>\n<p>AI is designed to more accurately model the composition of drugs. In the future, researchers will be able to set the necessary functions, and AI will form the chemical structure of the drug. Even today, a service called<a href=\"https:\/\/www.atomwise.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"> Atomwise<\/a> uses AI to find the optimal drug formula.<\/p>\n<h2>Powerful Advantages Of AI In The Healthcare Industry<\/h2>\n<p>Scientists hope that with the help of AI, it will soon be possible to develop ultra-precise (or precision) medicine and assign individualized treatment to each patient, taking into account unique genetic and other features. The US has already announced the launch of the first projects for the development of precision medicine.<\/p>\n<p>Medical and technological advances over the last 50 years have allowed us to bring health care to a new level.<\/p>\n<p><strong>New AI applications and systems have a number of undeniable advantages:<\/strong><\/p>\n<ul>\n<li>Increased computing power, leading to faster data collection and processing<\/li>\n<li>Increased volume and availability of health-related data obtained from doctors’ and patients’ personal and medical devices<\/li>\n<li>Increased genomic sequencing databases<\/li>\n<li>Introduction of electronic medical records.<\/li>\n<\/ul>\n<h2>Why AI Implementation In Health Care May Turn Out Complicated<\/h2>\n<p>Unfortunately, there are several obstacles to the introduction of AI technologies in medicine. Questions often arise from medical professionals themselves, who have a reasonable distrust of some innovations.<\/p>\n<p>What is the cause of the problems? Let’s try to understand.<\/p>\n<p>The main barrier to the future of AI in medicine is ensuring data privacy and security. With AI, there is a risk of revealing confidential data from patients’ medical history. Moreover, there is the risk of deliberate hacking to harm a huge number of people by, for example, causing insulin overdoses in people with diabetes.<\/p>\n<p>The second problem is the inaccurate operation of the algorithms. A recent example is the IBM Watson Health algorithm (known as Watson for Oncology). The algorithm is used by hundreds of hospitals around the world to recommend treatment for cancer patients, but it was based on a small number of synthetic cases and a very limited amount of real data. Many of its treatment recommendations were wrong. For example, it suggested the use of an incompatible medication for a patient with severe bleeding, which is a clear contraindication.<\/p>\n<p>Another problem is bias. Low socioeconomic status is the main risk factor for premature mortality. The disproportionate use of AI for the rich while the poor can’t afford it can increase the existing health gap. The resulting bias due to the lack of inclusion of minorities in data sets is closely related to this problem. For instance, some algorithms in dermatology diagnose melanoma, but they do not take into account skin color. It is necessary to eliminate prejudice and seek medical research that provides a real representation of the population.<\/p>\n<h2>How AI Will Transform Health Care In The Future<\/h2>\n<p>Medical futurist Bertalan Mesko once said that AI is the stethoscope of the 21st century. He noted that a simple instrument like a stethoscope was something the medical community did not want to recognize at first. It took several decades for doctors to start using it. The same thing is happening now with AI—one tries to make the most of it while another is afraid of it.<\/p>\n<p>AI technologies, machine learning, and neural networks simplify the lives of doctors greatly. Innovations in medicine make it possible to diagnose diseases more accurately, find medicines faster, and track the condition of patients. An impressive number of novel technologies are being developed now, and more are yet to come! Let’s look at some of them:<\/p>\n<ul>\n<li><strong>Google<\/strong> is working on creating an algorithm that will analyze EMR data and find important patterns. The technology will help doctors predict the development of the patients’ conditions and will tell how long patients should stay in the hospital, as well as calculate the probability of death.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-18072\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-AI-Heathcare-300x145.jpg\" alt=\"Microsoft AI Heathcare\" width=\"700\" height=\"339\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-AI-Heathcare-300x145.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-AI-Heathcare-1024x496.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-AI-Heathcare-768x372.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-AI-Heathcare-1536x744.jpg 1536w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-AI-Heathcare-2048x992.jpg 2048w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-AI-Heathcare-600x291.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-AI-Heathcare-450x218.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Microsoft-AI-Heathcare-1000x484.jpg 1000w\" sizes=\"(max-width: 700px) 100vw, 700px\" \/><\/p>\n<ul>\n<li><strong>Microsoft<\/strong> is using AI to develop cancer drugs and treatments. The project includes a mathematical analysis of cell development. The main idea is to apply to malignant cells the same method of struggle as to failures in computer programs. [MG1] The company also created a public service called Microsoft Healthcare Bot, which offers to use medical institutions in the development of virtual assistants and chatbots to solve various medical problems.<\/li>\n<li><strong>IBM<\/strong> is developing AI-based systems in the field of cancer treatment and has already spent more than $4 billion to buy several companies with huge reserves of medical data. The Watson Group, whose technology IBM<a href=\"https:\/\/www.nytimes.com\/2016\/10\/17\/technology\/ibm-is-counting-on-its-bet-on-watson-and-paying-big-money-for-it.html?_r=2\" target=\"_blank\" rel=\"noopener noreferrer\"> plans<\/a> to adapt for health care, was created in early 2014 and now employs about 10,000 people. The main task of Watson is to understand questions formulated in natural language and find answers to them with the help of AI.<\/li>\n<li><strong>Medtronic and IBM<\/strong> are jointly developing an application to monitor the treatment of people with diabetes.<a href=\"https:\/\/www.medtronicdiabetes.com\/products\/sugar.iq-diabetes-assistant\" target=\"_blank\" rel=\"noopener noreferrer\"> Software Sugar.IQ<\/a> is a smart assistant for diabetes that will be able to predict critical decreases in blood sugar three hours before the patient shows symptoms. Data from 600 anonymous patients was used to create the technology. People can track their condition using a mobile app and special medical devices.<\/li>\n<li><strong>Intel<\/strong> is developing AI-based programs that can identify patients at risk for dangerous diseases and offer treatment options.<\/li>\n<\/ul>\n<p>This list is only a small part of the opportunities that AI has brought to the healthcare sector.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Artificial intelligence (AI) in the medical sphere makes use of algorithms and software to approximate human knowledge when analyzing complex information connected to healthcare software&#8230;<\/p>\n","protected":false},"author":16,"featured_media":18061,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[798],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"How AI is transforming a modern healthcare system and what to expect in the nearest future? Read more about challenges, benefits, and risks of 2020.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/how-ai-is-transforming-the-modern-healthcare-system\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"AI in the Healthcare Industry: 2020 Overview | Intellectsoft\" \/>\n<meta property=\"og:description\" content=\"How AI is transforming a modern healthcare system and what to expect in the nearest future? Read more about challenges, benefits, and risks of 2020.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/how-ai-is-transforming-the-modern-healthcare-system\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2020-01-21T13:27:01+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-09-14T16:37:59+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/How-AI-Is-Transforming-the-Healthcare-System-scaled-e1582893821102.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1000\" \/>\n\t<meta property=\"og:image:height\" content=\"543\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/how-ai-is-transforming-the-modern-healthcare-system\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/How-AI-Is-Transforming-the-Healthcare-System-scaled-e1582893821102.jpg\",\"width\":1000,\"height\":543,\"caption\":\"How AI Is Transforming the Healthcare System\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/how-ai-is-transforming-the-modern-healthcare-system\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/how-ai-is-transforming-the-modern-healthcare-system\/\",\"name\":\"AI in the Healthcare Industry: 2020 Overview | Intellectsoft\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/how-ai-is-transforming-the-modern-healthcare-system\/#primaryimage\"},\"datePublished\":\"2020-01-21T13:27:01+00:00\",\"dateModified\":\"2020-09-14T16:37:59+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/8dabf160b0ebfebdf2201bf77a7fafcb\"},\"description\":\"How AI is transforming a modern healthcare system and what to expect in the nearest future? Read more about challenges, benefits, and risks of 2020.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/how-ai-is-transforming-the-modern-healthcare-system\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/8dabf160b0ebfebdf2201bf77a7fafcb\",\"name\":\"kate.bayrachnaya\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/00d3950e4cd29b4b9505318feca38c42?s=96&d=mm&r=g\",\"caption\":\"kate.bayrachnaya\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/18060"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/16"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=18060"}],"version-history":[{"count":1,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/18060\/revisions"}],"predecessor-version":[{"id":21782,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/18060\/revisions\/21782"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/18061"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=18060"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=18060"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=18060"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}