{"id":18780,"date":"2020-02-27T17:37:00","date_gmt":"2020-02-27T14:37:00","guid":{"rendered":"https:\/\/www.intellectsoft.net\/blog\/?p=18780"},"modified":"2020-07-24T20:36:30","modified_gmt":"2020-07-24T17:36:30","slug":"serverless-architecture-from-buzzword-to-breakthrough-paradigm","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/serverless-architecture-from-buzzword-to-breakthrough-paradigm\/","title":{"rendered":"Serverless Architecture: From Buzzword to Breakthrough Paradigm"},"content":{"rendered":"<p>Serverless architecture is a step beyond in the technological revolution. Since 2015 (or some say 2012), it has changed the nature of computing. And there is no way back. The real question is, should you consider switching to serverless too?<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-18783\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-3531902.jpeg\" alt=\"serverless architecture picture of server\" width=\"2250\" height=\"1500\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-3531902.jpeg 2250w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-3531902-300x200.jpeg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-3531902-1024x683.jpeg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-3531902-768x512.jpeg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-3531902-1536x1024.jpeg 1536w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-3531902-2048x1365.jpeg 2048w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-3531902-600x400.jpeg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-3531902-450x300.jpeg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-3531902-1000x667.jpeg 1000w\" sizes=\"(max-width: 2250px) 100vw, 2250px\" \/><\/p>\n<p><b>Summary:<\/b><\/p>\n<ol>\n<li style=\"font-weight: 400;\">What is serverless architecture, and how does it work? Scale-to-zero, FaaS, event-driven approach and managed services explained.<\/li>\n<li style=\"font-weight: 400;\">Why is serverless the future of development? Some of the most significant advantages it has.<\/li>\n<li style=\"font-weight: 400;\">What to keep in mind if you&#8217;re considering serverless? Risks, cons, and how to get prepared for a new solution.<\/li>\n<li style=\"font-weight: 400;\">Should your business use serverless architecture today? Statistics and forecast for 2025.<\/li>\n<\/ol>\n<h2>What is serverless?<\/h2>\n<p>As it is with any new innovation, there is no versatile definition that works for everybody. In the case of serverless, it’s even more real because the concept has developed in a relatively short time. And still, lots of people confuse it with other concepts. Here’s the broad, yet the simple definition of “serverless” we think fits it the best:<\/p>\n<blockquote><p>Serverless is a paradigm of executing applications in cloud-native environments that influences the way applications are built and deployed and makes use of cloud-computing advantages.<\/p><\/blockquote>\n<p>Simon Wardley, a “serverless” advocate, <a href=\"https:\/\/twitter.com\/swardley\/status\/1073379461473730560\" target=\"_blank\" rel=\"noopener noreferrer\">defines<\/a> it as:<\/p>\n<blockquote><p>“[Serverless is] an event-driven, utility-based, stateless, code execution environment in which you write code and consume services.”<\/p><\/blockquote>\n<h2>A couple of words on What Serverless is NOT:<\/h2>\n<ul>\n<li style=\"font-weight: 400;\"><b>It’s not a container. <\/b>“A container image is a lightweight, stand-alone, executable package of a piece of software that includes everything needed to run it: code, runtime, system tools, system libraries, settings. Available for both Linux and Windows based apps, containerized software will always run the same, regardless of the environment. Containers isolate software from its surroundings, for example, differences between development and staging environments and help reduce conflicts between teams running different software on the same infrastructure,” — shares <a href=\"https:\/\/www.docker.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Docker.com;<\/a><\/li>\n<li style=\"font-weight: 400;\"><b>It’s not a PaaS.<\/b> Unlike serverless, PaaS refers to a system where there is more (compared to serverless) control over deployment environment; applications take a while to spin up; applications need to be configured to scale automatically.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-18782\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-1181676.jpeg\" alt=\"girl works with panoramic view\" width=\"2247\" height=\"1500\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-1181676.jpeg 2247w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-1181676-300x200.jpeg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-1181676-1024x684.jpeg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-1181676-768x513.jpeg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-1181676-1536x1025.jpeg 1536w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-1181676-2048x1367.jpeg 2048w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-1181676-600x401.jpeg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-1181676-450x300.jpeg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-1181676-1000x668.jpeg 1000w\" sizes=\"(max-width: 2247px) 100vw, 2247px\" \/><\/p>\n<p>In many sources, you can also find that serverless architecture also means <b>“managed services that scale to zero.”<\/b> That’s why the scale-to-zero approach or pay for the consumption of computing resources (instead of allocation) is a key concept of the serverless. Let’s dive in.<\/p>\n<h2>Scaling to zero as the main concept<\/h2>\n<p>&#8220;Scale to zero&#8221; stops consuming resources when there are no requests. Therefore, computation resources become consumed when in use. Serverless cloud providers automatically scale out the application to handle the increased load.<\/p>\n<p>It reduces the overall costs because <b>customers are only billed for the time that the application is running.<\/b> It’s also known as pay-per-use (pay for consumption and not for allocation). That’s why scale-to-zero is appropriately seen as the main concept of serverless computing.<\/p>\n<h2>Functions as code<\/h2>\n<p>Serverless is frequently used in conjunction with a <b>function-as-a-service (FaaS)<\/b> offering. In this case, the code is written as a function. In turn, the function acts as a small single-purpose piece of code that runs dynamically in response to some event trigger or on schedule.<\/p>\n<p>Besides the fact that FaaS allows developers to run backend code without managing their server systems, here are some more essential aspects of it:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">When it comes to language and environment, FaaS functions are regular applications, but have a range of architectural restrictions;<\/li>\n<li style=\"font-weight: 400;\">Using FaaS with serverless computing requires a different approach to deployment as compared to when you manage your servers. Developers upload code in a FaaS environment to the FaaS vendor who then takes over everything related to deployment. Developers don’t have to do anything;<\/li>\n<li style=\"font-weight: 400;\">A FaaS vendor covers all the scaling needs. Developers write a function to assume horizontal-scaled parallelism, and the FaaS vendor covers everything scaling-related from that point. Horizontal scaling is fully automated and elastic;<\/li>\n<li style=\"font-weight: 400;\">The FaaS provider fully manages resource provisioning and allocation.<\/li>\n<\/ul>\n<p>To get started with FaaS, developers simply bring their function code and wire up event triggers. This is where an event-driven architecture steps in.<\/p>\n<h2>Events as triggers<\/h2>\n<p>The <b>event-driven architecture (or simply EDA)<\/b> is a software architecture paradigm where code runs in response to events. An event means any change of state in the system, for example, a new message in a queue, the changed record in a DB, a file upload, etc.<\/p>\n<p>Simply put, EDA promotes production, consumption, and reaction to any events. In turn, events trigger business functions or code. For example, when a consumer books a hotel room, the room&#8217;s state changes from &#8220;free&#8221; to &#8220;booked&#8221;. A hotel booking system architecture may treat this state change as an event whose occurrence can be made known to other applications within the architecture.<\/p>\n<h2>Services are all managed<\/h2>\n<p>In a serverless architecture, developers don’t worry about supporting any related services. Such services can include databases, storage, message queues, stream processing, caches, etc.<\/p>\n<p>In turn, developers can connect <b>managed services<\/b> together, so they shouldn’t think about provisioning, maintaining, and administering these servers and systems. Also, there is no need to ensure application fault tolerance and availability. Cloud providers handle these aspects for them.<\/p>\n<h2>What are the benefits of serverless?<\/h2>\n<p>Before considering the serverless approach for your business, let’s take a closer look at the advantages it has.<\/p>\n<h3><b>1 — Lower Operational Costs<\/b><\/h3>\n<p>With a Serverless architecture, you pay the vendor only for resources your application consumed, meaning you do not need to allocate costs for managing your own servers, databases, and application logic.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-18784\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-1.jpg\" alt=\"girls work hard to get tasks done\" width=\"2250\" height=\"1500\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-1.jpg 2250w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-1-300x200.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-1-1024x683.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-1-768x512.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-1-1536x1024.jpg 1536w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-1-2048x1365.jpg 2048w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-1-600x400.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-1-450x300.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-1-1000x667.jpg 1000w\" sizes=\"(max-width: 2250px) 100vw, 2250px\" \/><\/p>\n<p>While you get the same cost reduction benefits from PaaS (platform as a service) and IaaS (infrastructure as a service), the two do not allow you to pay only for the resources you consume, making Serverless a cheaper option.<\/p>\n<h3>Automated &amp; More Cost-Efficient Scaling<\/h3>\n<p>Serverless comes with automatic and elastic horizontal scaling that is fully managed by the vendor. In many cases, this allows you to cut budget costs in a big way.<\/p>\n<h3>More Optimization — Fewer Expenses<\/h3>\n<p>With a Serverless architecture, there is a direct link between code optimization and operational costs. The more you optimize your application’s code, the less you pay.<\/p>\n<p>Say, your app needs a second to process an event; if you reduce the time to 500 ms, you may instantly save 50% percent from what you paid for minute-long processing. The amount you save may change from vendor to vendor, but the overall picture remains the same — you can save a lot).<\/p>\n<h3><b>2 — Simplified Operational Management<\/b><\/h3>\n<p>Before starting with this section, it is essential to go back to the fact that Serverless has not matured yet, and different operational nuances will arise as you start using it. Still, that does not dismiss the significant benefits of Serverless architecture in operational management. Let’s see what they are.<\/p>\n<h3>Next-to-no System Administration<\/h3>\n<p>In short, an utterly serverless solution needs zero system administration. The process of packaging and deploying a FaaS function is simple compared to deploying a server — you only need to package your code into a zip file and upload it to the vendor. That’s it. More so, if you are only starting with your application, you can skip the packaging stage and write the code right to the provider’s console.<\/p>\n<h3>More Agility<\/h3>\n<p>The nature of Serverless allows your team to decrease time to market in a reasonable fashion. Plus, with a faster deployment time, teams can experiment with new features and see if the work quickly at a very low cost and with little friction. This, in turn, lowers the lead time and may result in a better final product.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-18785\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-2.jpg\" alt=\"man looking on his roadmap\" width=\"2250\" height=\"1500\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-2.jpg 2250w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-2-300x200.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-2-1024x683.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-2-768x512.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-2-1536x1024.jpg 1536w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-2-2048x1365.jpg 2048w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-2-600x400.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-2-450x300.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/startup-photos-2-1000x667.jpg 1000w\" sizes=\"(max-width: 2250px) 100vw, 2250px\" \/><\/p>\n<h3><b>3 — <\/b><b>Faster time to market<\/b><\/h3>\n<p>Speed is a new big. Every one aims to get their applications to market as soon as possible. With serverless, it’s quicker and easier: no need to worry about wiring up custom components, the code is shipped many times faster, and there’s less to build from scratch. As a result, developers run deployments with less fuss.<\/p>\n<h3><b>4 — Less Impact on Environment<\/b><\/h3>\n<p>The world has seen a big spike in the number of data centers in the last ten years, which increased the amount of burnt fossil fuel significantly. Tech giants are considering building centers near renewable energy sources. Still, this will not be enough to reduce the impact due to another issue: highly inefficient capacity management.<\/p>\n<p>According to Forbes, standard servers in organizations deliver <a href=\"https:\/\/www.forbes.com\/sites\/benkepes\/2015\/06\/03\/30-of-servers-are-sitting-comatose-according-to-research\/#491cd25d59c7\" target=\"_blank\" rel=\"noopener noreferrer\">no more than 5 to 15 percent<\/a> of their maximum computing output on average in a year. Serverless computing, on the other hand, frees companies from the challenging task of provisioning computing, capacity all the while allowing serverless vendors to allow just the right amount of resources for their clients, and only when they need them. So, serverless may be the one and the only solution to optimize data center resources worldwide, lowering their environmental impact dramatically.<\/p>\n<h2>What to keep in mind if you&#8217;re considering serverless?<\/h2>\n<p>Serverless has not matured yet, and this way of building and deploying applications has its advantages just as it has some drawbacks. There is an array of issues you need to know about before switching to this paradigm. We will take a closer look at the inherent flaws of the concept, the ones that will never be fixed entirely.<\/p>\n<h3><b>Lack of Control<\/b><\/h3>\n<p>Using Serverless means your vendor is in control of the parts of your system. This may lead to a wide variety of issues, including <b>functionality loss, forced API upgrades, system downtime<\/b>, and other issues that may affect your application and its users.<\/p>\n<h3><b>Security <\/b><\/h3>\n<p>Every newly emerged concept always has a list of security issues, and that’s also the case with serverless. From insecure serverless deployment configuration to inadequate monitoring and logging of functions and insecure third-party dependencies, these are some of the security issues to pay attention to before jumping in a serverless world.<\/p>\n<h3><b>BaaS-Only Serverless Architecture Issues<\/b><\/h3>\n<p>Serverless may decrease your operational resources, but not entirely. In the case of a 100% BaaS-based architecture,<b> all the logic will be in the client.<\/b> Backend-as-a-Service (or BaaS) is a cloud service model in which developers outsource all the behind-the-scenes aspects of a web or mobile application so that they only have to write and maintain the frontend.<\/p>\n<p>So, for your next platforms, you will need to repeat the implementation of a subset of that logic. If you need to migrate to a new database, this will require code replication or coordination change for all of your clients. Another issue with a full BaaS architecture is that you cannot optimize your server design for client performance in no way.<\/p>\n<p>On the bright side, if your serverless architecture uses only FaaS, these issues are non-existent.<\/p>\n<h3><b>Technology Limitations<\/b><\/h3>\n<p>Not all technologies can be used due to the scale-to-zero concept. The so-called slow <b>“cold start”<\/b> (first execution after scaling to zero) can lead to performance issues. Some applications require more time to start and then work fast. And for serverless fast startup time is always crucial.<\/p>\n<h3><b>Doesn’t Suite Some Tasks<\/b><\/h3>\n<p>There are some tasks where serverless is <b>worse fit than traditional models.<\/b> For such tasks, the usage of serverless may lead to increasing costs.<\/p>\n<h3><b>FaaS-Only Serverless Architecture Issues<\/b><\/h3>\n<p>FaaS functions have major <b>local state restrictions<\/b>, meaning you should not take it as given that the state from one invocation of a FaaS function will be available to another invocation of the same function.<\/p>\n<p>If you cannot store states in memory, using a fast NoSQL database may do the trick alongside a number of other options, but all of them are significantly slower than in-memory or on-machine persistence, and the latter will not fit each and every project.<\/p>\n<h2>The Future is Serverless<\/h2>\n<p>It’s hard to predict where serverless computing will be a year from now. Looking back at the current state of serverless, its evolution over the last several years, how vendors address existing issues, as well as the growing community, we can expect the following developments in years to come.<\/p>\n<p><b>Better Tooling<\/b>. There’s no road ahead for serverless if the existing tooling stops evolving. Luckily, Amazon and other vendors have been improving things like deployment\/application bundling and configuration, and we can expect vendors in general to make improvements in other important areas, such as remote debugging and distributed monitoring.<\/p>\n<p><b>Serverless FaaS Will Fit More Applications<\/b>. Serverless FaaS doesn’t have a consistent in-server state, so such an architecture will not be able to support high-throughput applications.<\/p>\n<p>While vendors will surely try to make function instances active between events for a longer time, the hybrid approach — an architecture combining serverless and non-serverless execution models — is likely to be the better option for such applications.<\/p>\n<p><b>Fewer implementation Issues. <\/b>From deployment to packaging to integration testing to the opaqueness of monitoring support, there is a very long list of issues when it comes to implementing serverless applications as of today. As vendors are gradually fixing implementation-related issues, we can expect them to deal with all the problems existing in this area today as well.<\/p>\n<p><b>Emergence of First Solid Serverless Practices<\/b>. Although a lot is clear about nature serverless computing and how it can benefit teams and applications they design, it is still a very, very young field will little-to-no guidelines for the long-term as well as many blank spaces across the board.<\/p>\n<p>So, in the next several years, we can expect the serverless rule book to start shaping up. It will outline where serverless fits best and where traditional ways are more favorable, the best ways to implement serverless, how to build a hybrid serverless architecture, and so on. The answers will come from both sides — the vendors, and the community.<\/p>\n<p>That doesn’t end here, but vendors will surely try to tackle these first. Will serverless become the new normal for application architectures? It has the potential, but, as with many things, only time will tell.<\/p>\n<h2>Should your business switch to serverless now?<\/h2>\n<p>In 2017 the serverless market was worth around $3 billion. By 2025, it’s predicted to go up to $20 billion. Many giants are already adopting serverless. To name a few, Netflix, Coca Cola, Airbnb, EA, Vevo, MongoDB, Accenture, etc.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-18787\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/analytics.jpg\" alt=\"graph for serverless stats in the usa\" width=\"1170\" height=\"740\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/analytics.jpg 1170w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/analytics-300x190.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/analytics-1024x648.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/analytics-768x486.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/analytics-600x379.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/analytics-450x285.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/analytics-1000x632.jpg 1000w\" sizes=\"(max-width: 1170px) 100vw, 1170px\" \/>If you consider switching to serverless, we suggest keeping in mind two things:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">You should not migrate all your apps to serverless right away. Try and test first;<\/li>\n<li style=\"font-weight: 400;\">Serverless is the right direction for the future for two main reasons: it gives the opportunity to deliver value to customers quickly and lets you pay only for the used resources.<\/li>\n<\/ul>\n<p>Indeed, there are still numerous pitfalls and execution bottlenecks utilizing serverless. Moreover, security is one of the top issues that should be resolved over time. Yet one thing the entire market knows is that serverless is inevitable, and it will own the market. It’s all just a matter of time.<\/p>\n<p><b>If you are ready to elevate your business with the serverless paradigm or need an extensive consultation on the matter, <\/b><a href=\"https:\/\/www.intellectsoft.net\/contacts\"><b>get in touch with our experts. <\/b><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Serverless architecture is a step beyond in the technological revolution. Since 2015 (or some say 2012), it has changed the nature of computing. And there&#8230;<\/p>\n","protected":false},"author":63,"featured_media":18788,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[6,13],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"Serverless architecture is a step beyond in the technological revolution. The real question is — should you consider switching to serverless too?\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/serverless-architecture-from-buzzword-to-breakthrough-paradigm\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Why Serverless Is the Future of Development | Intellectsoft\" \/>\n<meta property=\"og:description\" content=\"Serverless architecture is a step beyond in the technological revolution. The real question is — should you consider switching to serverless too?\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/serverless-architecture-from-buzzword-to-breakthrough-paradigm\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2020-02-27T14:37:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-07-24T17:36:30+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/serverless_architecture-e1582907372936.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"500\" \/>\n\t<meta property=\"og:image:height\" content=\"231\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/serverless-architecture-from-buzzword-to-breakthrough-paradigm\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/serverless_architecture-e1582907372936.jpg\",\"width\":500,\"height\":231,\"caption\":\"serverless architecture blog post one\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/serverless-architecture-from-buzzword-to-breakthrough-paradigm\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/serverless-architecture-from-buzzword-to-breakthrough-paradigm\/\",\"name\":\"Why Serverless Is the Future of Development | Intellectsoft\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/serverless-architecture-from-buzzword-to-breakthrough-paradigm\/#primaryimage\"},\"datePublished\":\"2020-02-27T14:37:00+00:00\",\"dateModified\":\"2020-07-24T17:36:30+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\"},\"description\":\"Serverless architecture is a step beyond in the technological revolution. The real question is \\u2014 should you consider switching to serverless too?\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/serverless-architecture-from-buzzword-to-breakthrough-paradigm\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\",\"name\":\"Anastasiia Hibaieva\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5e777493cd8ae0902fee5b35c44765ce?s=96&d=mm&r=g\",\"caption\":\"Anastasiia Hibaieva\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/18780"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/63"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=18780"}],"version-history":[{"count":0,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/18780\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/18788"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=18780"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=18780"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=18780"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}