{"id":19344,"date":"2020-04-01T17:15:59","date_gmt":"2020-04-01T14:15:59","guid":{"rendered":"https:\/\/www.intellectsoft.net\/blog\/?p=19344"},"modified":"2020-07-15T14:52:22","modified_gmt":"2020-07-15T11:52:22","slug":"driving-strategic-cost-optimization-a-smart-spending-during-crisis","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/driving-strategic-cost-optimization-a-smart-spending-during-crisis\/","title":{"rendered":"Driving Strategic Cost Optimization: A Smart Spending During Crisis"},"content":{"rendered":"<p>In this rapidly changing global business and humanity environment — where cost is a true strategic differentiator — Intellectsoft findings provide an inside look at the practices and trends currently shaping the future of enterprises.<\/p>\n<p><b>In brief:<\/b><\/p>\n<ol>\n<li>COVID-19 will have global economic and financial ramifications that will be felt throughout global supply chains, from raw materials to finished products.<\/li>\n<li>&#8220;By 2022, 80% of I&amp;O organizations that lack digital business strategies will risk cuts in budget, resulting in outsourcing as a means of delivering results,&#8221; — Gartner.<\/li>\n<li>Considering alternate or non-traditional revenue streams might be a reliable way to follow for many vulnerable businesses, including collaborative models, dedicated teams, and remote work.<\/li>\n<\/ol>\n<h2>1. A Challenging Landscape<\/h2>\n<p>As a typical “black swan” event, COVID-19 took the world by complete surprise. This newly identified coronavirus was first seen in Wuhan, the capital of Hubei province in central China, on December 31, 2019. As we almost enter April 2020, the virus has infected over 700,000 people, led to more than 30,000 deaths, and has spread to more than 200 countries.<\/p>\n<p>The focus of most businesses is now on protecting employees, understanding the risks to their business, and managing the supply chain disruptions caused by the efforts to contain the spread of COVID-19. The full impact of this epidemic on businesses is still unknown. However, one thing is certain:<\/p>\n<blockquote><p>COVID-19 will have global economic and financial ramifications that will be felt throughout global supply chains, from raw materials to finished products.<\/p><\/blockquote>\n<p>Optimizing costs is a perennial, continuous cross-enterprise effort organizations take into consideration now more than ever. <a href=\"https:\/\/emtemp.gcom.cloud\/ngw\/globalassets\/en\/sales-service\/documents\/trends\/driving-cost-optimization-whitepaper.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">Cost optimization<\/a> is a critical imperative for any functional leader, but its execution and impact reach far beyond the limits of any single functional area.<\/p>\n<p><b>Cost optimization should not be confused with budget reductions. <\/b>When undertaking budget reductions, functional leaders — be they marketing leads, supply chain managers, business unit directors or technology team leaders — are often asked only to hit budget reduction targets within their own departments. While a more holistic, enterprise wide approach may be beneficial, the ability of functional leaders to impact areas outside their control is often limited.<\/p>\n<p>Organizations should approach cost optimization as an expansive effort that can have both immediate and long-term significance for business performance. To truly serve the enterprise, cost optimization demands a mix of improvements that touch every part of the enterprise.<\/p>\n<h2>2. Under-digitized Businesses are Hard-hit<\/h2>\n<p>Businesses that are currently struggling for profitability — those with low or unstable cash reserves — are particularly vulnerable.<\/p>\n<blockquote><p>&#8220;By 2022, 80% of I&amp;O organizations that lack digital business strategies will risk cuts in budget, resulting in outsourcing as a means of delivering results.&#8221;<\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.gartner.com\/en\/conferences\/emea\/infrastructure-operations-cloud-germany\/featured-topics\/cost-optimization\" target=\"_blank\" rel=\"noopener noreferrer\">Gartner Predicts<\/a><\/p>\n<\/blockquote>\n<p>However, even businesses that appear to be in good financial shape may not be immune, depending on how the situation progresses. Sectors such as tourism, hospitality, entertainment and air transportation have been particularly hard-hit in the short term.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-19345 alignnone\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/business.jpg\" alt=\"industries that suffer the most\" width=\"1235\" height=\"596\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/business.jpg 1235w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/business-300x145.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/business-1024x494.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/business-768x371.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/business-600x290.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/business-450x217.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/business-1000x483.jpg 1000w\" sizes=\"(max-width: 1235px) 100vw, 1235px\" \/><\/p>\n<p>Businesses in consumer goods and retail may also be at higher- than-normal financial risk, especially those in seasonal businesses where demand may be lost (as opposed to shifted), such as such perishable consumer goods and seasonal apparel. Even commodity-oriented industries, such as metals and mining or oil and gas, are exposed as global demand shifts and pricing fluctuates.<\/p>\n<h2>3. Building Blocks for Change: Cost Optimization Initiatives<\/h2>\n<p>Given the importance of managing cash flows in times like this, companies should immediately develop a <b>plan for cost optimization as part of their overall business risk and <\/b><a href=\"https:\/\/www.intellectsoft.net\/blog\/business-continuity-efforts-in-response-to-uncertainty\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>continuity plans<\/b><\/a><b>.<\/b><\/p>\n<p>In doing so, it is essential to take a full ecosystem perspective, as the approaches you take to manage cash will have implications for not only your business but also for your customers.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-19351 alignnone\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Key-Initiative-Overview-for-IT-Cost-Optimization.jpg\" alt=\"IT cost optimization pic\" width=\"1235\" height=\"887\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Key-Initiative-Overview-for-IT-Cost-Optimization.jpg 1235w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Key-Initiative-Overview-for-IT-Cost-Optimization-300x215.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Key-Initiative-Overview-for-IT-Cost-Optimization-1024x735.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Key-Initiative-Overview-for-IT-Cost-Optimization-768x552.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Key-Initiative-Overview-for-IT-Cost-Optimization-600x431.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Key-Initiative-Overview-for-IT-Cost-Optimization-450x323.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Key-Initiative-Overview-for-IT-Cost-Optimization-1000x718.jpg 1000w\" sizes=\"(max-width: 1235px) 100vw, 1235px\" \/><\/p>\n<p>Borrowing from the lessons learned from the SARS outbreak in 2003, the 2008 recession and credit crunch, and the last black swan event to significantly impact global economy — the Japanese earthquake of 2011 — we see the following practices and strategies as worth considering today.<\/p>\n<p>Among them: ensuring your own financing remains viable, focusing on the cash-to-cash conversion cycle, thinking like a CFO, revisiting your variable costs and capital investment plans, extending payables, etc.<\/p>\n<blockquote><p>Considering alternate or non-traditional revenue streams might be a reliable way to follow for many vulnerable businesses.<\/p><\/blockquote>\n<p><b>Shared services, business process outsourcing, <\/b><a href=\"https:\/\/emtemp.gcom.cloud\/ngw\/eventassets\/en\/conferences\/dci9\/documents\/gartner-infrastructure-operations-cloud-india-cost-optimization-roadmap.pdf\" target=\"_blank\" rel=\"noopener noreferrer\"><b>automation of IT operations<\/b><\/a> — all these components offer considerable cost saving opportunities. Enterprise cost optimization priorities — to preserve revenue, continue to innovate and keep the best staff — often conflict with the cost reduction priorities of functional leaders, which are to reduce costs quickly with as little disruption as possible.<\/p>\n<h2>4. Five Areas of Focus for the Enterprise<\/h2>\n<p>While there is a great amount of functional variability in how leaders approach cost optimization, five areas of focus allow leaders in various roles and business units to pursue beneficial optimization (see the figure mentioned below).<\/p>\n<h3>1) Benchmark to get a baseline<\/h3>\n<p>The use of comparative metrics is a key aspect of any effective cost optimization campaign. <b>Benchmarks help leaders analyze their environments to discover what resources and initiatives may require additional funding or optimization.<\/b><\/p>\n<p>Benchmarks also showcase areas of strategic investment. But care is required, as benchmarks can easily be misused.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-19347 alignnone\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Driving-Cost-Optimization-Across-the-Enterprise.jpg\" alt=\"cost optimization across enterprise\" width=\"1235\" height=\"957\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Driving-Cost-Optimization-Across-the-Enterprise.jpg 1235w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Driving-Cost-Optimization-Across-the-Enterprise-300x232.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Driving-Cost-Optimization-Across-the-Enterprise-1024x793.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Driving-Cost-Optimization-Across-the-Enterprise-768x595.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Driving-Cost-Optimization-Across-the-Enterprise-600x465.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Driving-Cost-Optimization-Across-the-Enterprise-450x349.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Driving-Cost-Optimization-Across-the-Enterprise-1000x775.jpg 1000w\" sizes=\"(max-width: 1235px) 100vw, 1235px\" \/><\/p>\n<h3>2) Identify critical points in the budget to shield<\/h3>\n<p>To bring more clarity to the optimization decision-making process, companies should identify:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">the potential financial benefit;<\/li>\n<li style=\"font-weight: 400;\">business impact;<\/li>\n<li style=\"font-weight: 400;\">business risk;<\/li>\n<li style=\"font-weight: 400;\">time requirement of candidate cost optimization projects.<\/li>\n<\/ul>\n<p>In terms of impact, the effectiveness of the <a href=\"https:\/\/www2.deloitte.com\/content\/dam\/Deloitte\/global\/Images\/infographics\/services\/gx-deloitte-global-cost-management-infographic.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">cost optimization initiative<\/a> is partly contingent on whether business unit leaders and their staff are capable of changing and adapting to new approaches and processes.<\/p>\n<p>For example, optimization may involve frontline systems and tool automation as part of their business processes. What does this adaptation mean when leaders consider implementation and training timeframes?<\/p>\n<p>To gain CEO or CFO approval for an initiative, leaders can describe a business case showing how the <b>cost optimization initiative will improve such criteria as:<\/b><\/p>\n<ol>\n<li style=\"font-weight: 400;\">Business processes.<\/li>\n<li style=\"font-weight: 400;\">Productivity.<\/li>\n<li style=\"font-weight: 400;\">Time-to-market.<\/li>\n<li style=\"font-weight: 400;\">The like, as opposed to continuing with the status quo.<\/li>\n<\/ol>\n<p>These criteria points offer a suitable framework for prioritizing which line items are worth preserving, and which projects are worth supporting.<\/p>\n<h3>3) Identify noncritical points to eliminate<\/h3>\n<p>Just as crucial to the decision-making process is the identification of aspects of the business that can be eliminated or reduced. These changes will be primarily quantifiable as reductions in expense, but, again, leaders should consider the significance of each point to the business. An enterprise&#8217;s position within the growth model — growing, mature or declining — serves as an initial driver for identifying and prioritizing cost optimization opportunities:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">Growing companies have a higher tendency to <b>standardize and simplify IT- enabled capabilities in order to optimize costs<\/b> and meet business goals for matching service levels to customer demand.<\/li>\n<li style=\"font-weight: 400;\"><b>Mature enterprises typically respond to cost optimization goals with investment-based programs. <\/b>These programs aim to automate or utilize capabilities at lower capacity costs.<\/li>\n<\/ul>\n<h3>4) Determine cost optimization approach<\/h3>\n<p>Several options exist for optimization, including reduction of costs, reduction of demand, and a balance of short- and long-term initiatives.<\/p>\n<p>Some categories of optimization functions include:<\/p>\n<ol>\n<li style=\"font-weight: 400;\">Instituting emergency cost reductions.<\/li>\n<li style=\"font-weight: 400;\">Applying selective cost reductions.<\/li>\n<li style=\"font-weight: 400;\">Preserving costs and business value.<\/li>\n<li style=\"font-weight: 400;\">Increasing costs for added business value.<\/li>\n<\/ol>\n<h3>5) Communicate plans to stakeholders and lead the organization through the change<\/h3>\n<p>The leader of a cost optimization program will be in constant contact with all business areas. Communication of best practices should always include details of the practice and expected outcomes.<\/p>\n<p>Leaders can also offer a list of alternative options that were considered, along with detailed explanations outlining why the alternative options were not selected.<\/p>\n<h3>5. Accelerating Through Cost-efficient Remote Work<\/h3>\n<p>A virtual remote workforce enables organizations to:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">Reduce costs.<\/li>\n<li style=\"font-weight: 400;\">Drive growth and better serve customers.<\/li>\n<li style=\"font-weight: 400;\">Increase business productivity.<\/li>\n<li style=\"font-weight: 400;\">Attract top talent.<\/li>\n<\/ul>\n<p>Not only remote work enables organizations to shift labor costs to lower cost resources, cut travel and expense budgets, and reduce fixed facility costs, but also a virtual workforce gives organizations a greater degree of flexibility to take advantage of lower cost labor regardless of location — and engage workers only when and where the business needs. For example, many workers sourced from outlying areas and offshore locations, such as Eastern Europe have significantly lower wages than similarly qualified resources.<\/p>\n<p>From Google to Ford, companies around the globe are telling staff to work from home in a bid to stem the spread of pandemic. Such remote working at scale is unprecedented and will leave a lasting impression on the way people live and work for many years to come. What companies need in uncertain times is a collaborative mindset and the ability to map and analyze the value created deep within employee networks.<\/p>\n<h3>6. Collaborative Models and Dedicated Teams Value<\/h3>\n<p>Although collaboration is one of the most crucial components of modern businesses, most companies still do not know how to get the most out of it. Here are some of the <b>collaborative models tactics we apply here, at Intellectsoft:<\/b><\/p>\n<ul>\n<li style=\"font-weight: 400;\">The team members from different time zones are not assigned for one micro task.<\/li>\n<li style=\"font-weight: 400;\">Stories are organized between each other to ensure “rolling style” execution.<\/li>\n<li style=\"font-weight: 400;\">All developers work shifted hours to ensure the best possible communications.<\/li>\n<li style=\"font-weight: 400;\">Work time designed so that all teams have 2 hours of overlap with regular PST work time.<\/li>\n<li style=\"font-weight: 400;\">Overlaps are used for daily scrums, any meetings and informal collaboration.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19346\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/collaboration.jpg\" alt=\"distributed teams\" width=\"1235\" height=\"833\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/collaboration.jpg 1235w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/collaboration-300x202.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/collaboration-1024x691.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/collaboration-768x518.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/collaboration-600x405.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/collaboration-450x304.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/collaboration-1000x674.jpg 1000w\" sizes=\"(max-width: 1235px) 100vw, 1235px\" \/><\/p>\n<p>What companies need in a collaborative age is the ability to map and analyze the value created within employee networks. These networks should focus on both — individual and organizational effectiveness and on the value the interactions between employees and companies are created.<\/p>\n<p>To make these interactions more useful, executives must reorient them toward the revenue and productivity benefits that collaborative models generate, the costs such interactions impose, and opportunities to improve connectivity at the points that create the greatest economic value.<\/p>\n<h2>Dedicated teams as more cost-effective approach for under-digitized businesses<\/h2>\n<p><a href=\"https:\/\/www.intellectsoft.net\/blog\/dedicated-development-team-reimagined-and-improved\/\" target=\"_blank\" rel=\"noopener noreferrer\">Dedicated team model<\/a> aims to provide a client with the right developers regardless of wherever the developers and the client are, and negotiate a mode of cooperation: nearshore (in close proximity to the client), onshore (on the client’s premises), or offshore (remotely).<\/p>\n<p>Moreover, dedicated teams are known for their flexibility, niche skills, high scaling velocity, and high loyalty. As dedicated teams offer immense flexibility, the client has a lot of space to be efficient with their budget. The key industries that look for dedicated team approach are:<\/p>\n<ul>\n<li style=\"font-weight: 400;\"><a href=\"https:\/\/www.intellectsoft.net\/platforms\/healthcare\" target=\"_blank\" rel=\"noopener noreferrer\">healthcare<\/a> (among them a lot of pharmaceutical companies);<\/li>\n<li style=\"font-weight: 400;\"><a href=\"https:\/\/www.intellectsoft.net\/platforms\/hospitality\" target=\"_blank\" rel=\"noopener noreferrer\">travel &amp; hospitality<\/a>;<\/li>\n<li style=\"font-weight: 400;\"><a href=\"https:\/\/www.intellectsoft.net\/platforms\/ar-construction\" target=\"_blank\" rel=\"noopener noreferrer\">construction<\/a>.<\/li>\n<\/ul>\n<h2><img loading=\"lazy\" class=\"size-full wp-image-19352 alignnone\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/123.png\" alt=\"dedicated teams\" width=\"1033\" height=\"462\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/123.png 1033w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/123-300x134.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/123-1024x458.png 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/123-768x343.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/123-600x268.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/123-450x201.png 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/123-1000x447.png 1000w\" sizes=\"(max-width: 1033px) 100vw, 1033px\" \/><\/h2>\n<h2>Beyond Pandemic: Risks and Security<\/h2>\n<p>For some organizations, survival is the only way of implementing things today. Others are crawling through the fog of uncertainty, guessing what’s next, where should be the next turn, when things get back to normal. The question is, what will new normal look like?<\/p>\n<p>No one can answer this question for sure now. But what we believe we can state is that the new normal is already here. The pandemic has made it harder for companies to maintain risks and so — the security and stability of their operations and even survival mode. But new tactics can help leaders to safeguard their people and organizations.<\/p>\n<p>We, at Intellectsoft, empower companies and their workforces with digital transformation services and approaches to help them survive during these times. Are you and your organization looking for it?<\/p>\n<p><a href=\"https:\/\/www.intellectsoft.net\/contacts\"><b>Talk to our experts<\/b><\/a><b> and find out more about the topic and how your business can start benefiting from it today!<\/b><\/p>\n","protected":false},"excerpt":{"rendered":"<p>In this rapidly changing global business and humanity environment — where cost is a true strategic differentiator — Intellectsoft findings provide an inside look at&#8230;<\/p>\n","protected":false},"author":63,"featured_media":19349,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,3,1,13],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"Optimizing costs is a perennial, continuous cross-enterprise effort organizations take into consideration now more than ever.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/driving-strategic-cost-optimization-a-smart-spending-during-crisis\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Enterprise cost optimization: achieving smart spending during crisis\" \/>\n<meta property=\"og:description\" content=\"Optimizing costs is a perennial, continuous cross-enterprise effort organizations take into consideration now more than ever.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/driving-strategic-cost-optimization-a-smart-spending-during-crisis\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2020-04-01T14:15:59+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-07-15T11:52:22+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/driving_strategic_cost_optimization.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1300\" \/>\n\t<meta property=\"og:image:height\" content=\"600\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/driving_strategic_cost_optimization.jpg\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/driving-strategic-cost-optimization-a-smart-spending-during-crisis\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/driving_strategic_cost_optimization.jpg\",\"width\":1300,\"height\":600,\"caption\":\"cost optimization covid-19\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/driving-strategic-cost-optimization-a-smart-spending-during-crisis\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/driving-strategic-cost-optimization-a-smart-spending-during-crisis\/\",\"name\":\"Enterprise cost optimization: achieving smart spending during crisis\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/driving-strategic-cost-optimization-a-smart-spending-during-crisis\/#primaryimage\"},\"datePublished\":\"2020-04-01T14:15:59+00:00\",\"dateModified\":\"2020-07-15T11:52:22+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\"},\"description\":\"Optimizing costs is a perennial, continuous cross-enterprise effort organizations take into consideration now more than ever.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/driving-strategic-cost-optimization-a-smart-spending-during-crisis\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\",\"name\":\"Anastasiia Hibaieva\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5e777493cd8ae0902fee5b35c44765ce?s=96&d=mm&r=g\",\"caption\":\"Anastasiia Hibaieva\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/19344"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/63"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=19344"}],"version-history":[{"count":0,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/19344\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/19349"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=19344"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=19344"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=19344"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}