{"id":19467,"date":"2020-04-08T19:11:59","date_gmt":"2020-04-08T16:11:59","guid":{"rendered":"https:\/\/www.intellectsoft.net\/blog\/?p=19467"},"modified":"2020-08-19T14:39:46","modified_gmt":"2020-08-19T11:39:46","slug":"it-crisis-management-rules-during-global-2020-zeroing","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/it-crisis-management-rules-during-global-2020-zeroing\/","title":{"rendered":"The Day After Tomorrow: IT Crisis Management Rules During Global 2020 Zeroing"},"content":{"rendered":"<p>Although the full impact of a novel pandemic is still unknown, many organizations are being impacted by the crisis domino effect, which reflects on employees, assets, operations, stakeholders, and even reputation.<\/p>\n<p>Being proactive during disruption means that companies need to consider their business continuity preparedness activities and profound crisis management. This article is focused on risk identification and organizational exposure, on critical dependencies, and how to act pragmatically and effectively during crises and find resilience solutions.<\/p>\n<p>In brief:<\/p>\n<ol>\n<li style=\"font-weight: 400;\">Destructive behavioral models: before implementing any IT crisis management approach, make sure you choose the most reasonable scenario to act.<\/li>\n<li style=\"font-weight: 400;\">IT crisis management examples in theory and in practice.<\/li>\n<li style=\"font-weight: 400;\">Test and tried IT crisis management strategies and how to activate them in order to survive on the market.<\/li>\n<\/ol>\n<h2>Crisis management in IT project: Dangerous behavioral models<\/h2>\n<p>Humans manage IT businesses, so managers are likely to choose natural reactions in crisis. And this is dangerous! Such subconscious sweet escapes lead to controversial consequences to the companies. So, before trying any IT crisis management approach, ensure your behavior is not destructive first.<\/p>\n<p>Psychologists distinguish three natural reactions to stress:<\/p>\n<ul>\n<li>Fight,<\/li>\n<li>Flight, or<\/li>\n<li>Freeze.<\/li>\n<\/ul>\n<p>All these behaviors are not rational but instinct-based. Thus, they significantly complicate your ability to succeed in crisis management in IT projects. But there is some good news: once acknowledged, you can neutralize them.<\/p>\n<p>So, check yourself by completing our quick test.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19468\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-6.jpg\" alt=\"fight freeze\" width=\"1200\" height=\"473\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-6.jpg 1200w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-6-300x118-1.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-6-1024x404-1.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-6-768x303-1.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-6-600x237-1.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-6-450x177-1.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-6-1000x394-1.jpg 1000w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><\/p>\n<h3>1. A person who fights in a crisis<\/h3>\n<ul>\n<li style=\"font-weight: 400;\">You check the news and see what this world is coming to. Oil, financial crisis, coronavirus, worldwide quarantine, etc. This uncontrollable destruction makes you furious.<\/li>\n<li style=\"font-weight: 400;\">Your common reaction to stress is arguing and rejecting the severity of the problem. You’re likely to think, “This coronavirus is just the flu. I prefer to disregard, close my eyes, and keep on working as usual.”<\/li>\n<li style=\"font-weight: 400;\">As a business owner, you keep setting ambitious business aims, negotiating new strategies, and publishing aggressive ads.<\/li>\n<\/ul>\n<p>If you’ve recognized yourself in this type of personality, calm down first. Everything will be back soon, but you need to act accordingly. We&#8217;re all victims of the circumstances here. In a crisis, we need to be even more flexible as usual. Don&#8217;t be stubborn, or the world will crush you down.<\/p>\n<h3>2. A person who flight in a crisis<\/h3>\n<ul>\n<li style=\"font-weight: 400;\">Once you face danger, you feel the urge to disappear. If the problems are increasing like a snow avalanche, you lose control over the situation. The severity of a crisis frightens you.<\/li>\n<li style=\"font-weight: 400;\">In a stressful situation, you want to close your eyes, run away from the city, and disappear with your family (or alone).<\/li>\n<li style=\"font-weight: 400;\">As a business owner, you feel the urge to quit all the operational processes and cut all the costs. This may sound reasonable. But once uncontrolled, this behavior turns into destruction. And your team can find a strong reason to call you a deceiver.<\/li>\n<\/ul>\n<p>If you’re an escapist, realize that’s your unconscious behavior. Next time you feel the urge to run, just pause and take a deep breath. Remember: in crisis, your company needs a new strategy, and your team needs a real leader. If you choose to run away, you sign the death of your business.<\/p>\n<h3>3. A person who freezes in a crisis<\/h3>\n<ul>\n<li style=\"font-weight: 400;\">In any uncontrollable situation, you can’t decide how to react. You feel paralyzed and literally freeze in one place.<\/li>\n<li style=\"font-weight: 400;\">You can’t act until you see what the next move the majority takes.<\/li>\n<li style=\"font-weight: 400;\">As a business owner, you prefer to change nothing and see what happens.<\/li>\n<\/ul>\n<p>Among these three instinctive reactions, freezing is the most reasonable scenario in shock. You don’t keep setting high aims in inappropriate circumstances. You&#8217;re not the one who closes everything and gives up without fighting. But you’re destroying your business if you literally sit and do nothing.<\/p>\n<p>Whichever your natural reaction is, keep going slowly. And think of restructuring the business according to the new rules. It’s a high time to think of new opportunities, time-honored outsourcing strategies, and your life after the crisis.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19469\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-8.jpg\" alt=\"life after crisis\" width=\"1200\" height=\"473\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-8.jpg 1200w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-8-300x118-1.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-8-1024x404-1.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-8-768x303-1.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-8-600x237-1.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-8-450x177-1.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-8-1000x394-1.jpg 1000w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><\/p>\n<h3>4. I’m not fighting, running, or freezing. What’s my IT crisis management plan?<\/h3>\n<p>Once you become aware of your instincts and ready to do a careful analysis, don’t expect to get a ready-to-use recipe from any article. When it comes to crisis management, any decision is tailor-made. Still, there are some common sense IT crisis management practices that work both in crisis and stable time. In this harsh reality, it’s time to remind them.<\/p>\n<p>Remember the test above: the biggest mistake is to make any sudden movements. All your crisis decisions are contextual. Their magic power will end once people come back to the streets, and the world economy recovers. Of course, you can gain some profit by catching the moment today &#8211; but you will need to reinvent something in the long run. If you want to invest today in the future, think of the proper policies, technologies, and cost optimization approaches.<\/p>\n<h2>Crisis management examples: Theory and Practice<\/h2>\n<p>You can come back to books, searching for previously developed scenarios of how to act in today’s crisis. But they won’t help you. Nobody predicted the unique combination of all current troubles before &#8211; health threat because of coronavirus, social threat because of quarantine, and economic threat because of the financial crisis. You can collect the pieces of useful information in books, but nobody can tell you what to do exactly.<\/p>\n<p>In its turn, the contemporary business practice has already shown one reliable truth: when all the expenses are rearranged, there’s one category that isn’t cut at any cost. This is digitalization, the constant driver for the innovations. When everybody is self-isolated, the Internet is the only communication channel left. And the demand for greater digitalization can be put at the core of IT crisis management strategic recovery for 2020.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19470\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/3-7.jpg\" alt=\"recovery for 2020\" width=\"1200\" height=\"473\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/3-7.jpg 1200w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/3-7-300x118-1.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/3-7-1024x404-1.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/3-7-768x303-1.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/3-7-600x237-1.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/3-7-450x177-1.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/3-7-1000x394-1.jpg 1000w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><\/p>\n<h3>Digitalization is a form of cooperation that can both save an offline company in these hard times and become a center of IT crisis management strategy.<\/h3>\n<p>Once forced to become remote or die, the businesses will try their best to cover the lack of digital tools. To survive, many managers stop useless spending and turn to investing in their added business value. And here, IT companies become extremely helpful to them. Software is a solution for various offline operations needed today. The remote developers can create a fast and efficient delivery for coffee shops, implement an app for outfits from showrooms or orchestrate the remote working process for an office team. IT can manage the crisis by covering the basic demand for digitalization under the new market rules, in short.<\/p>\n<p>With a proper mindset, a crisis is always an opportunity. But don’t be in a rush to catch any of them while in crisis.<\/p>\n<h3>Think of cost optimization, not cost-cutting<\/h3>\n<p>To survive and become great again, check if you’re ready for three IT directions on which future pivots:<\/p>\n<ol>\n<li style=\"font-weight: 400;\">Relying on remote workplace optimization and dedicated development team creation,<\/li>\n<li style=\"font-weight: 400;\">Adopting various forms of business process outsourcing &#8211; a traditional software development outsourcing company or its alternative forms: offshore software development, nearshore software development, or an outstaffing company,<\/li>\n<li style=\"font-weight: 400;\">Implementing shared services and establishing effective collaboration models.<\/li>\n<\/ol>\n<p>All these models have been effective and highly recommended for all the companies during the last couple of years. But today, they are likely to help you stand this storm and become stronger after the crisis.<\/p>\n<p>They work if only you had started adopting them before coronavirus conquered the world, of course.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19471\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/4-8.png\" alt=\"action course\" width=\"1200\" height=\"473\" \/><\/p>\n<h3>Remote workplace and dedicated development teams<\/h3>\n<p>People all over the world stay home, but the majority of them keep working remotely. For years, remote developers have been hippies &#8211; but during quarantine, managers see the true value of a dedicated development team. The current situation is an opportunity for IT companies to organize micromanagement processes more effectively and build a team of highly motivated and talented people who can stand any crisis.<\/p>\n<h3>Software development outsourcing company or the power of new collaboration models<\/h3>\n<p>Introducing outsourcing software development is an effective strategy both in crisis and long after it passes. By finding a proper balance between in-house activities and outsourced operations, the cost optimization approach shows its best.<\/p>\n<h3>Requesting offshore software development services (or how to optimize your expenses with offshore software development cost)<\/h3>\n<p>Offshore model is among the real solutions to cost optimization during this crisis. This way, an offshore software development company can effectively reduce expenses for keeping an in-house team. Also, it allows fast hiring and fast scaling, which ensures the needed flexibility during the crisis.<\/p>\n<h3>Nearshore software development model and IT outstaffing<\/h3>\n<p>When you work remotely, the exact form of cooperation and the geographical location of your developers doesn’t matter that much. Additionally, you don’t need a separate budget to maintain an office. These models ensure high flexibility: they are project-based, provide managed services, and enable fast time-to-market delivery during the quarantine.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19472\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/5-6.jpg\" alt=\"delivery chain\" width=\"1200\" height=\"473\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/5-6.jpg 1200w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/5-6-300x118-1.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/5-6-1024x404-1.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/5-6-768x303-1.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/5-6-600x237-1.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/5-6-450x177-1.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/5-6-1000x394-1.jpg 1000w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><\/p>\n<h3>Crisis management steps: Two strategic moves that will help you survive<\/h3>\n<p>Let’s deal with it: you cannot change anything dramatically in the current situation. The best to do is to freeze and think of optimizing your costs. In the end, the 2020 crisis is nothing but a mistake to live through.<\/p>\n<p>While steadily dealing with it, aim at reaching these two strategic goals:<\/p>\n<ol>\n<li style=\"font-weight: 400;\">Diversify your portfolio. Never depend on one product or project. Never rely on offline only, be ready to switch to another business development direction once needed. Prepare yourself for the worst scenario, and this will save your nerves and income figures.<\/li>\n<li style=\"font-weight: 400;\">Always have a rainy day fund. Your employees can live without extra entertainment in stable times &#8211; but in crisis, they will be happy to receive their salaries on time and not being fired.<\/li>\n<\/ol>\n<p>These strategies should be constant and gain different appearances in various IT processes. For example, you can teach your team the basics of remote productivity in stable times &#8211; and your remote developers will leave the next crisis more united than all in-house workers after quarantine. Cooperating with an outstaffing company in advance will teach your business to work with external collaborators and save your money for keeping in-house talents.<\/p>\n<p>Remain constant in digitalization, no matter what tomorrow brings. Your digital workplace lives here.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19473\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/6-4.jpg\" alt=\"digital workplace\" width=\"1200\" height=\"473\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/6-4.jpg 1200w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/6-4-300x118-1.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/6-4-1024x404-1.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/6-4-768x303-1.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/6-4-600x237-1.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/6-4-450x177-1.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/6-4-1000x394-1.jpg 1000w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><\/p>\n<h3>How two crisis management strategies will help you succeed in the future: The secret ingredient and the final thought<\/h3>\n<p>Once you learn from today’s bitter experience, you are ready for future crises. But any tactical and strategic step won’t work without the proper background. The fundamental trait is the strength of your IT brand.<\/p>\n<p>Your clients should love you and be ready to help once you need it. Invest in this, and enjoy the magic of their support.<\/p>\n<p>Keep calm, optimize your costs, and be valuable by yourself. This way, you will survive any crisis.<\/p>\n<p>We, at Intellectsoft, empower companies and their retail workforce with <a href=\"https:\/\/www.intellectsoft.net\/services\/digital-transformation-services\">digital transformation solutions<\/a> and data-driven insights. Are you and your organization ready to shift the mindsets and get the most out of innovations?<\/p>\n<p><a href=\"https:\/\/www.intellectsoft.net\/contacts\">Talk to our experts<\/a> and find out more about the topic and how your business or project can start benefiting from it today!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Although the full impact of a novel pandemic is still unknown, many organizations are being impacted by the crisis domino effect, which reflects on employees,&#8230;<\/p>\n","protected":false},"author":63,"featured_media":19474,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,3,13],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"How to survive and succeed in the 2020 crisis: destructive behaviors, tactic and strategic steps needed, and sustainable background for IT crisis management.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/it-crisis-management-rules-during-global-2020-zeroing\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Day After Tomorrow: IT Crisis Management Rules During Global 2020 Zeroing\" \/>\n<meta property=\"og:description\" content=\"How to survive and succeed in the 2020 crisis: destructive behaviors, tactic and strategic steps needed, and sustainable background for IT crisis management.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/it-crisis-management-rules-during-global-2020-zeroing\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2020-04-08T16:11:59+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-08-19T11:39:46+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/facebook_1200-630-2.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"630\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Twitter_1024_512-Copy-2.jpg\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/it-crisis-management-rules-during-global-2020-zeroing\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/cover-blog-2.jpg\",\"width\":1430,\"height\":600,\"caption\":\"it crisis management cover\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/it-crisis-management-rules-during-global-2020-zeroing\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/it-crisis-management-rules-during-global-2020-zeroing\/\",\"name\":\"How to survive the 2020 Crisis: IT Crisis Management Plan\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/it-crisis-management-rules-during-global-2020-zeroing\/#primaryimage\"},\"datePublished\":\"2020-04-08T16:11:59+00:00\",\"dateModified\":\"2020-08-19T11:39:46+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\"},\"description\":\"How to survive and succeed in the 2020 crisis: destructive behaviors, tactic and strategic steps needed, and sustainable background for IT crisis management.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/it-crisis-management-rules-during-global-2020-zeroing\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\",\"name\":\"Anastasiia Hibaieva\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5e777493cd8ae0902fee5b35c44765ce?s=96&d=mm&r=g\",\"caption\":\"Anastasiia Hibaieva\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/19467"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/63"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=19467"}],"version-history":[{"count":0,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/19467\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/19474"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=19467"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=19467"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=19467"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}