{"id":19707,"date":"2020-04-15T23:26:24","date_gmt":"2020-04-15T20:26:24","guid":{"rendered":"https:\/\/www.intellectsoft.net\/blog\/?p=19707"},"modified":"2020-09-14T19:47:14","modified_gmt":"2020-09-14T16:47:14","slug":"digital-disruption-the-industries-way-of-survival-during-the-covid-19-crisis","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/digital-disruption-the-industries-way-of-survival-during-the-covid-19-crisis\/","title":{"rendered":"Digital Disruption: The Industries&#8217; Way of Survival During the COVID-19 Crisis"},"content":{"rendered":"<p>The business impact of the COVID-19 outbreak on industries across the world is now profound. Leaders and CIOs should rev up their digital business strategies and position themselves for growth when the pandemic subsides. How exactly should leaders manage this impact and get the most out of opportunities? Here’s our answer.<\/p>\n<p>Summary:<\/p>\n<ol>\n<li style=\"font-weight: 400;\"><a href=\"#healthcare\">Healthcare<\/a><\/li>\n<li style=\"font-weight: 400;\"><a href=\"#test\">E-commerce and Online Shopping<\/a><\/li>\n<li style=\"font-weight: 400;\"><a href=\"#entertainment\">Entertainment<\/a><\/li>\n<li style=\"font-weight: 400;\"><a href=\"#food\">Restaurants and Food delivery<\/a><\/li>\n<li style=\"font-weight: 400;\"><a href=\"#industry\">IT &amp; Tech Industry<\/a><\/li>\n<li style=\"font-weight: 400;\"><a href=\"#construction\">Construction<\/a><\/li>\n<li style=\"font-weight: 400;\"><a href=\"#hospitality\">Hospitality<\/a><\/li>\n<li style=\"font-weight: 400;\"><a href=\"#fintech\">FinTech<\/a><\/li>\n<li style=\"font-weight: 400;\"><a href=\"#sensing\">Sensing and Shaping the Post-COVID Era<\/a><\/li>\n<\/ol>\n<p>Today, for the global sectors, COVID-19 presents two challenges: largely idled sectors disrupting trade and reduced demand from consumers. A few examples to consider, Chile is reeling from reduced copper demand. Germany — from auto parts shortage.<\/p>\n<p>In this article, we examine how different industries react to business and economic turbulence caused by the novel pandemic through innovation and digital capabilities. We discover this through <b>the example of 8 industries that try to win over the battle using digital and innovation capabilities.<\/b><\/p>\n<h2 id=\"healthcare\"><b>Healthcare<\/b><\/h2>\n<p>As each industry emerges from its acute response phase, many will find that they are entering a “new normal.” Expect the way healthcare is practiced and marketed to be no different.<\/p>\n<p>Beyond the negative impact of a traditional economic downturn, COVID-19 presents additional challenges — fear from the virus itself, collective grief, prolonged physical distancing, and associated social isolation — that will compound the impact on our collective <a href=\"https:\/\/www.mckinsey.com\/industries\/healthcare-systems-and-services\/our-insights\/helping-us-healthcare-stakeholders-understand-the-human-side-of-the-covid-19-crisis\" target=\"_blank\" rel=\"noopener noreferrer\">health<\/a>.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19717\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-3.jpg\" alt=\"stress Covid\" width=\"1200\" height=\"699\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-3.jpg 1200w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-3-300x175.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-3-1024x596.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-3-768x447.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-3-600x350.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-3-450x262.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1-3-1000x583.jpg 1000w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><\/p>\n<p style=\"text-align: center;\"><i>Reported signs of distress related to COVID-19 in the US.<\/i><\/p>\n<p>As the way healthcare is practiced evolves, so too will the environment and platforms through which that care is delivered. There will be new needs that emerge; new content will be needed, in new formats, manifesting in new marketing assets.<\/p>\n<h3>Digital Transformation in Healthcare and Other Solutions<\/h3>\n<p>There are three areas that healthcare marketing leaders should focus on, as the impact on their business and the subsequent need to adapt will be significant:<\/p>\n<ul>\n<li style=\"font-weight: 400;\"><b>Telehealth<\/b><\/li>\n<\/ul>\n<p>The <a href=\"https:\/\/www.ama-assn.org\/practice-management\/digital\/telehealth-53-growing-faster-any-other-place-care\" target=\"_blank\" rel=\"noopener noreferrer\">acceptance and utilization of telehealth<\/a> services within the US were already on a sharp incline before the COVID-19 crisis erupted globally.  Since then, medical and municipal leaders are leveraging the platform as a tool in combating the spread of COVID-19, accelerating adoption in the process.<\/p>\n<p>From a Payer perspective, CVS Health, Aetna, Cigna, and United Health are just a few of the payer organizations recommending patients move to virtual care – going so far as to waive copays for utilizing the service.<\/p>\n<p>Consumers are showing increased interest as well, with <a href=\"https:\/\/www.govtech.com\/em\/emergency-blogs\/disaster-zone\/what-are-people-searching-for-on-the-web--relating-to-covid-19.html\" target=\"_blank\" rel=\"noopener noreferrer\">SEMRush reporting<\/a> a 146.15% increase in searches for “in-home doctor visits” and a 53.97% increase in “in-home medical care” searches.<\/p>\n<ul>\n<li style=\"font-weight: 400;\"><b>Urgent care<\/b><\/li>\n<\/ul>\n<p>Urgent Care Centers are quickly becoming the front door in a person’s treatment journey.  A study from the Urgent Care Association found that a median of<a href=\"https:\/\/www.ucaoa.org\/About-UCA\/Industry-News\/ArtMID\/10309\/ArticleID\/877\/Booming-Urgent-Care-Industry-Filling-the-Gaps-in-Patient-Care\" target=\"_blank\" rel=\"noopener noreferrer\"> 35% of patients utilizing UCCs<\/a> do not have primary care physicians, reflecting the fact that Healthcare is shifting to much more of an on-demand service. Medicare and Medicaid patients made up almost 27% of UCC patients in 2018, confirming that the shift is not driven only by the young or affluent.<\/p>\n<p>The organization is flanking the physical services with digital efforts, with  <a href=\"https:\/\/cvshealth.com\/thought-leadership\/cvs-health-names-more-us-cities-for-healthhub-expansion\" target=\"_blank\" rel=\"noopener noreferrer\">almost 30% of the landing pages<\/a> on CVS.com Minute Clinic specific. Not to be outdone, Walmart<a href=\"https:\/\/www.cnn.com\/2020\/03\/03\/business\/walmart-health-care-clinics-amazon-cvs\/index.html\" target=\"_blank\" rel=\"noopener noreferrer\"> launched the first of its augmented health facilities<\/a> in September 2019.<\/p>\n<ul>\n<li><b>Almost everything goes online<\/b><\/li>\n<\/ul>\n<p>Medical conferences and congresses are a huge priority for companies in the Health sector. These events are valued by commercial organizations, advocacy groups, and healthcare professionals as key opportunities for medical education, peer-to-peer engagement, and the release of official study data.<\/p>\n<p>While some of those activities have been digitally distributed in parallel, a vast majority of that activity is face-to-face. The COVID-19 crisis is forcing digital transformation in <a href=\"https:\/\/www.intellectsoft.net\/platforms\/healthcare-it-solutions\" target=\"_blank\" rel=\"noopener noreferrer\">IT solutions for healthcare<\/a> industry to take new turns.<\/p>\n<h2><span style=\"color: #1476f2;\"><a style=\"color: #1476f2;\" href=\"https:\/\/www.intellectsoft.net\/platforms\/healthcare\"><b>Intellectsoft Healthcare Solutions<\/b><\/a><\/span><\/h2>\n<p>Since healthcare and economic environments force medical experts to take extra shifts, this greatly affects their own quality and safety of life.<\/p>\n<p>The idea behind Intellectsoft’s solution was to empower medical professionals with a simple tool that gives them flexibility, control, and more. We created an <b>on-demand healthcare staffing solution<\/b> consisting of two parts:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">iOS and Android app with an Uber-like feel (for the Nurse role);<\/li>\n<li style=\"font-weight: 400;\">Web Admin Panel (for Hospital Administrator or Security Supervisor role).<\/li>\n<\/ul>\n<p>Some of the most significant features included there are a nurse and hospital management, shift management, notification center, data export, etc. Solutions of this kind can be a major stride within the current time frames because they help doctors stay focused on more essential things and certain patients with reaching for treatments.<\/p>\n<p>As consumers and organizations have no other choice, the COVID-19 crisis is accelerating the utilization of digital platforms. While there have been financial, behavioral, and attitudinal<a href=\"https:\/\/www.jdpower.com\/sites\/default\/files\/2019185_telehealth_usage_and_awareness.pdf\" target=\"_blank\" rel=\"noopener noreferrer\"> roadblocks<\/a> to adoption in the past, the need to overcome the crisis is superseding those roadblocks and increases the number of first-time users.<\/p>\n<h2 id=\"entertainment\"><b>E-commerce and Online Shopping<\/b><\/h2>\n<p>Today, as B2B digital transformation statistics say, online shopping is the fastest-growing slice of the pie, dominating the scene and continuing to invest in digital capabilities.<\/p>\n<p>Traditional, smaller players are also eyeing the online scene. Many traditional small markets have taken to online channels to hawk products, conduct online auctions, and even to carry out customer relation-building, for example, passing tips on how to prepare dishes using their products.<\/p>\n<p>However, most authorities are warning organizations <a href=\"https:\/\/www.bankinfosecurity.com\/interviews\/coronavirus-spread-preparing-for-the-long-haul-i-4609\" target=\"_blank\" rel=\"noopener noreferrer\">to prepare for the long haul<\/a>. Virtually every company involved in global trade feels the impact.<\/p>\n<h3>Digital Transformation in B2B E-commerce<\/h3>\n<p><span data-preserver-spaces=\"true\">Digitalization had swiftly come into B2B E-commerce sectors a long time ago. But since recent times the situation has drastically changed, the technologies and trends have changed too. Although some things remain untouchable. Still, most of the E-commerce sales are made through mobile devices (<\/span><a class=\"_e75a791d-denali-editor-page-rtfLink\" href=\"https:\/\/www.statista.com\/statistics\/806336\/mobile-retail-commerce-share-worldwide\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span data-preserver-spaces=\"true\">73%<\/span><\/a><span data-preserver-spaces=\"true\">). Progressive Web App (PWA), with its native-app-like experience, is also here to stay.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">Artificial intelligence, machine learning, personalized customer experience, and predefined analytics — all complement an evolution of B2B consumerization. Data remains the primary fuel for accelerating the development of any organization involved in sales. Focusing on eternal questions: what data to collect and how to process it effectively remains unsolved even today. <\/span><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19718\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-2.jpg\" alt=\"social distancing\" width=\"1200\" height=\"1277\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-2.jpg 1200w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-2-282x300.jpg 282w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-2-962x1024.jpg 962w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-2-768x817.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-2-600x639.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-2-423x450.jpg 423w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/2-2-940x1000.jpg 940w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><\/p>\n<p style=\"text-align: center;\"><em>In response to social distancing, many businesses will make their E-commerce operations a key priority.<\/em><\/p>\n<h3>Solutions<\/h3>\n<p>Here is what we suggest you can do right now to mitigate the impact of coronavirus on your E-commerce business:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">Even as early digitalization investments are paying off, the current inability to fulfill delivery of online purchases suggests digitization efforts by businesses have only been focused at the customer-facing end. Supermarket chains should consider integrating their online shopping platforms with the stock-holding information of their physical branches.<\/li>\n<\/ul>\n<ul>\n<li style=\"font-weight: 400;\">COVID-19 may accelerate the growth of the online grocery sector. People did not just flock to physical supermarkets, but also loaded virtual carts with groceries from online platforms. With government directives to allow workers to work-from-home and to avoid non-essential trips to shopping malls, this trend of online shopping is likely to persist.<\/li>\n<\/ul>\n<ul>\n<li style=\"font-weight: 400;\">Another possibility is for online shopping platforms to partner with businesses that specialize in delivery fulfillment such as UberEats, Grab, Glovo, and Bolt Food. B2B digital transformation trends are another milestone companies should consider today.<\/li>\n<\/ul>\n<h2><span style=\"color: #1476f2;\"><a style=\"color: #1476f2;\" href=\"https:\/\/www.intellectsoft.net\/platforms\/ecommerce-retail\"><b>Intellectsoft Solutions in E-commerce<\/b><\/a><\/span><\/h2>\n<p>Since 2012, we’ve specialized in custom E-commerce application development, building E-commerce platforms dedicated to client’s needs or modify existing solutions to help scale-up businesses. A multi-category E-commerce platform based on digital tokens is one of the most significant solutions we’ve developed before.<\/p>\n<p>The solution includes a number of software systems released atop of the blockchain network to allow for a seamless experience in different stores. Multiple stores built on top of a shared blockchain network. Merchants can open their account without any extra effort and start selling goods or services for internal cryptocurrency. Customers can securely buy, transfer, and exchange online and offline goods while receiving loyalty points for future purchases.<\/p>\n<p><a href=\"https:\/\/www.intellectsoft.net\/contacts\"><b>Get in touch with our top minds<\/b><\/a><b> to find out how your business can start benefiting from our innovative solution today!<\/b><\/p>\n<h2 id=\"entertainment\"><b>Entertainment<\/b><\/h2>\n<p>Around the world, COVID-19 is having a marked impact on media supply, consumption, and advertising. Demand for content-streamed, live, and multi-layered — is skyrocketing while new content creation has been largely turned off.<\/p>\n<p>Since cinema and amusement parks across the globe are all shut down for uncertain times, thousands of entertainment organizations suffer formidable losses and fail to receive any kind of income. The outbreak triggered online entertainment and how some companies are finding ways to engage differently with consumers and the new reality.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19709\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/closeup-photo-of-person-holding-panasonic-remote-control-in-987586-scaled.jpg\" alt=\"Netflix home\" width=\"2560\" height=\"1707\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/closeup-photo-of-person-holding-panasonic-remote-control-in-987586-scaled.jpg 2560w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/closeup-photo-of-person-holding-panasonic-remote-control-in-987586-300x200.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/closeup-photo-of-person-holding-panasonic-remote-control-in-987586-1024x683.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/closeup-photo-of-person-holding-panasonic-remote-control-in-987586-768x512.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/closeup-photo-of-person-holding-panasonic-remote-control-in-987586-1536x1024.jpg 1536w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/closeup-photo-of-person-holding-panasonic-remote-control-in-987586-2048x1365.jpg 2048w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/closeup-photo-of-person-holding-panasonic-remote-control-in-987586-600x400.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/closeup-photo-of-person-holding-panasonic-remote-control-in-987586-450x300.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/closeup-photo-of-person-holding-panasonic-remote-control-in-987586-1000x667.jpg 1000w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" \/><\/p>\n<h3>Digital Transformation in Entertainment<\/h3>\n<ul>\n<li style=\"font-weight: 400;\">Demand for all forms of media — TV programs, short-form video, music streaming, and online gaming, particularly in geographies currently under stay-home instructions, has surged. Digital transformation in entertainment is expecting more new turns in the foreseen future.<\/li>\n<li style=\"font-weight: 400;\">The supply of new content may be limited to a few weeks for some formats (e.g., daytime dramas). New TV series currently being launched were completed prior to production sets shutting down.<\/li>\n<li style=\"font-weight: 400;\">Network resiliency and capacity continues to be a focus, as the demand for content surges. In the European Union, streaming platforms are reducing video quality to ensure networks are not overwhelmed and that customers can still view content.<\/li>\n<li style=\"font-weight: 400;\">While sports companies come to terms with a wave of cancellations, many are seeking new ways to reach their customers digitally. Many are looking to eSports or online simulated events to provide content to fans, with even professional athletes engaging in eSports competitions.<\/li>\n<li style=\"font-weight: 400;\">Musicians are going online and relying on streaming platforms as live shows are canceled.<\/li>\n<\/ul>\n<h2><span style=\"color: #1476f2;\"><a style=\"color: #1476f2;\" href=\"https:\/\/www.intellectsoft.net\/platforms\/music\"><b>Intellectsoft Solutions in Entertainment<\/b><\/a><\/span><\/h2>\n<p>Our partnerships with comprehensive streaming TV, film, and sports apps and websites have brought our clients and us valuable experience and knowledge of this industry.<\/p>\n<p>Our solution was a cloud-based, highly scalable elastic platform with advanced search and ingestion layers functionality to support a multi-million users base with a steep growth curve. Among the most significant benefits our client got were:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">Cloud scalability and elasticity;<\/li>\n<li style=\"font-weight: 400;\">Fast users growth potential;<\/li>\n<li style=\"font-weight: 400;\">Streamlined rich client application.<\/li>\n<\/ul>\n<h2 id=\"food\"><b>Restaurants and Food delivery<\/b><\/h2>\n<p>Despite some concerns, food delivery companies gain their momentum and become a popular option as people practice social distancing. It&#8217;s hard to pinpoint exactly how much growth there has been in this sector, but higher demand has led to <a href=\"https:\/\/www.marketwatch.com\/story\/if-the-coronavirus-spreads-in-america-food-delivery-companies-could-see-a-surge-in-demand-are-they-ready-2020-02-28\" target=\"_blank\" rel=\"noopener noreferrer\">higher pricing<\/a> in some areas. What more to expect?<\/p>\n<h3>Digital Transformation in Food Industry<\/h3>\n<p>Uber, for example, recently provided Uber-only drivers with information on adding Uber Eats food deliveries to their services. Within the first week, around <a href=\"https:\/\/www.uber.com\/newsroom\/increasing-earning-opportunities-with-uber-eats\/\" target=\"_blank\" rel=\"noopener noreferrer\">15% of Uber drivers<\/a> had completed their first food delivery.<\/p>\n<p>Fine dining establishments, small-town restaurants, and fast foods are now switching to offer delivery services to their customers. At the same time, restaurants that did not previously offer take-outs are now considering this option as never before. Some restaurants choose a third-party delivery service to partner with, and each offer comes with unique benefits.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19710\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/flat-lay-photography-of-two-tray-of-foods-1640769-scaled.jpg\" alt=\"Uber eats Covid\" width=\"2560\" height=\"2048\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/flat-lay-photography-of-two-tray-of-foods-1640769-scaled.jpg 2560w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/flat-lay-photography-of-two-tray-of-foods-1640769-300x240.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/flat-lay-photography-of-two-tray-of-foods-1640769-1024x819.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/flat-lay-photography-of-two-tray-of-foods-1640769-768x614.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/flat-lay-photography-of-two-tray-of-foods-1640769-1536x1229.jpg 1536w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/flat-lay-photography-of-two-tray-of-foods-1640769-2048x1639.jpg 2048w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/flat-lay-photography-of-two-tray-of-foods-1640769-600x480.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/flat-lay-photography-of-two-tray-of-foods-1640769-450x360.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/flat-lay-photography-of-two-tray-of-foods-1640769-1000x800.jpg 1000w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" \/><\/p>\n<p>Uber Eats and Deliveroo, among others, have launched contactless “leave at your door service” to help drivers and customers follow social distancing and quarantine rules.<\/p>\n<p>In addition to understanding already in place strict food hygiene <a href=\"https:\/\/trans.info\/en\/covid-19-pandemic-triggers-surge-in-global-food-delivery-industry-178243\" target=\"_blank\" rel=\"noopener noreferrer\">standards<\/a>, consumers may also be interested to learn if the businesses have:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">New practices for social distancing in the kitchen or during delivery pickups;<\/li>\n<li style=\"font-weight: 400;\">Policy for staff members who display symptoms of COVID-19;<\/li>\n<li style=\"font-weight: 400;\">Changes in food delivery guidelines, such as containers that allow for easier disinfection or better customer experience.<\/li>\n<\/ul>\n<p>Though it is uncertain where the digital transformation in food industry and the delivery trend will go in the post-COVID-19 era, many businesses are working as hard as they can to ensure they meet consumers’ expectations and remain relevant by providing an excellent service.<\/p>\n<h2 id=\"industry\"><b>IT &amp; Tech Industry<\/b><\/h2>\n<p>The effects of COVID-19 and are having <a href=\"https:\/\/www2.deloitte.com\/global\/en\/pages\/about-deloitte\/articles\/covid-19\/understanding-covid-19-s-impact-on-the-technology-sector-.html\" target=\"_blank\" rel=\"noopener noreferrer\">a significant impact on the technology sector,<\/a> too. However, the disruption has caused reevaluation on organizations’ business continuity plans (BCPs) as well as the acceleration of remote operations and online meetings. Let&#8217;s dive in to see what has changed more and what solutions organizations appeal to remain afloat.<\/p>\n<h3>Digital Transformation in IT and Other Solutions<\/h3>\n<ul>\n<li style=\"font-weight: 400;\">Companies with remote-working technologies already see increased demand as organizations accelerate their remote-working capabilities.<\/li>\n<li style=\"font-weight: 400;\">Security software will see third-order benefits from a growing remote workforce. Organizations race to secure endpoints, cloud-based tools, log management, and VPNs. So, IT spending on security software will increase too.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19711\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/girl-watching-video-using-imac-4144225-scaled.jpg\" alt=\"home teacher\" width=\"2560\" height=\"1709\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/girl-watching-video-using-imac-4144225-scaled.jpg 2560w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/girl-watching-video-using-imac-4144225-300x200.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/girl-watching-video-using-imac-4144225-1024x684.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/girl-watching-video-using-imac-4144225-768x513.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/girl-watching-video-using-imac-4144225-1536x1025.jpg 1536w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/girl-watching-video-using-imac-4144225-2048x1367.jpg 2048w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/girl-watching-video-using-imac-4144225-600x400.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/girl-watching-video-using-imac-4144225-450x300.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/girl-watching-video-using-imac-4144225-1000x667.jpg 1000w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" \/><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Due to enhanced remote work scenarios, <a href=\"https:\/\/www.intellectsoft.net\/services\/digital-transformation-services\">IT digital transformation<\/a> will play a larger role in future BCPs. Thus, CIOs and senior management will need to ensure a resilient, secure network, disaster recovery systems, and more devices for the ones working remotely.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The need for ever-faster access to data and automation will drive the focus on network equipment and communications, speeding up 5G network and equipment introduction.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">An increase in the use of tele- and video-conferencing software as more companies encourage employees to commute.<\/span><\/li>\n<\/ul>\n<h2><span style=\"color: #1476f2;\"><a style=\"color: #1476f2;\" href=\"https:\/\/www.intellectsoft.net\/blog\/intellectsofts-covid-19-response\/\"><b>Intellectsoft Business Continuity As Crisis Response<\/b><\/a><\/span><\/h2>\n<p>As a part of our Business Continuity Plan, within a couple of days, the global Intellectsoft team organized the smooth transition to remote operation without affecting any core systems and business processes to operate as usual during this period.<\/p>\n<p>As we are always fully committed to continue providing our customers and partners with the products and services they depend on, our senior leadership team remains vigilant and is monitoring the situation in real-time to respond rapidly to continuous change.<\/p>\n<h2 id=\"construction\"><b>Construction<\/b><\/h2>\n<p>Today, the most vulnerable industries are those lacking digitalization and tech maturity. The construction industry is one of them.<\/p>\n<p>Creating $1.3 trillion worth of structures each year only in the USA, the construction industry remains one of the most under-digitized industrial sectors. Longer-term construction companies <a href=\"https:\/\/www2.deloitte.com\/global\/en\/pages\/about-deloitte\/articles\/covid-19\/covid-19-s-impact-on-industrial-products---construction-firms.html\" target=\"_blank\" rel=\"noopener noreferrer\">across the globe<\/a> will have to contend with decreased demand as governments face rising deficits, and residential and commercial projects are dampened by unemployment and low GDP growth.<\/p>\n<p>To stay one step ahead of the crisis, the sector requires a different approach to the overall strategy. Digital transformation in construction industry is a burning topic for both — senior management and government. What are the solutions construction companies have today?<\/p>\n<h3>Solutions<\/h3>\n<p>Today, key questions executives and boards should be asking are: do we need to rethink our company’s digital strategy to remain financially solvent, and how can we use technology to gain operational leverage. And the digital transformation in the construction industry becomes inevitable.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19723\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bbfb.png\" alt=\"construction Covid\" width=\"974\" height=\"472\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bbfb.png 974w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bbfb-300x145.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bbfb-768x372.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bbfb-600x291.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/bbfb-450x218.png 450w\" sizes=\"(max-width: 974px) 100vw, 974px\" \/><\/p>\n<p style=\"text-align: center;\"><i>The importance of transformation in different types of construction departments.<\/i><\/p>\n<h2><span style=\"color: #1476f2;\"><a style=\"color: #1476f2;\" href=\"https:\/\/www.intellectsoft.net\/platforms\/ar-construction\"><b>Digital Transformation Construction Industry Solutions<\/b><\/a><\/span><\/h2>\n<p>The construction giant’s partnership with Intellectsoft has brought us tremendous experience and practical knowledge of this area. We have witnessed how modern technology could transform and improve further processes. It also carried the customer over to the next business development stage, ensuring the company’s end-to-end digital transformation.<\/p>\n<p>We hope to see more and more construction companies implement innovations and disrupt digital transformation in the future, such as:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">Scheduling and resource management system &amp; real-time reporting platform;<\/li>\n<li style=\"font-weight: 400;\">Asset tracking and management system;<\/li>\n<li style=\"font-weight: 400;\">Vendor ecosystem &amp; compliance solution;<\/li>\n<li style=\"font-weight: 400;\">Decision-making dashboard based on Big Data analytics.<\/li>\n<\/ul>\n<blockquote>\n<p style=\"text-align: center;\"><b>Join us at our upcoming <\/b><a href=\"https:\/\/www.intellectsoft.net\/blog\/webinar-digital-transformation-in-construction-thinking-one-step-ahead-april-23\/\"><b>Construction webinar hosted by industry top minds<\/b><\/a><b> on Thursday, April 23, at 12 p.m. Eastern time. <\/b><\/p>\n<\/blockquote>\n<p style=\"text-align: center;\"><a class=\"btn\" href=\"https:\/\/www.intellectsoft.net\/l\/29\/webinar-digital-transformation-in-construction\">Register for Webinar<\/a><\/p>\n<h2 id=\"hospitality\"><b>Hospitality<\/b><\/h2>\n<p>Hospitality is taking proactive financial steps to mitigate the huge impact. It’s obvious today, both revenue and supply chains will be affected the most. Hotels, restaurants, theme parks, cinemas all went silent. The entire disruptive effect of the hospitality industry will have a significant, tremendous impact on the global hospitality industry and economy. And there is a question hangs heavy in the air — can digital transformation in hospitality industry change the rule of the game?<\/p>\n<h3>Solutions<\/h3>\n<p>Despite this, hospitality shows its maturity level: in working together, showing their true hospitality commitments in helping out our society where they can. Technologies like artificial intelligence, big data, connected devices, virtual and augmented realities are shaping the hospitality industry as we speak.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19715\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-sleeveless-dress-sitting-on-chair-in-front-of-3755822-scaled.jpg\" alt=\"hospitality Covid\" width=\"2560\" height=\"1707\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-sleeveless-dress-sitting-on-chair-in-front-of-3755822-scaled.jpg 2560w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-sleeveless-dress-sitting-on-chair-in-front-of-3755822-300x200.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-sleeveless-dress-sitting-on-chair-in-front-of-3755822-1024x683.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-sleeveless-dress-sitting-on-chair-in-front-of-3755822-768x512.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-sleeveless-dress-sitting-on-chair-in-front-of-3755822-1536x1024.jpg 1536w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-sleeveless-dress-sitting-on-chair-in-front-of-3755822-2048x1365.jpg 2048w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-sleeveless-dress-sitting-on-chair-in-front-of-3755822-600x400.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-sleeveless-dress-sitting-on-chair-in-front-of-3755822-450x300.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-sleeveless-dress-sitting-on-chair-in-front-of-3755822-1000x667.jpg 1000w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" \/><\/p>\n<p>Only during the last two decades dozens of industry disruptors, such as Airbnb, Skyscanner, and TripAdvisor, have appeared on the market. Companies and organizations are expected to get out of the crisis more digitally mature, and those ones who find enough strength to focus on digitalization — are going to win the race. Here are some of the steps to consider today:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">“We may be apart, but we&#8217;ll get through this together,” <a href=\"https:\/\/www.airbnb.co.uk\/?_set_bev_on_new_domain=1538581578_Ju69Wm%2FOxIW8lBSY\" target=\"_blank\" rel=\"noopener noreferrer\">says Airbnb experts<\/a> introducing 50 new online experiences with unique activities for their customers. The home-sharing platform curates free online experiences to inspire people and stay afloat.<\/li>\n<\/ul>\n<ul>\n<li style=\"font-weight: 400;\">Digital transformation in the hospitality industry should now be focused on those that we know are available to travel. The dramatic rise in online gambling during COVID-19 lockdowns is one of the results of current circumstances. The online gambling industry is one of the winners of the current shutdown, and some offline casinos and other organizations can consider this as a potential opportunity for future growth.<\/li>\n<\/ul>\n<ul>\n<li style=\"font-weight: 400;\">Smart automation confidently moved into the industry through the Internet of Things technology. It has improved not only the convenience and comfort standards for clients but also reduced costs for businesses and organizations.<\/li>\n<\/ul>\n<ul>\n<li style=\"font-weight: 400;\">Robots that handle food preparation and delivery, predictive analytics, and cloud storage — are the next big moves for automation in the industry.<\/li>\n<\/ul>\n<p>While the COVID-19 shutdown has brought the industry to a standstill, it is also an opportunity for the companies to reevaluate their digital strategies and map out the right path ahead.<\/p>\n<h2><span style=\"color: #1476f2;\"><a style=\"color: #1476f2;\" href=\"https:\/\/www.intellectsoft.net\/platforms\/hospitality\"><b>Intellectsoft Digital Transformation in Hospitality<\/b><\/a><\/span><\/h2>\n<p>From ordering concierge services in one tap to booking golf courses in less than a minute, our expertise in the Hospitality industry has an extensive history. Despite COVID-19, consumers continue to demand improved solutions and unique experiences. However, today the lockdown hit a stop button for most of the industry players.<\/p>\n<p>During our long-term partnership with some of the key market players, we’ve witnessed that digital transformation remains one of the key drivers of industry growth today. Here are some of the solutions we’re proud to design for our clients:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">Turnkey solutions for the entire hotel;<\/li>\n<li style=\"font-weight: 400;\">Internet of Things ecosystem that connects all amenities and guest services;<\/li>\n<li style=\"font-weight: 400;\">Created an app that adapts to suit type;<\/li>\n<li style=\"font-weight: 400;\">Comprehensive IT audit for software systems;<\/li>\n<li style=\"font-weight: 400;\">Streamlined system, eliminating bugs, and making necessary improvements.<\/li>\n<\/ul>\n<h2 id=\"fintech\"><b>FinTech<\/b><\/h2>\n<p>Digital-only becomes the <a href=\"https:\/\/thefintechtimes.com\/new-research-illustrates-impact-of-covid-19-on-fintech-industry\/\" target=\"_blank\" rel=\"noopener noreferrer\">new industry norm<\/a> in financial services, greatly accelerating a trend that started in the last decade. Digital transformation in FinTech triggers a “Big Pocket” battle between incumbents and challengers to win the (newly) online customer. Financial Institutions turn to Tech companies rather than in-house solutions to accelerate digital transformation.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19714\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-shirt-using-a-printer-3766190-scaled.jpg\" alt=\"fintech crisis\" width=\"2560\" height=\"1707\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-shirt-using-a-printer-3766190-scaled.jpg 2560w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-shirt-using-a-printer-3766190-300x200.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-shirt-using-a-printer-3766190-1024x683.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-shirt-using-a-printer-3766190-768x512.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-shirt-using-a-printer-3766190-1536x1024.jpg 1536w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-shirt-using-a-printer-3766190-2048x1365.jpg 2048w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-shirt-using-a-printer-3766190-600x400.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-shirt-using-a-printer-3766190-450x300.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/woman-in-white-shirt-using-a-printer-3766190-1000x667.jpg 1000w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" \/><\/p>\n<h3>Digital Transformation in FinTech<\/h3>\n<p>FinTech sector winners:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">Consumer and SME lending platforms: best-adapting mechanism to swiftly and efficiently deliver capital to key segments of the economy;<\/li>\n<li style=\"font-weight: 400;\">Mortgage and life insurance digitalization: leaping forward with technology to disrupt the role of intermediaries, whose role was often face-to-face.<\/li>\n<\/ul>\n<p>FinTech&#8217; enablers&#8217; around AI, IoT, and software solutions are in high demand:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">AI: bots for call-centers; account-opening procedures; loan automation;<\/li>\n<li style=\"font-weight: 400;\">KYC: increased need for safe digital ID given volume of digital business transacted and robust solutions required for the protection of client assets.<\/li>\n<\/ul>\n<h2 id=\"sensing\">Sensing and Shaping the Post-COVID Era<\/h2>\n<p>Crisis often leads to changes. This time is no exception. The shifts in social attitudes and behaviors we see today pave the broad path to new opportunities and ways of living and working. Some of which is here to stay with us in the long run. Some of which disappear right after the crisis is gone.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-19716\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wwdw.png\" alt=\"crisis Covid\" width=\"1209\" height=\"550\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wwdw.png 1209w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wwdw-300x136.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wwdw-1024x466.png 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wwdw-768x349.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wwdw-600x273.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wwdw-450x205.png 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wwdw-1000x455.png 1000w\" sizes=\"(max-width: 1209px) 100vw, 1209px\" \/><\/p>\n<p style=\"text-align: center;\"><i>Crisis often leads to long-lasting changes. <\/i><a href=\"https:\/\/www.bcg.com\/publications\/2020\/8-ways-companies-can-shape-reality-post-covid-19.aspx\" target=\"_blank\" rel=\"noopener noreferrer\"><i>Source<\/i><\/a><i>: BCG Henderson Institute.<\/i><\/p>\n<p>Nevertheless, some changes show a positive dynamic. For example, we see a greater focus on crisis preparedness, system resilience, social inequality, social solidarity, and access to health care. These attitudinal shifts could, in turn, be reflected in significant policy shifts in many areas, including trade, border controls, health care, crisis preparedness, foreign affairs, employment, and social welfare.<\/p>\n<p>This pandemic shapes new social norms and drives new social rules that humanity should get prepared for starting today. We, at Intellectsoft, empower companies and their workforces with innovation services and approaches to help them survive during these times. Are you and your organization looking for some? <a href=\"https:\/\/www.intellectsoft.net\/contacts\"><b>Talk to our experts<\/b><\/a><b> and find out more about the topic and how your business can start benefiting from it today!<\/b><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The business impact of the COVID-19 outbreak on industries across the world is now profound. Leaders and CIOs should rev up their digital business strategies&#8230;<\/p>\n","protected":false},"author":63,"featured_media":19719,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[798,641,801,2,3,797,800,13],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"The business impact of the COVID-19 crisis on top industries across the world and how digital transformation reshapes their future.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/digital-disruption-the-industries-way-of-survival-during-the-covid-19-crisis\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"COVID-19: Top Industries&#039; Digital Transformation During Coronavirus Crisis\" \/>\n<meta property=\"og:description\" content=\"The business impact of the COVID-19 crisis on top industries across the world and how digital transformation reshapes their future.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/digital-disruption-the-industries-way-of-survival-during-the-covid-19-crisis\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2020-04-15T20:26:24+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-09-14T16:47:14+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/facebook_1200-630-6.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"630\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Twitter_1024_512-4.jpg\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/digital-disruption-the-industries-way-of-survival-during-the-covid-19-crisis\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/cover-blog_1430-600.jpg\",\"width\":1430,\"height\":600,\"caption\":\"disruption Covid cover\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/digital-disruption-the-industries-way-of-survival-during-the-covid-19-crisis\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/digital-disruption-the-industries-way-of-survival-during-the-covid-19-crisis\/\",\"name\":\"COVID-19: Top Industries' Digital Transformation During Coronavirus Crisis\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/digital-disruption-the-industries-way-of-survival-during-the-covid-19-crisis\/#primaryimage\"},\"datePublished\":\"2020-04-15T20:26:24+00:00\",\"dateModified\":\"2020-09-14T16:47:14+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\"},\"description\":\"The business impact of the COVID-19 crisis on top industries across the world and how digital transformation reshapes their future.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/digital-disruption-the-industries-way-of-survival-during-the-covid-19-crisis\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\",\"name\":\"Anastasiia Hibaieva\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5e777493cd8ae0902fee5b35c44765ce?s=96&d=mm&r=g\",\"caption\":\"Anastasiia Hibaieva\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/19707"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/63"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=19707"}],"version-history":[{"count":1,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/19707\/revisions"}],"predecessor-version":[{"id":21791,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/19707\/revisions\/21791"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/19719"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=19707"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=19707"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=19707"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}