{"id":20517,"date":"2020-06-03T18:28:58","date_gmt":"2020-06-03T15:28:58","guid":{"rendered":"https:\/\/www.intellectsoft.net\/blog\/?p=20517"},"modified":"2020-06-16T16:29:39","modified_gmt":"2020-06-16T13:29:39","slug":"making-sense-of-stablecoins-core-functions-and-characteristics","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/making-sense-of-stablecoins-core-functions-and-characteristics\/","title":{"rendered":"Making Sense of Stablecoins: Core Functions and Characteristics"},"content":{"rendered":"<p>Stablecoins represent cryptocurrencies that seek to minimize their price volatility. In this light, stablecoins are significantly different from other <a href=\"https:\/\/blockchain.intellectsoft.net\/blog\/cryptocurrency-development-and-types-of-cryptocurrencies\/\" target=\"_blank\" rel=\"noopener noreferrer\">virtual currencies<\/a>, including bitcoin. The latter lacks the implemented stability mechanism. The volatility of the cryptocurrencies was amongst the main factors limiting its potential as an alternative digital cash target in the past. Thus, the appearance of stablecoins could contribute to an increasing interest from retail investors across the globe. But first, let’s find their place in the world monetary hierarchy.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-20522\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image5-6.png\" alt=\"Money Trees Stablecoins\" width=\"881\" height=\"519\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image5-6.png 881w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image5-6-300x177.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image5-6-768x452.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image5-6-600x353.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image5-6-450x265.png 450w\" sizes=\"(max-width: 881px) 100vw, 881px\" \/><\/p>\n<p style=\"text-align: center;\"><i>Source: the IMF report<\/i><\/p>\n<p>According to the IMF terminology, money has two types: claim- and object-based. While <a href=\"https:\/\/blockchain.intellectsoft.net\/blog\/bitcoin-and-ethereum-blockchains-beginners-guide\/\" target=\"_blank\" rel=\"noopener noreferrer\">bitcoin<\/a> is considered an object with the “other” value, most stablecoins fall into the claim category with fixed value redemptions. Moreover, they are private decentralized “e-money.” Fundamentally, e-money shares characteristics of constant net asset value (CNAV) funds, which also means that customers will at least get their money back in exchange for a stablecoin. The question is, why did they emerge in the first place?<\/p>\n<h2>Market Overview<\/h2>\n<p>Stablecoins comprise 4% of the total market value of cryptoassets, which amounts to approximately $11 billion <a href=\"https:\/\/stablecoinindex.com\/marketcap\" target=\"_blank\" rel=\"noopener noreferrer\">as of late May <\/a>2020. Since the Black Thursday on March 12th <a href=\"https:\/\/www.intellectsoft.net\/blog\/state-of-cryptocurrencies-in-2020-post-pandemic-report\/\" target=\"_blank\" rel=\"noopener noreferrer\">when cryptocurrencies collapsed in tandem with the markets<\/a>, the market supply of these assets has risen by 40%. At least 50 prominent exchanges have listed stablecoins, including Tether (USDT), SteemDollar (SBD), Paxos (PAX), Gemini (GUSD), USD Coin (USDC) and Stasis (EURS). The importance of their current role to the digital assets ecosystem is hard to underestimate: they stimulate the broader distribution of cryptoassets by early adopters within the IT sector and the rank-and-file users worldwide.<\/p>\n<p style=\"text-align: center;\"><b>The Current Stablecoin Market<\/b><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-20521\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image4-6.png\" alt=\"Current Stablecoin Market\" width=\"1238\" height=\"452\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image4-6.png 1238w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image4-6-300x110.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image4-6-1024x374.png 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image4-6-768x280.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image4-6-600x219.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image4-6-450x164.png 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image4-6-1000x365.png 1000w\" sizes=\"(max-width: 1238px) 100vw, 1238px\" \/><\/p>\n<p style=\"text-align: center;\"><i>Note: USDT is represented by 3 graphs ($9.2 billion in total)<\/i><\/p>\n<p style=\"text-align: center;\"><i>Source: coinmetrics.io<\/i><\/p>\n<p>Despite its <a href=\"https:\/\/cointelegraph.com\/explained\/tether-case-explained\" target=\"_blank\" rel=\"noopener noreferrer\">imperfect history<\/a>, Tether (USDT) is the most actively traded cryptocurrency with the daily volume equivalent to 120% of the BTC trading value. As of June 2020, it has the third-largest market capitalization ($9.2 billion). Tether also dominates the listed trading pairs for stablecoins, reaching 150+ different cryptocurrencies trading against it.<\/p>\n<p>The design of stablecoins commonly implies anchoring their value to the US dollar. At the same time, such anchoring does not completely remove the volatility of the stablecoin. For instance, the exchange rate of USDT has been fluctuating between $1.00 and $1.30, following the achievement of the $1.00 mark.<\/p>\n<p style=\"text-align: center;\"><b>USDT Market Value and Exchange Rate<\/b><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-20518\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image1-6.png\" alt=\"USDT Market Value and Exchange Rate\" width=\"1181\" height=\"483\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image1-6.png 1181w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image1-6-300x123.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image1-6-1024x419.png 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image1-6-768x314.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image1-6-600x245.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image1-6-450x184.png 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image1-6-1000x409.png 1000w\" sizes=\"(max-width: 1181px) 100vw, 1181px\" \/><\/p>\n<p style=\"text-align: center;\"><i>Source: Blockchain.com, the State of Stablecoins<\/i><\/p>\n<p>In addition to USD anchoring, stablecoins also use baskets of the other fiat currencies, economic measures, as well as the commodities for ensuring the stability of the coin. Therefore, the users of stablecoins can benefit from advantages offered with the blockchain-based cryptoassets, including low costs and high speed of transactions, while also minimizing the risks related to volatility.<\/p>\n<h2>Types of Stablecoins<\/h2>\n<p>There are three general types of stablecoins:<\/p>\n<ul>\n<li style=\"font-weight: 400;\"><b>Asset-based <\/b>stablecoins commonly use fiat currencies or precious metals as a peg to ensure stability. For example, <a href=\"https:\/\/digix.global\/\" target=\"_blank\" rel=\"noopener noreferrer\">Digix<\/a> Gold Token (DGX) uses gold for its backing while <a href=\"https:\/\/www.novi.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Libra<\/a> and <a href=\"https:\/\/reserve.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">Reserve<\/a> were designed to rely on a basket of currencies.<\/li>\n<li style=\"font-weight: 400;\"><b>Crypto-collateralized<\/b>: <a href=\"https:\/\/makerdao.com\/en\/\" target=\"_blank\" rel=\"noopener noreferrer\">Maker<\/a> Dai (DAI) remains the largest cryptocurrency-collateralized stablecoin. The two cryptocurrencies backing DAI are ETH and MKR. Dai also uses smart contracts to ensure timely response to the main market tendencies in terms of changes in the demand and supply levels.<\/li>\n<li style=\"font-weight: 400;\"><b>Algorithmic<\/b> stablecoins rely on the rules written in the software code of the coin with the sole goal of matching the demand for the currency and its market supply. Kowala and Ampleforth are examples of non-collateralized or algorithmic stablecoins. Their mechanisms automatically adjust the levels of the supply, effectively ensuring stability.<\/li>\n<\/ul>\n<p style=\"text-align: center;\"><b>Taxonomy of the Main Stablecoin Types<\/b><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-20519\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image2-6.png\" alt=\"Taxonomy of the Main Stablecoin Types\" width=\"1119\" height=\"378\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image2-6.png 1119w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image2-6-300x101.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image2-6-1024x346.png 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image2-6-768x259.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image2-6-600x203.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image2-6-450x152.png 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image2-6-1000x338.png 1000w\" sizes=\"(max-width: 1119px) 100vw, 1119px\" \/><\/p>\n<p style=\"text-align: center;\"><i>Source: Blockchain.com, the State of Stablecoins<\/i><\/p>\n<h2>The Promise of Stablecoins: Use Cases<\/h2>\n<p>Stablecoins serve various purposes and functions, depending on their specific areas of applications and the parties utilizing them.<\/p>\n<ol>\n<li style=\"font-weight: 400;\"><b>Medium of Exchange<\/b>. Stablecoins enable further adoption of cryptocurrencies by the traditional businesses while minimizing the risks related to their volatility. The operations of the firm’s treasuries become more convenient with the added level of predictability, and it’s just easier to move such currency across borders.<\/li>\n<li style=\"font-weight: 400;\"><b>Unit of Account.<\/b> Pricing in stablecoins will become possible with the pegging mechanism. Such an approach may become an independent unit of account over time across the globe. Examples include a basket of currencies to have a representative global currency, or a fixed amount of a desirable subject: time, minerals, water.<\/li>\n<li style=\"font-weight: 400;\"><b>Store of Value<\/b>. Stablecoins are becoming the store of value over the longer period because of the lower associated volatility levels. In this light, stablecoins are also providing easier and more secure access to the commonly used store-of-value items, such as commodities, currencies, and assets. Additionally, stablecoins can win the loyalty of depositors, where banks start adding a negative interest.<\/li>\n<li style=\"font-weight: 400;\"><b>Remittance<\/b>. The processing of payments in cryptocurrencies implies a certain degree of volatility risks, which are currently mitigated through the utilization of stablecoins. Such an approach will also lower the costs whereas increasing the speed of the international transactions.<\/li>\n<li style=\"font-weight: 400;\"><b>Lending and derivatives<\/b>. Stablecoins enhance the process of hedging volatility risks by removing the need for centralized entities, still existing on CME and CBOE.<\/li>\n<li style=\"font-weight: 400;\"><b>Decentralized Applications (dApps)<\/b>. Stablecoins lower the role of cryptocurrencies in speculative transactions, effectively minimizing the risks related to holding funds in cryptoassets. Therefore, if a business runs smart contracts, the operation costs will become predictable and the infrastructure management easier.<\/li>\n<li style=\"font-weight: 400;\"><b>Performance measurement<\/b>. Stablecoins increase the accuracy related to financial performance valuation by removing volatility. Therefore, it is possible for the internal and external analysts to evaluate the performance of the projects, while also comparing them over time.<\/li>\n<\/ol>\n<h2>Stablecoin Business: How These Projects Make Money<\/h2>\n<p>The largest stablecoin is Tether, followed by TrueUSD at $137 million. Stablecoins are a part of 50+ exchanges with Tether representing the largest number of listings. The question of making money in these projects remains open. The key approaches of generating returns include their issuance and purchase. Often than not, stablecoins practice<b> fractional reserve banking<\/b>, meaning they do not represent 100% of the value as they claim. Other  lucrative methods include:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">the issuance and redemption fees<\/li>\n<li style=\"font-weight: 400;\">market-making activities, namely bid\/ask spread and trading volume<\/li>\n<li style=\"font-weight: 400;\">a short-term lending<\/li>\n<li style=\"font-weight: 400;\">an annual reserve interest<\/li>\n<\/ul>\n<p>However, other reasons can be branding and fund protection. Companies developing a stablecoin may want to create a safe virtual currency to pay their developers seamlessly. Furthermore, they aim to avoid losing money over time or attract users to other products in their portfolio, which is a vivid case of exchanges like Huobi, Binance and Coinbase.<\/p>\n<p>The investors purchasing stablecoins may use them to diversify their portfolio and preserve the capital during the bear market. The entities purchasing stablecoins may also generate return during the periods of small fluctuations.<\/p>\n<h2>The Most Successful SC Projects<\/h2>\n<p>Stablecoins have already become an essential part of various successful projects. DAI came to mobile ATMs as a result of the partnership project involving Tether and MakerDAO. ERC20 stablecoins are available for holding and transferring between the Etherum wallet holders. Below are details on these and other successful projects.<\/p>\n<h3>Tether (USDT)<\/h3>\n<p>Teather is the oldest stablecoin that continues rising within the top-5 cryptocurrency ratings. The market capitalization of the coin has increased from $7 million in 2017 to $9 billion in spring 2020. The core issue of the stablecoin is a comparatively low level of transparency and centralized nature, which resulted in <a href=\"https:\/\/cryptoslate.com\/tether-and-bitfinex-confirm-usdt-is-not-fully-backed-by-fiat-only-74-of-tethers-backed-with-cash\/\" target=\"_blank\" rel=\"noopener noreferrer\">a series of scandals<\/a>.<\/p>\n<h3>TrueUSD (TUSD)<\/h3>\n<p>The TUSD is similar to USDT by using USD as an anchoring mechanism. The collateral of the project remains in the escrow accounts managed by third parties. The status of the second-largest stable token has contributed to its current success.<\/p>\n<h3>Dai (DAI)<\/h3>\n<p>Dai is a stablecoin that adjusts to the value of the US dollar. Issued via the Maker (MKR), Dai Stablecoin System leverages margin trading to respond to volatile market conditions and preserve its value. ETH is the backing instrument of DAI with a high level of complexity. DAI is a part of 20+ exchanges and 17 cryptocurrency pairs. The four stability parameters related to DAI price include:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">target price<\/li>\n<li style=\"font-weight: 400;\">target rate feedback mechanism<\/li>\n<li style=\"font-weight: 400;\">global settlement<\/li>\n<li style=\"font-weight: 400;\">the sensitivity parameter<\/li>\n<\/ul>\n<h3>Reserve (RSV)<\/h3>\n<p>Reserve is a stablecoin aimed to become a universal store of value and backed by numerous investors, including Coinbase Ventures. Like Dai, it has a triple structure:<\/p>\n<ol>\n<li style=\"font-weight: 400;\">The Reserve token (RSV), a major asset for daily transactions.<\/li>\n<li style=\"font-weight: 400;\">The Reserve Rights token (RSR) — a cryptocurrency meant to ensure the stability of the Reserve token.<\/li>\n<li style=\"font-weight: 400;\">Collateral tokens; they will be other assets to be held by the Reserve smart contract for protecting the Reserve token value.<\/li>\n<\/ol>\n<p>Notably, the Reserve project is divided into three development stages. The centralized stage implies a period for which Reserve is backed by a small number of collateral tokens pegged to the US dollar. The second, decentralized stage, will change the Reserve’s basket of assets but still be stabilized in regard to USD. The final stage, a so-called “independent phase,” is when RSV is no longer pegged to the US dollar and intends to stabilize its “real purchasing power regardless of fluctuations in the value of the dollar.”<\/p>\n<p style=\"text-align: center;\"><b>Stablecoin Launch Timeline<\/b><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-20520\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image3-7.png\" alt=\"Stablecoin Launch Timeline\" width=\"1020\" height=\"481\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image3-7.png 1020w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image3-7-300x141.png 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image3-7-768x362.png 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image3-7-600x283.png 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image3-7-450x212.png 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/image3-7-1000x472.png 1000w\" sizes=\"(max-width: 1020px) 100vw, 1020px\" \/><\/p>\n<p style=\"text-align: center;\"><i>Source: Blockchain.com research<\/i><\/p>\n<h2>Future Outlook<\/h2>\n<p>Stablecoins have been gaining popularity with the number of cryptocurrencies growing at an exponential rate. Given the success rate and the depth of their infrastructure, the stablecoins will continue their inevitable integration. Automation and transparency will be the main desired characteristics of stablecoins in the future, given their current centralized state.<\/p>\n<p>Notably, we started gathering information for this report one year ago. In spite of their promising developments, here are updates on the most ambitious projects.<\/p>\n<h3>Gram<\/h3>\n<p>Telegram had announced the launch of its own token Gram, which by design is particularly similar to stablecoin. <a href=\"https:\/\/blockchain.intellectsoft.net\/blog\/telegrams-ico-all-you-need-to-know-in-under-5-minutes\/\" target=\"_blank\" rel=\"noopener noreferrer\">Telegram Open Network or TON<\/a> was intended to run on Gram and has raised the company over $1.7 billion for the development. The TON Reserve (controlled by the TON Foundation) would have issued each new GRAM token to ensure its stability and liquidity. Nevertheless, the project came under pressure from SEC and, as a result, its founder Pavel Durov announced that <a href=\"https:\/\/techcrunch.com\/2020\/05\/12\/telegram-abandons-its-ton-blockchain-platform\/\" target=\"_blank\" rel=\"noopener noreferrer\">Telegram abandoned TON<\/a>.<\/p>\n<h3>Libra<\/h3>\n<p><a href=\"https:\/\/blockchain.intellectsoft.net\/blog\/libra-cryptocurrency-by-facebook-facts-myths-and-hopes\/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook continues working on Libra<\/a> as its “cryptocurrency” project. It is a name for both a protocol and association of partners who govern the project. Its token, Libra, was intended to be a stablecoin pegged to a basket of currencies and precious metals, referred to as Libra Reserve. According to Facebook, 50% of the Libra’s reserve had to be backed by USD, the euro (EUR) would make up to 18%, the Japanese yen (JPY) 14%, the British sterling pound (GBP) 11%, and the Singapore dollar (SGD) 7%.<\/p>\n<p>However, everything changed after the US Congress saw a potential threat to the global financial system. They feared that a private company would compete with central banks worldwide and forced Facebook into rebranding the project and making several versions of Libra token: a simple stablecoin for dollar, euro and other fiat currency transactions.<\/p>\n<p>Initially, there was Calibra, a subsidiary company of the social network that developed the blockchain project. Together with other 27 organizations plus Facebook, it formed the Libra association. Unfortunately, several members of this governing body (PayPal, eBay, Visa, MasterCard, Mercado Pago) rapidly cut the links with Libra when the government warned Zuckerberg of developing an “alternative currency.” Last month, Calibra became Novi, and the project transitioned from permissionless to permissioned network. Ironically, there is no Facebook logo among the current members of the Libra Association.<\/p>\n<h3>JPM Coin<\/h3>\n<p>In fact, tech corporations are not the only ones to enter the game. One of the biggest banks, JPMorgan, has announced its own stablecoin, the JPM Coin. It is said to have revolutionized the “antiquated and wholly inadequate Swift payment system” and is a permissioned blockchain for international bank-to-bank payments.<\/p>\n<p>However, critics argue it is a simple upgrade of the Wall Street’s back-office run on Quorum protocol. Even so, the bank has just <a href=\"https:\/\/www.forbes.com\/sites\/billybambrough\/2020\/05\/30\/jp-morgan-bitcoins-biggest-enemy-suddenly-appears-to-be-going-all-in-on-crypto\/#482eec0b23a6\" target=\"_blank\" rel=\"noopener noreferrer\">signed Gemini and Coinbase<\/a> as institutional customers and started to expand its own “<a href=\"https:\/\/www.ledgerinsights.com\/jp-morgan-blockchain-hiring-jpm-coin-iin\/\" target=\"_blank\" rel=\"noopener noreferrer\">Coin and Clearing Networks<\/a> (CCN)” division.<\/p>\n<h3>State-supported Stablecoin<\/h3>\n<p>The governments are considering launching their stablecoins too. The Bank for International Settlements (BIS) has <a href=\"https:\/\/www.coindesk.com\/central-banks-may-issue-digital-currencies-sooner-than-we-think-bis-chief\" target=\"_blank\" rel=\"noopener noreferrer\">announced<\/a> its plan to release a stablecoin. Furthermore, the two largest parties of Germany, the Christian Democratic Union of Germany (CDU) and Christian Social Union in Bavaria (CSU) were <a href=\"https:\/\/cointelegraph.com\/news\/germany-cdu-and-csu-union-to-integrate-blockchain-into-public-services\" target=\"_blank\" rel=\"noopener noreferrer\">supporting<\/a> the launch of stablecoin.<\/p>\n<p>Not least, central banks in some countries partner with e-money providers to effectively provide “central bank digital currency (CBDC),” a digital version of cash authorized by governments. The topic became especially popular amid rising discussions on distribution of Covid-19 relief funds and the potential of universal basic income (UBI).<\/p>\n<p>Although institutions are insisting on regulation by the central banks, there is an intriguing shift in the political and financial paradigms. Possibly, we are going to witness real-time economy driven algorithmic stablecoin based on the GDP and other indices. Startups and enterprises that can foresee this opportunity early will benefit the most.<\/p>\n<p>In addition, it will be essential for stablecoins to lower the degree of complexity relative to their design features. Further development of stablecoins will depend on the pacing of the monetary innovation, as well as adoption of the cryptoassets.<\/p>\n<h2>Summary<\/h2>\n<p>Stablecoins are the cryptocurrencies offering protection against price volatility. Such stability is possible through pegging against fiat currencies, assets, cryptocurrencies, as well as utilization of algorithms. The main drawback of stablecoins is their centralized nature, involving risks associated with the changes in the value of the hedging instruments. Tether (USDT) is the largest stablecoin based on market value. Stablecoin will remain essential for the general cryptoasset ecosystem and the financial landscape in the future.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Stablecoins represent cryptocurrencies that seek to minimize their price volatility. In this light, stablecoins are significantly different from other virtual currencies, including bitcoin. The latter&#8230;<\/p>\n","protected":false},"author":61,"featured_media":20523,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[801,3,13],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"Users of stablecoins can benefit from advantages offered with the blockchain-based cryptoassets, including low costs and high speed of transactions.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/making-sense-of-stablecoins-core-functions-and-characteristics\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Stablecoins: Core Functions and Characteristics 2020\" \/>\n<meta property=\"og:description\" content=\"Users of stablecoins can benefit from advantages offered with the blockchain-based cryptoassets, including low costs and high speed of transactions.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/making-sense-of-stablecoins-core-functions-and-characteristics\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2020-06-03T15:28:58+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-16T13:29:39+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/facebook_1200-630-18.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"630\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Twitter_1024_512-17.jpg\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/making-sense-of-stablecoins-core-functions-and-characteristics\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/1430-600-5.jpg\",\"width\":1430,\"height\":600,\"caption\":\"Stablecoins\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/making-sense-of-stablecoins-core-functions-and-characteristics\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/making-sense-of-stablecoins-core-functions-and-characteristics\/\",\"name\":\"Stablecoins: Core Functions and Characteristics 2020\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/making-sense-of-stablecoins-core-functions-and-characteristics\/#primaryimage\"},\"datePublished\":\"2020-06-03T15:28:58+00:00\",\"dateModified\":\"2020-06-16T13:29:39+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/d8dce743156f4ef27e9a737909c8608f\"},\"description\":\"Users of stablecoins can benefit from advantages offered with the blockchain-based cryptoassets, including low costs and high speed of transactions.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/making-sense-of-stablecoins-core-functions-and-characteristics\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/d8dce743156f4ef27e9a737909c8608f\",\"name\":\"Timothy Kozak\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/2bafc29023478c3634aff3a0c884ba6e?s=96&d=mm&r=g\",\"caption\":\"Timothy Kozak\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/20517"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=20517"}],"version-history":[{"count":0,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/20517\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/20523"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=20517"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=20517"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=20517"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}