{"id":2779,"date":"2016-07-15T18:58:24","date_gmt":"2016-07-15T17:58:24","guid":{"rendered":"https:\/\/www.intellectsoft.net\/blog\/?p=2779"},"modified":"2017-08-01T11:33:56","modified_gmt":"2017-08-01T08:33:56","slug":"your-guide-to-user-acquisition-advanced-user-acquisition-on-a-budget-chapter-3","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/your-guide-to-user-acquisition-advanced-user-acquisition-on-a-budget-chapter-3\/","title":{"rendered":"Your Guide to User Acquisition &#8212; Advanced User Acquisition on a Budget [Chapter 3]"},"content":{"rendered":"<p><i><span style=\"font-weight: 400;\"> The following is an excerpt from Chapter 3 of our upcoming comprehensive guide, “User Acquisition Explained: A Cost-Effective Strategy for Finding the Audience Your App Deserves”. Here we explore the value of content marketing and how to gain new users on a limited budget. [<\/span><\/i><a href=\"https:\/\/www.intellectsoft.net\/blog\/product-positioning-user-acquisition\"><i><span style=\"font-weight: 400;\">Chapter 1<\/span><\/i><\/a><i><span style=\"font-weight: 400;\">, <\/span><\/i><a href=\"https:\/\/www.intellectsoft.net\/blog\/your-guide-to-user-acquisition-user-acquisition-essentials-chapter-2\"><i><span style=\"font-weight: 400;\">Chapter 2<\/span><\/i><\/a><i><span style=\"font-weight: 400;\">]<\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">Consider the blueprint discussed in Chapter 2 your entrance fee to the real mobile app marketplace. It lets you bypass a long line of pretenders and open the door to a more exclusive club. Once inside, however, additional investments will be required to attract VIP attention. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The good news is not all investments need to be monetary. Subtle development tricks and savvy marketing strategies can serve as alternative currencies for anyone willing to put in the time. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Whether you’re a cash-strapped <a href=\"https:\/\/www.intellectsoft.net\/services\/startups\" target=\"_blank\" rel=\"noopener\">startup<\/a> or simply a budget-conscious company, the following techniques are all worth a look. But there will be no more blueprints from here on out. At this stage of the game, you need to pick and choose which strategies match your time, budget, and talent profiles. <\/span><\/p>\n<h3><b>Build a Better Welcome Mat<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">First impressions are shaped in an instant in the digital world. Approximately one out of every five users will <\/span><a href=\"https:\/\/info.localytics.com\/blog\/app-user-retention-improves-in-the-us\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">abandon an app after just one visit<\/span><\/a><span style=\"font-weight: 400;\">, so your onboarding experience needs to be flawless.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you do require immediate user registration, your first priority is making it unavoidably <a href=\"https:\/\/www.intellectsoft.net\/services\/design-lab\" target=\"_blank\" rel=\"noopener\">easy for users<\/a> to sign up and sign into your app. That means dropping unnecessary buttons, text, and form fields in favor of faster alternatives like one-tap social sign-on. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Continuing with the theme of simplicity, limit user choice early on and present only a few clear options for how to proceed. Embedding a brief, three-to-five screen tutorial is a great way to remind users of what your primary value proposition is and how they can access it. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you really do need to include more elaborate onboarding elements, consider employing gamification elements that reward users for their attention and interaction.<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">The <a href=\"https:\/\/www.intellectsoft.net\/solutions\/finance-banking\" target=\"_blank\" rel=\"noopener\">investment app<\/a> Wealthfront, for example, requires users to answer a series of screening questions in order to provide a more relevant, personalized experience moving forward. To make this process less painful, the app focuses on multiple-choice questions and displays a progress bar that reassures users that they’re nearing a finish line.<\/span><\/p>\n<h3><b>Make Referrals Easy<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">When people say that an app “went viral,” what they really mean is that an app “experienced rapid user growth as a result of word-of-mouth marketing.”        <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Two-word explanations are better than 12-word explanations, so it’s understandable why the first phrase took off. But it’s important to acknowledge what the second phrase is saying: <\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">Virality is not a random, mysterious occurrence.<\/span><\/i> <i><span style=\"font-weight: 400;\">In reality, it’s as quantifiable as any other marketing attribute.<\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">The most obvious viral metric to start with is referrals. According to Facebook, referrals from friends or family are responsible for 36% of all app discoveries. As a developer, there are several reliable ways to get your users in a giving mood:   <\/span><\/p>\n<ol>\n<li><b><b>Social Sign-In. <\/b><span style=\"font-weight: 400;\">App activity can be shared in social media feeds, raising your brand awareness within your user’s networks.<\/span><\/b><\/li>\n<li><b>Social Sharing Icons. <\/b><span style=\"font-weight: 400;\">Less intrusive than social sign-in, but also a great way for users to selectively share their app accomplishments and activities with friends and family.  <\/span><\/li>\n<li><b>Direct Invites.<\/b><span style=\"font-weight: 400;\"> Messages received via text or email from a close contact tend to have higher authority and are often more convincing.<\/span><\/li>\n<li><b>Incentivized Referrals. <\/b><span style=\"font-weight: 400;\">Discount codes or similar freebies provide users with a clear and immediate value in exchange for their app advocacy.<\/span><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">By baking these mechanisms into the fabric of <a href=\"https:\/\/www.intellectsoft.net\/services\/mobile-development\" target=\"_blank\" rel=\"noopener\">app functionality<\/a> you can effectively recruit an army of marketers with little to no monetary investment. Just make sure users actually have a chance to explore and enjoy your app first. Otherwise, greedy referral requests could send users running in the opposite direction.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-2785\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/shutterstock_345883100-1024x683.jpg\" alt=\"shutterstock_345883100\" width=\"604\" height=\"403\" \/><\/p>\n<h3><b>Don’t Be Shy About Reviews <\/b><\/h3>\n<p><span style=\"font-weight: 400;\">Ratings are a primary variable in app store ranking algorithms, and they also happen to be where most users first look when scanning their search results. This can be great news for underdog developers.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">No matter how much name recognition or financial resources your competition has working in their favor, they still need to put out a quality product. If they don’t, they’ll risk drowning in a flood of one- and two-star reviews.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The <\/span><i><span style=\"font-weight: 400;\">sentiment<\/span><\/i><span style=\"font-weight: 400;\"> of app user reviews isn’t the only factor here, however. In fact, <\/span><a href=\"https:\/\/moz.com\/blog\/app-store-rankings-formula-deconstructed-in-5-mad-science-experiments\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">growing evidence<\/span><\/a><span style=\"font-weight: 400;\"> suggests that the <\/span><i><span style=\"font-weight: 400;\">volume<\/span><\/i><span style=\"font-weight: 400;\"> of reviews may ultimately be more important. But regardless of whether ranking algorithms can ever be fully understood, a healthy number of positive reviews can only be good for business.<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">The trouble is, the average app user has little interest in submitting <\/span><i><span style=\"font-weight: 400;\">any<\/span><\/i><span style=\"font-weight: 400;\"> app reviews. In fact, approximately <\/span><span style=\"font-weight: 400;\">two-thirds of apps<\/span><span style=\"font-weight: 400;\"> sitting in the iTunes Store have failed to attract a single one. So consider it your responsibility to start the conversation.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">There are plenty of options out there for how to style<br \/>\nyour message, but how you prompt users is far more important. A few of the golden rules for in-app pop-ups include:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">DO let users explore the app before requesting any favors (&gt; 5 sessions)<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">DON’T interrupt users in the middle of an activity<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">DO capitalize on satisfying moments like task completion<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">DON’T talk like a robot or badger like a spammer<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">DO provide clear and simple options for users to select<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Among a certain portion of <a href=\"https:\/\/www.intellectsoft.net\/services\/mobile-development\" target=\"_blank\" rel=\"noopener\">mobile app<\/a> users, however, anything resembling a traditional rating request will automatically be dismissed. As a result, more publishers are prioritizing user feedback loops instead. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Media app Circa News, for example, seeks reviews by initially asking users if they are enjoying their experience. If the user replies positively, only then are they asked to rate the app. If the user replies negatively, they are asked whether they would be willing to submit feedback to Circa instead.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This is brilliant in two ways. First, the decision flow makes it easy for happy users to write app store reviews and harder for disappointed users to do the same. Second, it gives Circa an opportunity to rescue bad experiences while simultaneously gaining perspective that will help prevent future disappointments.  <\/span><\/p>\n<h3><b>Target Digital Hotspots<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">Some days, the fisherman pulls one net into shore and is blessed with a bounty. Some days, he needs five nets to secure his daily catch. Other days, he needs to wade into the water with a spear just to fill his dinner plate.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A smart user acquisition plan accounts for that last <a href=\"https:\/\/www.intellectsoft.net\/services\/product-strategy\" target=\"_blank\" rel=\"noopener\">strategy<\/a> as well as the first two. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can’t always sit back and wait for your inbound nets to fill up. Like the hungry fisherman, you need to proactively go to the places you know your fish are swimming.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The specific digital watering holes you choose will vary depending on your audience demographics and interests, but here are a few destinations any <a href=\"https:\/\/www.intellectsoft.net\/\">app developer<\/a> would be wise to consider:<\/span><\/p>\n<ol>\n<li><b><b>BetaList &#8211; <\/b><span style=\"font-weight: 400;\">Submit your app to get valuable feedback from early adopters, fellow founders, and experienced investors.  <\/span><\/b><\/li>\n<li><b>AngelList &#8211; <\/b><span style=\"font-weight: 400;\">Announce your app to an audience of venture capitalist veterans who carefully curate a list of trending tech startups.  <\/span><\/li>\n<li><b>Startup Digest &#8211; <\/b><span style=\"font-weight: 400;\">Get your name in this insider newsletter and it will start echoing in all the right places.<\/span><\/li>\n<li><b>Quora &#8211; <\/b><span style=\"font-weight: 400;\">Share your expertise and boost brand recognition by consistently answering burning questions in your target industry. <\/span><\/li>\n<li><b>Slideshare &#8211; <\/b><span style=\"font-weight: 400;\">Increase authority by sharing your knowledge on a presentation platform that attracts 70 million global users.<\/span><\/li>\n<li><b>HARO &#8211; <\/b><span style=\"font-weight: 400;\">Help journalists in need of industry sources and get free press in the process.<\/span><\/li>\n<li><b>Product Hunt &#8211; <\/b><span style=\"font-weight: 400;\">Get featured by this tech tastemaker and never worry about awareness again.<\/span><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">The destinations and directories vary on price, authority, and admission requirements, so it’s often best to hedge your bets on a few different options. The good news is you already have all the bait you need. Take a look at the assets in your Press Kit and simply adapt your pitch or presentation to the customs of the platform.<\/span><\/p>\n<h3><b>Log Off, Meet Up<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">We also need to talk about perhaps the most important litmus test for your user acquisition skills: real-world events. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Yes. Even in our decidedly <a href=\"https:\/\/www.intellectsoft.net\/services\/big-data-analytics\" target=\"_blank\" rel=\"noopener\">digital industry<\/a>, making offline connections still matters. There’s no substitute for assembling a live audience and illustrating the magic of your app in the moment.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Taking a look back at your user personas will give you an idea of where your audience spends their time. If there’s a relevant industry event they flock to, mark it on your calendar. If there’s a local business that seems like a fit, propose something fun for the two of you to sponsor. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If all else fails, you’ll surely be able to find an entrepreneur and\/or tech developer meetup group in your area. Even if the attendees don’t fit your ideal user profile, they’ll still be happy to share their candid opinions with fellow creators. <\/span><\/p>\n<h3><b>Get In With The Influencers<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">Some days, that fisherman we talked about earlier gets tired of exerting so much effort and starts thinking about even more efficient methods of cornering the market. Then eventually a brilliant idea hits him: study the big fish that everyone else in the bay seems to follow.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For you, his app publishing counterpart, that means identifying and building relationships with a few of the influencers in your niche. Social media will be instrumental in each task.<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">Shares, favorites, and follower counts are the easiest indicators of who exactly you should start studying, but tools like BuzzSumo and MuckRack can help if you’re struggling to build a list. Once you have some key players in view, study their habits for a week just to see what you find. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">What do they post? Who do they reply to? When are they most active? If you look closely, these “tribal leaders” can clue you into exactly what your broader target audience is currently thinking about.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">After you’re fairly confident that you understand their customs, it’s time to make contact. It could be something as simple as a blog comment or a Twitter mention. Just do yourself a favor and keep your sales pitch on the shelf for now.<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">Only after you’re consistently making small but meaningful contributions to the conversation can you think about taking things to the next level.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Go ahead and pitch them an exclusive preview of your app and see if they would be willing to provide their feedback. There are no guarantees that anyone will take the bait, but don’t let that stop you. You need to give before you can get. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If there is genuine interest on their part, follow up as quickly as you can. Even if all they offer is their private opinion, you’ll still gain valuable insights that could inform future strategies. And if they are excited enough to make a public endorsement, your acquisition net just might overflow.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-2784\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/shutterstock_272752487-1024x691.jpg\" alt=\"shutterstock_272752487\" width=\"604\" height=\"408\" \/><\/p>\n<h3><b>Start Your Content Marketing Machine<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">Most of the tactics listed above are designed to deliver results quickly or not at all. But in between placing bets on potential big wins, you also need to play the long game.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For the budget-conscious app publisher, that means much of your most abundant resource (pronounced: “time”) should be spent creating valuable content for users. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It designed appropriately, this content can:<\/span><\/p>\n<ol>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Increase acquisition rates by boosting <\/span><span style=\"font-weight: 400;\">SEO rankings<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Increase <\/span><span style=\"font-weight: 400;\">conversion rates<\/span><span style=\"font-weight: 400;\"> by addressing user problems and previewing solutions<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Increase <\/span><span style=\"font-weight: 400;\">referral rates<\/span><span style=\"font-weight: 400;\"> by inspiring social media shares <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Increase <\/span><span style=\"font-weight: 400;\">retention rates<\/span><span style=\"font-weight: 400;\"> by educating users on advanced features<\/span><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">Before you start publishing, however, the first thing to do is refer back to all the audience insights you’ve already gathered. The problems, frustrations, opinions, and experiences you see in that stream of notes should dictate your topic selection. <\/span><i><span style=\"font-weight: 400;\">Your app’s feature list should not.<\/span><\/i><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">Whether you elect to publish elaborate infographics or straightforward blogs, your content should look more like a mirror than a product manual. It should reflect user priorities back onto the audience and bring practical solutions into focus. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Another “hidden” perk of consistently publishing content is that it gives you the <a href=\"https:\/\/www.intellectsoft.net\/cases\" target=\"_blank\" rel=\"noopener\">portfolio<\/a> to win guest blogging opportunities and the pedigree to pitch influencers with confidence.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">When social media management app Buffer was initially struggling to break through in a crowded space, the founders committed to publishing nearly 150 guest posts across a range of relevant industry blogs. Nine months after beginning that initiative, <\/span><a href=\"https:\/\/searchenginewatch.com\/sew\/how-to\/2194396\/how-guest-posting-propelled-one-site-from-0-to-100-000-customers\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">100,000 users were acquired as a direct result<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><b>This is just a taste of our upcoming user acquisition ebook for anyone diving into app development. Whether you’re with a cash-strapped startup or a well-funded venture exploring the most strategic investment choices for user acquisition, make sure to sign up for our newsletter and secure your free copy of <\/b><b><i><a href=\"https:\/\/www.intellectsoft.net\/docs\/user-acquisition-strategy\" target=\"_blank\" rel=\"noopener\">User Acquisition Explained<\/a>.<\/i><\/b><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The following is an excerpt from Chapter 3 of our upcoming comprehensive guide, “User Acquisition Explained: A Cost-Effective Strategy for Finding the Audience Your App Deserves”. Here we explore the value of content marketing and how to gain new users on a limited budget.<\/p>\n","protected":false},"author":19,"featured_media":3038,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"Not all investments are monetary. Subtle development tricks and marketing strategies serve as alternative currencies for anyone willing to put in the time.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/your-guide-to-user-acquisition-advanced-user-acquisition-on-a-budget-chapter-3\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Advanced User Acquisition on a Budget - Chapter 3\" \/>\n<meta property=\"og:description\" content=\"Not all investments are monetary. Subtle development tricks and marketing strategies serve as alternative currencies for anyone willing to put in the time.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/your-guide-to-user-acquisition-advanced-user-acquisition-on-a-budget-chapter-3\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2016-07-15T17:58:24+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2017-08-01T08:33:56+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-29475-1000x625.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1000\" \/>\n\t<meta property=\"og:image:height\" content=\"625\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/your-guide-to-user-acquisition-advanced-user-acquisition-on-a-budget-chapter-3\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/pexels-photo-29475-1000x625.jpg\",\"width\":1000,\"height\":625},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/your-guide-to-user-acquisition-advanced-user-acquisition-on-a-budget-chapter-3\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/your-guide-to-user-acquisition-advanced-user-acquisition-on-a-budget-chapter-3\/\",\"name\":\"Advanced User Acquisition on a Budget - Chapter 3\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/your-guide-to-user-acquisition-advanced-user-acquisition-on-a-budget-chapter-3\/#primaryimage\"},\"datePublished\":\"2016-07-15T17:58:24+00:00\",\"dateModified\":\"2017-08-01T08:33:56+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/1a97a096f124314b14900f52336a0c59\"},\"description\":\"Not all investments are monetary. Subtle development tricks and marketing strategies serve as alternative currencies for anyone willing to put in the time.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/your-guide-to-user-acquisition-advanced-user-acquisition-on-a-budget-chapter-3\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/1a97a096f124314b14900f52336a0c59\",\"name\":\"Maria Shevchenko\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9179aad80b3c93c3930e8be05b2ddfc0?s=96&d=mm&r=g\",\"caption\":\"Maria Shevchenko\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/2779"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/19"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=2779"}],"version-history":[{"count":0,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/2779\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/3038"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=2779"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=2779"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=2779"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}