{"id":3982,"date":"2020-08-10T14:58:31","date_gmt":"2020-08-10T11:58:31","guid":{"rendered":"https:\/\/www.intellectsoft.net\/blog\/?p=3982"},"modified":"2020-08-14T18:41:12","modified_gmt":"2020-08-14T15:41:12","slug":"what-are-beacons-and-how-do-they-work","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/what-are-beacons-and-how-do-they-work\/","title":{"rendered":"What Are Beacons and How Beacons Technology Works"},"content":{"rendered":"<p>Cost-effective, easy to deploy, and straightforwardly effective, beacons have become one of the most popular ways to engage customers across industries, especially in retail and marketing. If you are not familiar with the technology and consider implementing it in your business, our guide details everything you need to know about beacons.<\/p>\n<p><strong>You will learn:<\/strong><\/p>\n<ul>\n<li style=\"font-weight: 400;\">Where do beacons come from<\/li>\n<li style=\"font-weight: 400;\">What is beacon technology<\/li>\n<li style=\"font-weight: 400;\">How does it work<\/li>\n<li style=\"font-weight: 400;\">The many types of beacons<\/li>\n<li style=\"font-weight: 400;\">How they benefit companies across industries<\/li>\n<li style=\"font-weight: 400;\">Pros and cons of the devices<\/li>\n<li style=\"font-weight: 400;\">How technology would evolve<\/li>\n<\/ul>\n<p>Let’s start!<\/p>\n<h2><strong>What Is Beacon Technology<\/strong><\/h2>\n<p>Beacon devices are at the heart of beacon technology.<\/p>\n<blockquote><p>Most beacons are small computers, roughly the size of a standard Wi-Fi router.<\/p><\/blockquote>\n<p>Part of indoor and outdoor positioning systems and Internet of Things (IoT) networks, beacons use proximity technology to detect human presence nearby and trigger preset actions to deliver informational, contextual, and personalized experiences.<\/p>\n<h2><strong>Brief History: Where Did Beacon Technology Begin?<\/strong><\/h2>\n<p>The concept of beacons is as old as, for example, hand watches. Like lighthouses guide ships and show where the land is, beacon devices provide information and navigation to smartphone users. Beacon technology offers a new context for an old concept.<\/p>\n<blockquote><p><span data-preserver-spaces=\"true\">As we know it now, the beacon technology was introduced by <a class=\"_e75a791d-denali-editor-page-rtfLink\" href=\"https:\/\/www.forbes.com\/sites\/homaycotte\/2015\/09\/01\/beacon-technology-the-what-who-how-why-and-where\/#30576ce91aaf\" target=\"_blank\" rel=\"noopener noreferrer\">Apple<\/a> alongside a dedicated communication standard. <\/span><\/p><\/blockquote>\n<p><span data-preserver-spaces=\"true\">Called iBeacon, it was soon followed by Google’s Eddystone. The location beacon, which is rough twice the size of Apple’s Wi-Fi router Airport was a typical beacon device in the first years since 2013. <\/span><\/p>\n<p>In a short time, beacon technology spawned many startups and new beacon types. Unlike other new technologies like Augmented and Virtual Reality, beacons were straightforwardly effective and had a low price tag. On top of that, they provided new, exciting ways to engage customers in a non-intrusive way. As a result, <a href=\"https:\/\/www.intellectsoft.net\/blog\/retail-industry-bet-beacons-won\/\" target=\"_blank\" rel=\"noopener noreferrer\">many established retail companies<\/a> quickly adopted beacons and started reaping their benefits.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-17407\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Brief-History-of-Beacon-Technology-Visualization.jpg\" alt=\"Brief History of Beacon Technology\" width=\"600\" height=\"401\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Brief-History-of-Beacon-Technology-Visualization.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Brief-History-of-Beacon-Technology-Visualization-300x201.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Brief-History-of-Beacon-Technology-Visualization-450x301.jpg 450w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><\/p>\n<h2><strong>How Do Beacons Work<\/strong><\/h2>\n<p>When a user walks past an area where a positioning system or IoT network with beacons is set up, the nearest beacon sends a code with a message to their mobile device. Then, the message pops up as a notification on a user’s mobile device with a third-party or branded mobile app.<\/p>\n<p><strong>You need 3 things to make a beacon-based system work:<\/strong><\/p>\n<ul>\n<li style=\"font-weight: 400;\">At least one more beacon device<\/li>\n<li style=\"font-weight: 400;\">Mobile app<\/li>\n<li style=\"font-weight: 400;\">User’s permission<\/li>\n<\/ul>\n<p>Beacon technology offerings usually consist of a software development kit (SDK), back end management tools, and beacon devices. So, you will need software engineers to set up your positioning system, more so if beacons are part of a vast IoT network that includes other devices.<\/p>\n<blockquote><p>To enable beacon support, a smartphone must have an iOS 7 or higher or Android 4 or higher. Apple’s beacon standard is called iBeacon, while Google’s — Eddystone.<\/p><\/blockquote>\n<p>As for the user permission, your users make the final decision on whether they will receive beacon-based notifications and use your positioning system. Beacon technology works only with a smartphone and mobile app, so users can simply opt for turning off Bluetooth. There are also people who use their smartphones without keeping Bluetooth on all the time.<\/p>\n<p>To overcome this obstacle, you can ask your users to turn on Bluetooth for the full customer experience, or even excite your users by notifying them about the beacon-based positioning system, presenting it as an innovative solution, and explaining what benefits it holds for them.<\/p>\n<p>As a result, beacon technology appears as less intrusive than the similar RFID (radio-frequency identification) and other engagement tools, enabling a user experience where a user has a choice to opt out.<\/p>\n<h3><strong>BLE as Bluetooth Beacon Technology<\/strong><\/h3>\n<p>Beacon technology relies on Bluetooth Low Energy (BLE) to send out messages at regular intervals. BLE is a power-efficient Bluetooth technology developed for the Internet of Things applications and devices like beacons. With BLE, a beacon needs only one coin cell battery every three years, and the technology is 60 to 80 percent cheaper than the classic Bluetooth.<\/p>\n<h2><strong>Types of Beacons<\/strong><\/h2>\n<p>There is a wide array of beacons available for positioning systems of any type and scale. They differ in size, battery life, use cases, and level of resistance to exogenous factors. Here are the common types of beacons:<\/p>\n<ul>\n<li style=\"font-weight: 400;\"><b>Standard beacon <\/b>(devices the size of a Wi-Fi router or smaller) for proximity solutions and indoor tracking.<\/li>\n<li style=\"font-weight: 400;\"><b>Portable\/small beacon<\/b> (the size of a credit card or big sticker) for asset tracking and proximity solutions.<\/li>\n<li style=\"font-weight: 400;\"><b>USB<\/b> <b>beacon<\/b> (small, portable, quick to deploy) — beacons the size of a flash drive for asset tracking and proximity solutions.<\/li>\n<li><strong><span data-preserver-spaces=\"true\">Video beacon<\/span><\/strong><span data-preserver-spaces=\"true\"> — devices plugged into the back of a screen to deliver contextual visual information (for example, a user approaches a display in a food joint and shows personalized offers based on usage of the beacon-enabling app) as well as for digital signage.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>AI beacon<\/b>. A machine learning-driven device that can detect different movements and gestures.<\/li>\n<li style=\"font-weight: 400;\"><b>Sticker beacon <\/b>— the smallest of beacons, used for asset tracking.<\/li>\n<li style=\"font-weight: 400;\"><b>Parent beacon<\/b> (the size of big Wi-Fi routers) is used to track other beacons, gather data and store it in the cloud, and more.<\/li>\n<li style=\"font-weight: 400;\"><b>Dedicated beacon<\/b> — devices resistant to exogenous factors (dust, water, shattering, antistatic and UV) for indoor tracking and proximity solutions in harsh environments.<\/li>\n<\/ul>\n<p>Most of the aforementioned beacon types emerged in the years since the inception of beacon technology to accommodate the business needs of different companies, so new ones may come into being in the future, giving companies new options to engage customers.<\/p>\n<h2><b>Benefits: What Are Beacons Used For<\/b><\/h2>\n<p>Beacon technology can improve the user experience both at the front and back end of almost any company, helping to streamline operations and gather data, drive sales, and deliver unique user experiences. Still, the retail and marketing industries benefit from beacons the most, as they are almost tailor-made for the two.<\/p>\n<h3><strong>Front &amp; Back End of Business<\/strong><\/h3>\n<p>At the front end, for example, at a retail store, you can <a href=\"https:\/\/www.intellectsoft.net\/cases\/retail-software\" target=\"_blank\" rel=\"noopener noreferrer\">pair beacons with a custom app<\/a> to notify shoppers about limited in-store offers, deliver personalized promotions, and provide navigation at vast retail locations.<\/p>\n<p>At the back end, beacons are as effective. You can set up a beacon-based indoor positioning system at a warehouse to simplify and speed up the navigation in its bigger areas for new employees and representatives of third parties. Paired with an <a href=\"https:\/\/www.intellectsoft.net\/services\/enterprise-software-development\" target=\"_blank\" rel=\"noopener noreferrer\">enterprise software development<\/a> solution, beacons also allow for indoor personnel tracking to improve on-premises security as well as asset tracking.<\/p>\n<p>For instance, an employee of a large enterprise needs a new laptop. The system administrator chooses one from the list of available laptops as a sticker beacon on it shows its location.<\/p>\n<h3><strong>Beacons Elevate Marketing<\/strong><\/h3>\n<p>Today, companies and their marketing teams mostly rely on emerging technologies to cater to and engage customers. Small and hidden beacons have a smaller appeal, but they can have a big impact.<\/p>\n<p>In a standout example, <a href=\"https:\/\/blog.estimote.com\/post\/156727141740\/redbull-partners-with-byborre-cwi-and-nearables\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">RedBull<\/a> used beacon stickers to monitor the movements of audience members at a music event. First, the devices collected different types of data. Then, scientists used it to create algorithms and deep neural networks to understand the movements and energy levels of audience members.<\/p>\n<p>The results were visualized on the walls of a separate room at the venue. RedBull then went further, allowing the audience to take their individual information home as a souvenir, embroidered on a scarf. This is also an example of how beacon technology can be used successfully without a mobile app.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-17411\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Redbulls-Beacon-Project-1024x399-1.jpg\" alt=\"Beacons Uses in Marketing\" width=\"1024\" height=\"399\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Redbulls-Beacon-Project-1024x399-1.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Redbulls-Beacon-Project-300x117-1.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Redbulls-Beacon-Project-768x299-1.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Redbulls-Beacon-Project-600x234-1.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Redbulls-Beacon-Project-450x175-1.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Redbulls-Beacon-Project-1000x389-1.jpg 1000w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Redbulls-Beacon-Project.jpg 1600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p style=\"text-align: center;\"><em>RedBull<\/em><\/p>\n<h4><strong>Other Uses in Marketing:<\/strong><\/h4>\n<ul>\n<li style=\"font-weight: 400;\"><b>A new avenue for driving sales<\/b>. You can pair beacons with mobile to deliver <a href=\"https:\/\/www.intellectsoft.net\/cases\/retail-software\" target=\"_blank\" rel=\"noopener noreferrer\">highly personalized location-based ads<\/a>.<\/li>\n<li style=\"font-weight: 400;\"><b>One more way to collect data<\/b>. Beacons can gather customer data that will help you create better, more personalized experiences, as well as gain additional insights into customers’ behavior.<\/li>\n<li style=\"font-weight: 400;\"><b>New meaningful experiences for customers<\/b>. Like RedBull’s beacon stickers, some types of beacons give a lot of room to experiment and develop creative solutions that your customers will remember for a long time.<\/li>\n<\/ul>\n<h3><strong>Other industries that can leverage beacon technology:<\/strong><\/h3>\n<ul>\n<li style=\"font-weight: 400;\">Hospitality (navigation, gamification, smart hotel rooms)<\/li>\n<li style=\"font-weight: 400;\">Sports (navigation on big arenas, proximity marketing)<\/li>\n<li style=\"font-weight: 400;\">Logistics &amp; warehousing (asset tracking, security)<\/li>\n<li style=\"font-weight: 400;\">Smart home development (beacons can provide navigations to guests at vast properties; security)<\/li>\n<li style=\"font-weight: 400;\">Construction (geofencing perimeters for projects in the middle of nowhere)<\/li>\n<li style=\"font-weight: 400;\">Events (gamification, navigation, schedule notifications)<\/li>\n<\/ul>\n<p>Video beacons are the go-to example when it comes to showcasing the high value of beacon technology. For example, you can use video beacons to deliver contextual information and provide navigation at a hotel or resort. Such experiences are fresh, save time, and imbue the customer journey with small but memorable moments.<\/p>\n<h2><strong>Beacon Technology Pros and Cons <\/strong><\/h2>\n<p>Beacon technology has a wide array of solid business benefits and only a few disadvantages.<\/p>\n<h3><strong>Pros:<\/strong><\/h3>\n<ul>\n<li style=\"font-weight: 400;\"><b>Low cost<\/b>. Standard models are small and made of low-cost materials like plastic, making beacons more cost-effective than other state-of-the-art technologies.<\/li>\n<li style=\"font-weight: 400;\"><b>Easy to adopt<\/b>. Most beacon devices are quick to deploy. Some, like USB beacons, are as easy to install as a computer mouse. Deploying beacons at scale is also easy with parent beacons.<\/li>\n<li style=\"font-weight: 400;\"><b>Tailored-made customer experiences<\/b>. Beacon technology allows companies send personalized notifications and ads.<\/li>\n<li style=\"font-weight: 400;\"><b>Reliability and scalability<\/b>. Beacons are dependable devices: unlike GPS, they use Bluetooth, so thick walls or underground areas will not block their signals. More so, some beacon suppliers offer beacons that are reinforced against exogenous factors.<\/li>\n<li style=\"font-weight: 400;\"><b>Vast outreach<\/b>. All modern smartphones support beacon technology (your users need iOS 7 or Android 4 or higher installed on their devices), so you can reach out to virtually anyone, anywhere.<\/li>\n<li style=\"font-weight: 400;\"><b>Easy implementation<\/b>. The majority of beacon technology offerings come with a software development kit (SDK) and back end management tools, making it easy to integrate a beacon solution with existing applications.<\/li>\n<\/ul>\n<h3><strong>Cons:<\/strong><\/h3>\n<ul>\n<li style=\"font-weight: 400;\"><b>Users may opt-out<\/b>. Most beacon-based solutions require user consent. Today, the flow of content from all sides seems endless, and even if you use only a few apps daily, you still get a lot of notifications. In the face of content overload, some users can simply turn off Bluetooth on their smartphones, preferring to miss out on your beacon-based experience, even if it is exciting and non-intrusive.<\/li>\n<li style=\"font-weight: 400;\"><b>A mobile app is a must<\/b>. In most cases, beacons work only when paired with a mobile app. There are workarounds like third-party applications, but if you want to deliver a smooth experience your customers will definitely enjoy, you will at least need to add a feature to your application.<\/li>\n<li style=\"font-weight: 400;\"><b>Creating a beacon solution is not ubiquitously easy<\/b>. The use cases of beacon technology are straightforward in the retail and marketing industries. Beacons can also be used effectively by hotels and companies that develop smart room solutions. In other cases, you should get creative or hire a software engineer with expertise in beacon-based or geofencing solutions, and this will take time, more so if your company is a medium-sized business or enterprise that needs a highly scalable solution.<\/li>\n<\/ul>\n<h2><b>Conclusion: The Future of Beacons<\/b><\/h2>\n<blockquote><p>According to Global Market Insights, the beacon technology market is projected to surpass $25 billion in 2025.<\/p><\/blockquote>\n<p>In 2018, Google also started sending free beacons to small businesses in the U.S. to make their locations more visible to customers that are nearby. Meanwhile, new types of beacons continue to emerge (like AI beacon, introduced by Estimote in October 2019). Plus, when the amount of content and visual information seems endless, beacons’ promise of the spot-on non-intrusive mode of engagement may make all the difference to consumers.<\/p>\n<p>Taking all this into account, it is safe to assume that more and more business locations will have beacons installed in them in the coming years. Although long-term projections might not reflect reality in the end, there are no visible hurdles on the way of large-scale beacon technology adoption. After all, beacons demand little to invest, are easy to set up and manage regardless of business scale, and bring clear, straightforward benefits to business across industries. Why not leverage them?<\/p>\n<p>We, at Intellectsoft, empower companies and their workforce with cutting-edge transformative solutions and data-driven insights. Are you and your organization ready to shift the mindsets and get the most out of innovations?<\/p>\n<p><a href=\"https:\/\/www.intellectsoft.net\/contacts\"><b>Talk to our experts<\/b><\/a><b> and find out more about the topic and how your business or project can start benefiting from it today!<\/b><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Cost-effective, easy to deploy, and straightforwardly effective, beacons have become one of the most popular ways to engage customers across industries, especially in retail and&#8230;<\/p>\n","protected":false},"author":63,"featured_media":21454,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[798,6,797,13],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"What Are Beacons? How beacon technology works? As part of indoor positioning systems, beacons use proximity technology to detect human presence nearby.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/what-are-beacons-and-how-do-they-work\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"What Are Beacons and How Beacons Technology Works? - Intellectsoft\" \/>\n<meta property=\"og:description\" content=\"What Are Beacons? How beacon technology works? As part of indoor positioning systems, beacons use proximity technology to detect human presence nearby.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/what-are-beacons-and-how-do-they-work\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2020-08-10T11:58:31+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-08-14T15:41:12+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/What-Are-Beacons-Facebook-min.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"630\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/What-Are-Beacons-LinkedIn-min.jpg\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/what-are-beacons-and-how-do-they-work\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/What-Are-Beacons-min.jpg\",\"width\":1430,\"height\":600,\"caption\":\"What Is Beacon Technology\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/what-are-beacons-and-how-do-they-work\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/what-are-beacons-and-how-do-they-work\/\",\"name\":\"What Are Beacons and How Beacons Technology Works? - Intellectsoft\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/what-are-beacons-and-how-do-they-work\/#primaryimage\"},\"datePublished\":\"2020-08-10T11:58:31+00:00\",\"dateModified\":\"2020-08-14T15:41:12+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\"},\"description\":\"What Are Beacons? How beacon technology works? As part of indoor positioning systems, beacons use proximity technology to detect human presence nearby.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/what-are-beacons-and-how-do-they-work\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\",\"name\":\"Anastasiia Hibaieva\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5e777493cd8ae0902fee5b35c44765ce?s=96&d=mm&r=g\",\"caption\":\"Anastasiia Hibaieva\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/3982"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/63"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=3982"}],"version-history":[{"count":0,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/3982\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/21454"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=3982"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=3982"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=3982"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}