{"id":4103,"date":"2017-06-01T17:57:46","date_gmt":"2017-06-01T14:57:46","guid":{"rendered":"https:\/\/www.intellectsoft.net\/blog\/?p=4103"},"modified":"2018-10-09T19:23:35","modified_gmt":"2018-10-09T16:23:35","slug":"future-mobile-engagement-interview-swrves-ceo-christopher-dean","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/future-mobile-engagement-interview-swrves-ceo-christopher-dean\/","title":{"rendered":"Mobile Engagement: an Interview with Swrve’s CEO"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Processing billions of events daily, Swrve’s Mobile Engagement Platform helps enterprises maximize engagement and monetization by empowering marketers to deliver bespoke mobile experiences to every customer. <\/span><\/p>\n<p><a href=\"https:\/\/www.swrve.com\/\"><span style=\"font-weight: 400;\">Swrve<\/span><\/a><span style=\"font-weight: 400;\"> provides a comprehensive set of mobile-first capabilities that include audience targeting, real-time segmentation, conversations, push notifications, in-app messaging, A\/B testing, predictive models, real-time data orchestration, and rich analytics across all marketing channels. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Swrve partners with leading brands, agencies, and technology partners—including The Guardian, Condé Nast, Glamsquad, Warner Brothers, Salesforce, Oracle, and Marketo—and is installed in hundreds of apps across industries, such as retail, media, travel\/hospitality, entertainment, sports, games, and banking.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Intellectsoft partnered with Swrve on several mobile app projects, as <a href=\"https:\/\/www.intellectsoft.net\/blog\/the-importance-of-mobile-app-marketing\">mobile engagement<\/a> tools are paramount to any mobile app. We sat down with Swrve’s CEO, Christopher Dean, to dive deeper on Swrve’s innovation in the mobile marketing industry, the company’s projects and plans, and the impact of mobile on a wide range of industries.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Dean has put a major emphasis on growth, and under his leadership, Swrve has expanded across continents and now powers over nine billion mobile moments a day. In 2016 alone, Swrve expanded its customer base by 44%.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Dean has held executive leadership roles in the mobile, SaaS, and IP industries for over 20 years, and specializes in growing disruptive startups. Before joining Swrve, Dean was Chief Revenue Officer of Urban Airship, where he managed the sales and business development to maximize revenue. He was also the Chief Strategy Officer and Head of Business Development Globally for Skype from 2008 to 2011, which was sold to Microsoft for $8.5B and is considered a leader of innovation in the Silicon Valley.<\/span><\/p>\n<p><b>Q<\/b><span style=\"font-weight: 400;\">: If it’s not a secret, can you describe a couple of projects Swrve is currently working on?<\/span><\/p>\n<p><b>A: <\/b><span style=\"font-weight: 400;\">As with any development effort—be it product or marketing, it’s always important to keep the customer at the center for any initiative—this applies to Swrve as well as for Swrve’s customers. One of the key challenges that our customers have is how they can build customer lifetime value through their mobile strategy, specifically around loyalty and revenue. Here are two projects that are currently underway that we are working on to address this challenge: 1) A continuation of building out our mobile app analytics; and 2) seamless integration with a customer’s existing and future stack. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">When it comes to building customer lifetime value, there’s no better approach than to understand your customer’s experience and their journey in real time.  We are continually optimizing our real-time <a href=\"https:\/\/www.intellectsoft.net\/services\/mobile-development\">mobile app<\/a> analytics which enables marketers to optimize their customer’s user experience through Swrve’s A\/B testing platform for experimentation and testing—whether it’s a campaign or a native app experience. Our behavioral data analysis enables businesses to better understand what’s working or not working for their customers and take action to address the issues or build predictive models for further optimization.<\/span><\/p>\n<hr \/>\n<h2 style=\"text-align: center;\"><em><strong>The real-time behavioral data is extremely useful not only in the mobile channel but it is also a very powerful component for other marketing channels — and vice versa.<\/strong><\/em><\/h2>\n<hr \/>\n<p>Along the same line, the real-time behavioral data is extremely useful not only in the mobile channel but it is also a very powerful component for other marketing channels — and vice versa. Our integration with Salesforce Marketing Cloud is another project that we continue to work on, in particular with their Journey Builder product.  We’ve recently enhanced our integration where we can deliver multichannel customer journeys where the Swrve platform is focused on the mobile-first app experience and Salesforce is focused on the e-mail, web, SMS, social, and CRM.  Today, our integration enables Journey Builder to trigger:<\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Rich In-app Messages and Conversations<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Push Notifications delivered by Swrve&#8217;s Best in Class Push (Optimized Copy, Optimal Delivery Time, Personalization, Localization, Enterprise Scale)<\/span><\/li>\n<li><span style=\"font-weight: 400;\">A New Customer Journey in Journey Build from any generic in-app mobile action<\/span><\/li>\n<li><span style=\"font-weight: 400;\">An e-mail from a generic in-app mobile action.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">An SMS from a generic in-app mobile action.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Audience Manager or Contact Record Update<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Data Synchronization between systems<\/span><\/li>\n<\/ul>\n<p><b>Q: <\/b><span style=\"font-weight: 400;\">Swrve provides a mobile engagement platform that’s simple in usage and rich on features at the same time. Basically, it’s the easiest way for a business to engage with its customers via mobile — out of the box. Drag-and-drop interface, A\/B testing, everything for the complete control over campaigns, and more. What inspired you to create it and what inspired you in the development process?<\/span><\/p>\n<p><b>A: <\/b><span style=\"font-weight: 400;\">At the core of Swrve’s focus is what we call “mobile moments.” Delivering the best user experience at the right time can be challenging when your customers are everywhere and on different devices. We found that with the technology available today, like automation and machine learning, there are ways to stabilize and empower that engagement. We were inspired to create a mobile-first platform to unify mobile marketing efforts and unlock a dynamic user experience at scale.<\/span><\/p>\n<hr \/>\n<h2 style=\"text-align: center;\"><em><strong>We found that with the technology available today, like automation and machine learning, there are ways to stabilize and empower mobile engagement. Mobile experiences must be hyper-aware of user concerns, or the users will drop.<\/strong><\/em><\/h2>\n<hr \/>\n<p>We also saw a lot of unnecessary data silos in both legacy and emerging channels (mobile, <a href=\"https:\/\/www.intellectsoft.net\/platforms\/social-networking\">social networks<\/a>, and messaging networks). In marketing, transparency is everything, so we were eager to establish new clarity. On mobile in particular, audiences are difficult to maintain. Attention spans are low, people have a sense of privacy and personal space and many are reticent to commit to downloading an app. Mobile experiences must be hyper-aware of user concerns, or the users will drop.<\/p>\n<p><span style=\"font-weight: 400;\">Swrve’s inception was actually driven by gaming apps. Upon discovering that 66 percent of mobile game players quit within the first 24 hours, Swrve’s founders realized that there was a massive lack of clarity and engagement on mobile, and soon after, the company was born.<\/span><\/p>\n<p><b>Q<\/b><span style=\"font-weight: 400;\">: Your mobile engagement platform employs machine learning &amp; predictive models technology. Is there any other cutting-edge tech you plan to implement into your platform in the future?<\/span><\/p>\n<p><b>A<\/b><span style=\"font-weight: 400;\">: Absolutely.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Machine learning has always been at the core of what Swrve has delivered for its entire history. Our experience A\/B testing functionality uses a Bayesian engine to drive our User Experience optimization functionality.  As Swrve looks to our roadmap we will continue to invest into optimization and expand it beyond UX into optimal channels, timing, message content and other areas.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Swrve also uses predictive models to deliver better results for our customers.  For example, 70 percent of our customer base use our “optimal timing” delivery feature that predicts at what time to deliver the message so the end user is most likely to open it.  We can also predict in certain use cases and vertical markets when a user will likely churn, convert or what their spend level will be.<\/span><\/p>\n<hr \/>\n<h2 style=\"text-align: center;\"><em><strong>70% of our customer base use our “optimal timing” delivery feature that predicts at what time to deliver the message so the end user is most likely to open it.<\/strong><\/em><\/h2>\n<hr \/>\n<p>We also offer an additional layer of analytics for a customer that has a data science team. The premium analytics offering allows any data science team to dive deeper into KPI’s, and it can then sync with other data visualization tools like Tableau.<\/p>\n<p><span style=\"font-weight: 400;\">Finally, we are working to expose an API to allow third-party AI &amp; predictive systems to send Swrve a trigger or event in real-time so that we can deliver a message or take an action in the mobile application.<\/span><\/p>\n<p><b>Q<\/b><span style=\"font-weight: 400;\">: Mobile takes over one industry after another, but it didn’t impact all of them yet. What industries are the next in line to embrace mobile when it comes to <a href=\"https:\/\/www.intellectsoft.net\/blog\/simple-guide-launch-mobile-app-marketing-campaign\">mobile marketing<\/a> and customer engagement? Which of them are the most challenging for your platform?<\/span><\/p>\n<p><b>A<\/b><span style=\"font-weight: 400;\">: The proliferation of AI technology proposes a shift for all industries that implement digital technology. When companies undergo digital transformation, they’re typically focused on automating and optimizing as much of their organization as possible—including mobile. This process is more seamless for some industries than others. The industries that move the slowest are typically the ones with less consumer interaction or less existing software powering their business. Our belief is that the movement to mobile will eventually be universal—especially for messaging purposes.<\/span><\/p>\n<hr \/>\n<h2 style=\"text-align: center;\"><em><strong>We have one customer in the banking industry that told us that they have more customers in their mobile app in one minute than they in all their branches combined in a week.<\/strong><\/em><\/h2>\n<hr \/>\n<p>It can sometimes feel that everybody is—or wants to be—“mobile first.” At least that was the feedback at the Mobile World Congress in Barcelona this year. Enterprises in verticals like banking, telco, travel, and media, as well as commerce, are where we see consumers adopting app-based mobile first experiences to the greatest extent.  For example, we have one customer in the banking industry that told us that they have more customers in their mobile app in one minute than they in all their branches combined in a week. The reality is that consumers live on mobile, so brands needs to get there too. Organizations need to span across channels to truly reach their audiences at their convenience. Those that don’t aggressively adopt new mobile-based interaction models—particularly in the verticals and use cases that consumers have proven are best suited for mobile—will be eclipsed by competitors that do.<\/p>\n<p><b>Q<\/b><span style=\"font-weight: 400;\">: What industries are the most challenging for your platform in general?<\/span><\/p>\n<p><b>A<\/b><span style=\"font-weight: 400;\">: On a high level, those that require building robust predictive models.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">All the use cases that combine our real-time segmentation and messaging capabilities, integrations with third-party systems (marketing clouds &amp; transactions systems) and our geofencing systems are the industries and use case that exercise our systems the most.  But our service was architected to handle these real-time interactions. Today we process 130,000 events per second in real-time, 12 billion a day, 360 billion a month, for 250 million monthly active users.<\/span><\/p>\n<hr \/>\n<h2 style=\"text-align: center;\"><em><strong>Mobile isn’t ‘on the rise’ or ‘enjoying explosive growth’ anymore; it’s the new paradigm.<\/strong><\/em><\/h2>\n<hr \/>\n<p>In order to drive the best results, marketers need optimized models to predict when and how to engage with users. Mobile isn’t ‘on the rise’ or ‘enjoying explosive growth’ anymore; it’s the new paradigm. When users get stuck on a certain level of a mobile game, for example, we learned that they quit. In order to address this issue, we created a trigger that sends an in-app message to push the player to the next level, empowering the player to continue engaging with the platform.<\/p>\n<p><b>Q<\/b><span style=\"font-weight: 400;\">: Are there any updates coming to your platform? How do they reflect your future development strategy?<\/span><\/p>\n<p><b>A<\/b><span style=\"font-weight: 400;\">: Our product vision goes a little like this: we enable you to know every customer, anticipate their needs and interact personally at the perfect moment. This is what we call Swrve’s “atomic unit”—personal interactive messaging. Messages that are contextual, dynamic, natural and most of all, personal. By 2020, Swrve will power millions of individual conversations every minute—the OS for mobile customer interactions. This is where we are focused right now.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Christopher Dean talks Swrve&#8217;s innovative mobile engagement platform, AI, and the ever growing influence of mobile.<\/p>\n","protected":false},"author":63,"featured_media":4105,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,1],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"Swrve’s Mobile Engagement Platform provides a set of capabilities that include audience targeting, and analytics across all marketing channels.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/future-mobile-engagement-interview-swrves-ceo-christopher-dean\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Swrve’s Mobile Engagement Platform - an Interview Christopher Dean\" \/>\n<meta property=\"og:description\" content=\"Swrve’s Mobile Engagement Platform provides a set of capabilities that include audience targeting, and analytics across all marketing channels.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/future-mobile-engagement-interview-swrves-ceo-christopher-dean\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2017-06-01T14:57:46+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2018-10-09T16:23:35+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/shutterstock_523305079-Converted-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1300\" \/>\n\t<meta property=\"og:image:height\" content=\"600\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/future-mobile-engagement-interview-swrves-ceo-christopher-dean\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/shutterstock_523305079-Converted-1.jpg\",\"width\":1300,\"height\":600},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/future-mobile-engagement-interview-swrves-ceo-christopher-dean\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/future-mobile-engagement-interview-swrves-ceo-christopher-dean\/\",\"name\":\"Swrve\\u2019s Mobile Engagement Platform - an Interview Christopher Dean\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/future-mobile-engagement-interview-swrves-ceo-christopher-dean\/#primaryimage\"},\"datePublished\":\"2017-06-01T14:57:46+00:00\",\"dateModified\":\"2018-10-09T16:23:35+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\"},\"description\":\"Swrve\\u2019s Mobile Engagement Platform provides a set of capabilities that include audience targeting, and analytics across all marketing channels.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/future-mobile-engagement-interview-swrves-ceo-christopher-dean\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\",\"name\":\"Anastasiia Hibaieva\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5e777493cd8ae0902fee5b35c44765ce?s=96&d=mm&r=g\",\"caption\":\"Anastasiia Hibaieva\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/4103"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/63"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=4103"}],"version-history":[{"count":0,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/4103\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/4105"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=4103"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=4103"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=4103"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}