{"id":4853,"date":"2018-04-23T18:04:05","date_gmt":"2018-04-23T15:04:05","guid":{"rendered":"https:\/\/www.intellectsoft.net\/blog\/?p=4853"},"modified":"2019-02-01T16:32:24","modified_gmt":"2019-02-01T13:32:24","slug":"blockchain-government-regulation","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/blockchain-government-regulation\/","title":{"rendered":"Blockchain Regulation: Technology Is Welcomed, Cryptocurrency Regulated"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">With the current rise of <\/span><a href=\"https:\/\/www.intellectsoft.net\/blog\/big-enterprises-use-blockchain\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">blockchain technology<\/span><\/a><span style=\"font-weight: 400;\">, governments around the world have already issued the first blockchain-related laws. Should companies approach blockchain with suspicion? Does blockchain government regulation concern solely cryptocurrencies, or the entire range of blockchain solutions? Join <\/span><a href=\"https:\/\/www.intellectsoft.net\/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">Intellectsoft<\/span><\/a><span style=\"font-weight: 400;\"> as we look at the first wave of blockchain laws.<\/span><\/p>\n<h2><strong>Blockchain Regulation — Always the Long Road<\/strong><\/h2>\n<p><span style=\"font-weight: 400;\">Bitcoin has remained in the shadow for several years since its release in 2009, which is a long time for our fast-paced world that quickly embraces new technology. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">According to blockchain advocate Andreas Antonopoulos, people met cars, cellphones, and internet with the same level of suspicion as bitcoin and blockchain. Before a revolutionary technology reaches widespread adoption, a lot of people predict its downfall, while governments introduce wide-ranging regulation. Such technologies are perceived as unfitting in the first place, with many branding them too slow or too complex. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Still, if a technology holds immense potential, the adoption will continue. Blockchain is currently in the middle of this process. Now, let’s look at the adoption timeline of blockchain and how governments around the globe made their first steps in regulating the technology.<\/span><\/p>\n<h2><strong>Blockchain Technology Regulation — The Timeline<\/strong><\/h2>\n<p><span style=\"font-weight: 400;\">The term “blockchain” was first used in the fall of 2015. In the following year, the craze over this new concept of storing data in a secure and immune way, as well as Bitcoin cryptocurrency it provides the foundation for, spread across the globe with initial coin offerings (ICOs), an issuance of virtual tokens for the primary investment. ICOs gave way to the companies of a new breed: they avoided a traditional venture capital and promised to disrupt every industry with blockchain technology.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Notably, programmable money was the first application of blockchain, with projects like Monero and Litecoin following the steps of Bitcoin. The immense hype accelerated the growth of cryptocurrencies’ value and increased the number of people investing in them. In 2017 alone new and experienced cryptocurrency investors spent over $6 billion on ICOs, not taking into account billions of dollars invested in purchasing more bitcoin, ethereum, and other decentralized currencies. The popularity of ICOs has also led to the proliferation of illegal financial activities known as “<\/span><a href=\"https:\/\/bitfalls.com\/2018\/01\/12\/anatomy-pump-dump-group\/\" target=\"_blank\" rel=\"nofollow noopener\"><span style=\"font-weight: 400;\">pump-and-dumps<\/span><\/a><span style=\"font-weight: 400;\">”.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Consequently, China and a few other countries banned ICOs in 2017. Regulatory meetings happened very often, and governments started issuing new laws with similar regularity. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This has led to creation of <\/span><a href=\"http:\/\/map.bitlegal.io\" target=\"_blank\" rel=\"nofollow noopener\"><span style=\"font-weight: 400;\">BitLegal<\/span><\/a><span style=\"font-weight: 400;\"> — an online map that tracks the constantly evolving regulatory landscape of cryptographic assets and distributed ledger technology (DLT), as well as reflects how governments around the world regulate cryptocurrencies and blockchain technology. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Now, let’s start reviewing blockchain regulation across the world in depth. Concurrently, it is important to understand that, in most cases, only one particular blockchain application captured the attention of lawmakers — blockchain in finance. <\/span><\/p>\n<h2><strong>Regulation of Cryptocurrency Around the World<\/strong><\/h2>\n<p><span style=\"font-weight: 400;\">Whereas the global community is seeking consensus on cryptocurrency regulation, the national governments are making their own maneuvers, and it is important to understand the intentions behind them. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For instance, small countries like Gibraltar, Bermuda, and Lichtenstein are all seeking to attract new capital and become crypto-friendly as a result. The Republic of Marshall Islands and Venezuela even issue their own tokens to oppose external financial influence.<\/span><\/p>\n<p><a href=\"https:\/\/theintercept.com\/2018\/03\/20\/the-nsa-worked-to-track-down-bitcoin-users-snowden-documents-reveal\/\" target=\"_blank\" rel=\"nofollow noopener\"><span style=\"font-weight: 400;\">According to Edward Snowden<\/span><\/a><span style=\"font-weight: 400;\">, the National Security Agency (NSA) of the US had been extensively tracking Bitcoin users for years. Allegedly, this was carried out to prevent money laundering and counter terrorism financing with ICOs. Meanwhile, the US government has equated this type of fundraising to IPO in the majority of cases. The country also looks into developing procedures and licensing for blockchain-related instruments. As blockchain technology regulation is an ongoing process worldwide, it is more convenient to stay updated with <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Initial_coin_offering\"><span style=\"font-weight: 400;\">corresponding resources<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-4854\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-Regulation-in-France.jpg\" alt=\"Blockchain Technology Regulation\" width=\"601\" height=\"481\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-Regulation-in-France.jpg 1000w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-Regulation-in-France-300x240.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-Regulation-in-France-768x614.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-Regulation-in-France-600x480.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-Regulation-in-France-450x360.jpg 450w\" sizes=\"(max-width: 601px) 100vw, 601px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">On March 20, 2018, G20 countries gathered in Buenos Aires to discuss the possible regulation of cryptocurrency. Argentina, Australia, Turkey, South Africa, and the United Kingdom proclaimed that they decided not to regulate cryptocurrencies. Mark Carney, the head of The Bank of England, was a chairman of G20’s Financial Stability Board and mentioned that “cryptoassets do not pose risks to global financial stability at this time,” citing the relatively small capitalization of the market. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">On the other hand, <\/span><a href=\"https:\/\/news.bitcoin.com\/bill-on-digital-assets-filed-in-the-duma-disagreements-resolved\/\" target=\"_blank\" rel=\"nofollow noopener\"><span style=\"font-weight: 400;\">Russia is drafting a bill that will allow the registration of cryptocurrency<\/span><\/a><span style=\"font-weight: 400;\"> exchanges only on official government websites. This June, G20 members will meet again to share “very specific recommendations on not what to regulate but what data they need for this,” as <\/span><a href=\"https:\/\/www.coindesk.com\/g20-calls-crypto-regulation-recommendations-july\/\" target=\"_blank\" rel=\"nofollow noopener\"><i><span style=\"font-weight: 400;\">CoinDesk<\/span><\/i><span style=\"font-weight: 400;\"> reported<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Authorities in Indonesia have ruled out the usage of cryptocurrencies. Indonesia Central Bank insisted that Indonesian rupiah is the only currency permitted for transactions inside the country, referring to the country’s currency act. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Meanwhile, <\/span><a href=\"https:\/\/cryptovest.com\/news\/saudi-arabia-weighing-soft-crypto-regulation\/\" target=\"_blank\" rel=\"nofollow noopener\"><span style=\"font-weight: 400;\">Saudi Arabia is working on establishing legal norms for blockchain technology implementation<\/span><\/a><span style=\"font-weight: 400;\"> without prohibiting cryptocurrencies. The country cooperated with the UAE on a pilot project to explore cross-border digital currency payments on blockchain. In October 2017, the Saudi Arabian Islamic Development Bank ordered its researchers to develop blockchain-based products. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Some <\/span><a href=\"https:\/\/news.bitcoin.com\/italy-completes-consultations-on-registration-of-crypto-companies\/\" target=\"_blank\" rel=\"nofollow noopener\"><span style=\"font-weight: 400;\">Italian banks are considering to issue their own cryptocurrency<\/span><\/a><span style=\"font-weight: 400;\">, while the government wants to determine the number of commercial companies accepting payments in cryptocurrency. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">France warns its citizens of risks associated with the new class of digital assets and <\/span><a href=\"https:\/\/www.ccn.com\/frances-finance-minister-plans-ico-regulations-in-bid-to-attract-crypto-startups\/\" target=\"_blank\" rel=\"nofollow noopener\"><span style=\"font-weight: 400;\">prepares a law on ICOs and cryptocurrencies<\/span><\/a><span style=\"font-weight: 400;\">. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">South Korea is against anonymous transactions and currently develops a tax law, whereas Japan and Germany acknowledged bitcoin as an eligible currency and have taxed it, too. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Finally, India prohibits cryptocurrency payments, considering them illegal. Brazil prohibits investing in bitcoin as well. <\/span><\/p>\n<h2><strong>Blockchain Government Regulation<\/strong><\/h2>\n<p><span style=\"font-weight: 400;\">As mentioned earlier, the regulations are mostly limited to cryptocurrencies and ICOs. While blockchain is still in its infancy, governments around the world recognize the value of distributed ledger technology.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Switzerland has been among the pioneers in the blockchain field. One of its cities — Zug — hosts several blockchain startups and offers a flexible taxation and solid legislative protection to the companies of the blockchain breed. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Canada is another example of how regulators can embrace the technology. Recently, the Canadian government allowed to issue an <\/span><a href=\"https:\/\/www.coindesk.com\/canada-approves-countrys-first-blockchain-etf\/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">ETF for blockchain technologies<\/span><\/a><span style=\"font-weight: 400;\">, which can now be traded on the Toronto Stock Exchange. Apart from that, the National Research Council (NRC) of Canada utilizes blockchain technology to better track and publish information about grant funding.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">China might see to be harsh “on the current blockchain hype [which] is focusing on fundraising and speculation,” says Hu Danqing, a technology product specialist from Alibaba, in an <\/span><a href=\"https:\/\/www.coindesk.com\/chinas-state-media-blockchain-needs-regulation-grow\/\" target=\"_blank\" rel=\"nofollow noopener\"><span style=\"font-weight: 400;\">interview<\/span><\/a><span style=\"font-weight: 400;\">. Still, the country’s officials believe that the blockchain technology can solve real-world problems. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Similarly, the United States, the UK, Singapore and Japan do not intend to scare away the blockchain industry professionals, admitting the need for proper blockchain regulation. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">During the hearing in the US on February 6, 2018, the Securities and Exchange Commission (SEC) chairman Jay Clayton and the Commodity Futures Trading Commission (CFTC) chairman Christopher Giancarlo spoke before the Senate Banking Committee on the topic of <\/span><a href=\"https:\/\/www.banking.senate.gov\/public\/index.cfm\/hearings?ID=D8EC44B1-F141-4778-A042-584E0F3B9D39\" target=\"_blank\" rel=\"nofollow noopener\"><span style=\"font-weight: 400;\">virtual currencies<\/span><\/a><span style=\"font-weight: 400;\">. They recognized the numerous ways of blockchain implementation across dozens of industries, from finance to health and to media, and even said that “there could be no blockchain without bitcoin.” <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The <\/span><a href=\"https:\/\/www.ethnews.com\/seven-takeaways-from-the-sec-and-cftcs-testimony-on-virtual-currency\" target=\"_blank\" rel=\"nofollow noopener\"><i><span style=\"font-weight: 400;\">EthNews<\/span><\/i><\/a><span style=\"font-weight: 400;\"> summarized the hearing’s with most important statements. For instance, both commissioners agree there is no systematic risk coming from cryptocurrencies, since their market capitalization remains a small part of the global economy. The officials also admitted they lacked economists in the blockchain field and that blockchain regulation on the state level is still chaotic. Thus, a solution to the current status quo, as well as blockchain implementation in the government sector, are welcomed. Marco Santori of Cooley once emphasized that <\/span><a href=\"https:\/\/www.forbes.com\/sites\/laurashin\/2017\/12\/12\/how-crypto-and-blockchain-technology-should-be-regulated\/#b7533ea67ba9\" target=\"_blank\" rel=\"nofollow noopener\"><span style=\"font-weight: 400;\">blockchain and cryptocurrency regulation<\/span><\/a><span style=\"font-weight: 400;\"> depends on the applications of the technology.<\/span><\/p>\n<h2><strong>Blockchain Government Regulation — European Blockchain Partnership<\/strong><\/h2>\n<p><span style=\"font-weight: 400;\">In a standout announcement, 22 European countries have recently signed a Declaration on establishment of a <\/span><a href=\"https:\/\/ec.europa.eu\/digital-single-market\/en\/news\/european-countries-join-blockchain-partnership\" target=\"_blank\" rel=\"nofollow noopener\"><span style=\"font-weight: 400;\">European Blockchain Partnership<\/span><\/a><span style=\"font-weight: 400;\">. The partnership “will be a vehicle for cooperation amongst Member States to exchange experience and expertise in technical and regulatory fields and prepare for the launch of EU-wide blockchain applications across the Digital Single Market for the benefit of the public and private sectors.” The partnership will also ensure that Europe “continues to play a leading role in the development and roll-out of blockchain technologies.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In 2018, The European Commission also launched the EU Blockchain Observatory and Forum, investing over <\/span><span style=\"font-weight: 400;\">€<\/span><span style=\"font-weight: 400;\">80 million in blockchain projects that support the use of blockchain in technical and societal areas, with <\/span><span style=\"font-weight: 400;\">€<\/span><span style=\"font-weight: 400;\">300 million more to be allocated to blockchain implementation by 2020.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-4856\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-EU-1024x768.jpeg\" alt=\"blockchain government regulation\" width=\"640\" height=\"480\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-EU.jpeg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-EU-300x225.jpeg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-EU-768x576.jpeg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-EU-600x450.jpeg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-EU-450x338.jpeg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-EU-1000x750.jpeg 1000w\" sizes=\"(max-width: 640px) 100vw, 640px\" \/><\/p>\n<p style=\"text-align: center;\"><i><span style=\"font-weight: 400;\">Courtesy of <\/span><\/i><a href=\"https:\/\/ec.europa.eu\/digital-single-market\/\" target=\"_blank\" rel=\"nofollow noopener\"><i><span style=\"font-weight: 400;\">Digital Single Market <\/span><\/i><i><span style=\"font-weight: 400;\"><br \/>\n<\/span><\/i><\/a><\/p>\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">List of countries who signed the Declaration includes UK, Norway, Germany, France, Finland, Portugal, Poland, Austria, Belgium, Bulgaria, Czech Republic, Estonia, Ireland, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Slovakia, Slovenia, Spain, Sweden.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Mariya Gabriel, Commissioner for Digital Economy and Society, welcomed the signature of the Declaration, stating the following: &#8220;In the future, all public services will use blockchain technology. Blockchain is a great opportunity for Europe and Member States to rethink their information systems, to promote user trust and the protection of personal data, to help create new business opportunities and to establish new areas of leadership, benefiting citizens, public services and companies.”<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><\/p>\n<h2><strong>Conclusion — Future of Blockchain Regulation<\/strong><\/h2>\n<p><span style=\"font-weight: 400;\">Blockchain technology implementation and regulation poses minimal to no danger to businesses wanting to embrace the technology, while we still have to see what the future holds for the global adoption of cryptocurrencies and ICOs. Furthermore, Western governments encourage blockchain implementation in public services and welcome the usage of technology in the corporate sector. <\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">Need a solid blockchain solution that complies with the laws of the country your business operates in? <\/span><\/i><a href=\"https:\/\/www.intellectsoft.net\/contacts\" target=\"_blank\" rel=\"noopener\"><i><span style=\"font-weight: 400;\">Get in touch with Intellectsoft<\/span><\/i><\/a><i><span style=\"font-weight: 400;\">. We have already completed several blockchain projects for our clients.<\/span><\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Blockchain laws around the world.<\/p>\n","protected":false},"author":63,"featured_media":4857,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[801],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"Enterprises embrace blockchain due to its immense potential in security and automation. Governments are following suit with blockchain regulation. As it is a new technology, the new laws raise questions. See our guide on blockchain technology regulation to stay up to date on the matter.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/blockchain-government-regulation\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Blockchain Regulation Around the World | Intellectsoft US\" \/>\n<meta property=\"og:description\" content=\"Enterprises embrace blockchain due to its immense potential in security and automation. Governments are following suit with blockchain regulation. As it is a new technology, the new laws raise questions. See our guide on blockchain technology regulation to stay up to date on the matter.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/blockchain-government-regulation\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2018-04-23T15:04:05+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-02-01T13:32:24+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-Regulation.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1300\" \/>\n\t<meta property=\"og:image:height\" content=\"600\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/blockchain-government-regulation\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Blockchain-Regulation.jpg\",\"width\":1300,\"height\":600,\"caption\":\"blockchain regulation\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/blockchain-government-regulation\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/blockchain-government-regulation\/\",\"name\":\"Blockchain Regulation Around the World | Intellectsoft US\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/blockchain-government-regulation\/#primaryimage\"},\"datePublished\":\"2018-04-23T15:04:05+00:00\",\"dateModified\":\"2019-02-01T13:32:24+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\"},\"description\":\"Enterprises embrace blockchain due to its immense potential in security and automation. Governments are following suit with blockchain regulation. As it is a new technology, the new laws raise questions. See our guide on blockchain technology regulation to stay up to date on the matter.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/blockchain-government-regulation\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\",\"name\":\"Anastasiia Hibaieva\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5e777493cd8ae0902fee5b35c44765ce?s=96&d=mm&r=g\",\"caption\":\"Anastasiia Hibaieva\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/4853"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/63"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=4853"}],"version-history":[{"count":0,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/4853\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/4857"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=4853"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=4853"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=4853"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}