{"id":5038,"date":"2018-06-19T18:00:24","date_gmt":"2018-06-19T15:00:24","guid":{"rendered":"https:\/\/www.intellectsoft.net\/blog\/?p=5038"},"modified":"2020-07-06T16:09:27","modified_gmt":"2020-07-06T13:09:27","slug":"dedicated-development-team-reimagined-and-improved","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/dedicated-development-team-reimagined-and-improved\/","title":{"rendered":"Team Extension: Dedicated Development Team, Elevated"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">You have probably stumbled on words “Team Extension” online while looking for software engineers to help you with a project. It is granted that what it means and how it differs from similar services might cause confusion in anyone who wants to finish a software project, all the more so if one dealt with hiring developers several times. In the flow of services like IT staffing, dedicated teams, and staff augmentation one more similarly sounding services a new name might create further confusion.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">That is not the case with team extension, a more efficient way to hire the right <\/span><a href=\"https:\/\/www.intellectsoft.net\/services\/dedicated-development-team\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">dedicated development team<\/span><\/a><span style=\"font-weight: 400;\"> with niche skills quickly — and there is more to it.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This post will guide through all the essentials, helping you get a clear understanding of the service, including:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Definition of team extension<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">How it differs from the classic dedicated team service<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Who offers team extension<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Cornerstones of the service<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Now, let’s discern this new way to hire a right dedicated development team.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-5039\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/chris-knight-458508-unsplash-1024x683.jpg\" alt=\"Dedicated development team\" width=\"644\" height=\"430\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/chris-knight-458508-unsplash-1024x683.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/chris-knight-458508-unsplash-300x200.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/chris-knight-458508-unsplash-768x512.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/chris-knight-458508-unsplash-600x400.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/chris-knight-458508-unsplash-450x300.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/chris-knight-458508-unsplash-1000x667.jpg 1000w\" sizes=\"(max-width: 644px) 100vw, 644px\" \/><\/p>\n<h2><b>The Definition of the New Dedicated Team Model<\/b><\/h2>\n<p><b>Team extension <\/b><span style=\"font-weight: 400;\">is the process of quickly finding software engineers with the right expertise and high loyalty for software projects. In essence, team extension is a better, modern version of the dedicated team approach. <\/span><\/p>\n<h2><b>The Difference from the Dedicated Team Approach<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Nevertheless, there is an underlying difference between the two. Team extension focuses on speed and effectiveness. As a dedicated team model, team extension was conceived to address the dynamic and demands of the modern business world: startups, SMBs, and enterprises alike need loyal developers with a particular set of skills for long stretches of time.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">How does team extension achieve this?<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The service is offered by established companies that have been operating on the software development market <\/span><b>for at least 5 years<\/b><span style=\"font-weight: 400;\">. They have access to a vast pool of engineering talent with a wide and diverse set of skills, which allows them to build the right dedicated development team quickly.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Team extension is aimed at long-term partnerships, with diverse and challenging projects that create the space for software engineers to grow, therefore increasing talent retention.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">This new dedicated team model relies and the latest dedicated team management practices that allow to build the right team faster and ensure its every member is continuously motivated and satisfied. <\/span><\/li>\n<\/ul>\n<h2><b>The Cornerstones of Team Extension <\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Team extension has four important elements. <\/span><\/p>\n<p><b>Flexibility in proximity<\/b><span style=\"font-weight: 400;\">. Software engineers live all over the world. The are also highly mobile: like many people today, developers love to travel, and more often than not prefer to integrate the work with their travelling. Some of them are freelancers; others work for a company on flexible terms, which allows them, for example, to work remotely from Bali in the winter. Some software engineers even work full-time jobs and freelance, from day to day, at the same time.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As a dedicated team model, team extension aims to provide a client with the right developers regardless of wherever the developers and the client are, and negotiate a mode of cooperation: nearshore (in close proximity to the client), onshore (on the client’s premises), or offshore (remotely). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here, team extension should aim to negotiate <\/span><b>the most flexible conditions<\/b><span style=\"font-weight: 400;\">, with a developer (or developers) flying in to work as an onshore dedicated team whenever needed — or work for a agree on stretch of time onshore or nearshore while keeping the possibility to work remotely.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-5040\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/rawpixel-670743-unsplash-899x1024.jpg\" alt=\"Dedicated team\" width=\"456\" height=\"519\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/rawpixel-670743-unsplash-899x1024.jpg 899w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/rawpixel-670743-unsplash-263x300.jpg 263w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/rawpixel-670743-unsplash-768x875.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/rawpixel-670743-unsplash-600x683.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/rawpixel-670743-unsplash-395x450.jpg 395w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/rawpixel-670743-unsplash-878x1000.jpg 878w\" sizes=\"(max-width: 456px) 100vw, 456px\" \/><\/p>\n<p><b>Niche Skills<\/b><span style=\"font-weight: 400;\">. When it comes to software solutions and digital products, many companies want to have an edge over the competition and cater to the demands of modern customers. In most cases, this is achieved through implementation of the latest technologies. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Yet, for these companies, the main problem is that most of these tech are either in early stages or evolving continuously. Whether it is a project with augmented reality, blockchain, or Internet of Things, team extension helps to find a loyal software developers team that consists of qualified engineers who have the combination of hard and soft skills required for complex projects.  <\/span><\/p>\n<p><b>High Scaling Velocity<\/b><span style=\"font-weight: 400;\">. As companies that offer team extension have at least five years of expertise in dedicated development team management, they employ a great number of software developers on a full-time basis. They also have access to a pool of developers — a region in the world that has a very high number of software engineers with a wide range of skills. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Eastern Europe is good example, balancing cost-effectiveness and code quality. The scale of this talent market and its regulatory framework allows the companies operating in the region provide highly flexible team extension. This means that a dedicated software development team working in a team extension model can quickly grow in toe with a client’s business. Team extension’s high flexibility also extends to the hiring process, which can be tailored to the client’s requirements, allowing them to tackle the challenges of the ever-changing business environment. <\/span><\/p>\n<p><b>High Loyalty<\/b><span style=\"font-weight: 400;\">. Fostering a company culture that both makes existing developers stay and always attracts new talents is paramount to team extension. Equally important are career planning and professional management. As a result, team extension offers an incomparably low attrition level in a team of software developers, allowing them to tackle long-term projects that go on for over a year. All these aspects need time and effort to develop, and that is the reason why only long existing companies can provide reliable team extension. <\/span><\/p>\n<h2><b>Is This Dedicated Team Model More Cost-Effective?<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">As team extension offers immense flexibility, the client has a lot of space to be efficient with their budget. Opportunities include hiring an engineer with niche skills to work as part of an existing developers team solely for a short-term task (or solving a particular problem). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Ultimately, there might not be a great difference in budget costs between the usual dedicated team approach and team extension for most projects. Still, that is not what the service aims to achieve in the first place. The key difference between team extension and the classic dedicated development team services lies in higher efficiency at key stages, and the focus on loyalty. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In some cases, team extension might even be more expensive than the usual dedicated team approach. This mainly concerns projects with the latest tech. Nevertheless, if a company needs a talented Augmented Reality software engineer quickly, team extension has a better chance of providing them with one.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-5041\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/rawpixel-252127-unsplash-1024x683.jpg\" alt=\"dedicated software development team\" width=\"640\" height=\"427\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/rawpixel-252127-unsplash-1024x683.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/rawpixel-252127-unsplash-300x200.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/rawpixel-252127-unsplash-768x513.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/rawpixel-252127-unsplash-600x400.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/rawpixel-252127-unsplash-450x300.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/rawpixel-252127-unsplash-1000x667.jpg 1000w\" sizes=\"(max-width: 640px) 100vw, 640px\" \/><\/p>\n<h2><b>Who Would Hire a Dedicated Team with Team Extension?<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">The key industries that look for this new dedicated team approach are healthcare (among them a lot of pharmaceutical companies) and hospitality and tourism. The first needs reliable partners to deliver near-faultless software for patients and internal usage, as well as implement new technologies. Meanwhile, hospitality and tourism companies need to continuously deliver highly streamlined <\/span><a href=\"https:\/\/www.intellectsoft.net\/cases\/guest-services-web-portal\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">software solutions<\/span><\/a><span style=\"font-weight: 400;\">. For example, today’s guests expect mobile to be part of the hotel experience, and that a hotel’s level of comfort extends to their <\/span><a href=\"https:\/\/www.intellectsoft.net\/blog\/hilton-wynn-las-vegas-apps-hotels-done-right\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">mobile app<\/span><\/a><span style=\"font-weight: 400;\">. At the other side of the reception desk are the employees, who need effective digital tools to deliver the services efficiently. Interestingly, a lot of startups also seek team extension services, to succeed with large-scale projects. <\/span><\/p>\n<h2>How to Hire a Dedicated Team with Team Extension: 4 Main Principles<\/h2>\n<p>Since the task of hiring a dedicated team becomes harder with the extra requirements for a team extension, switching to higher speed and effectiveness requires proper knowledge. We recommend referring to an expert who has access to all the valuable resources on the market and can assist you in finding true specialists for your task.<\/p>\n<p>There are 4 basic principles for hiring a dedicated team with team extension. In short, you should check that the new team members are an ideal project fit and possess deep expertise in their field. For you, there are requirements for total control over the situation and a clear definition of the project goals.<\/p>\n<ul>\n<li>Ensure that people hired fit your project perfectly<\/li>\n<\/ul>\n<p>Since team extension works on a project with the maximum speed and effectiveness, the careful preparation for its inclusion is critical. Before hiring, ensure the chosen specialists can dedicate their full attention to your tasks, without switching between several projects. Moreover, we recommend meeting each new team member in person. Since you’ll be working side by side for several hot months, the mutually pleasant integration is a must.<\/p>\n<ul>\n<li>Check the professionalism of a dedicated team<\/li>\n<\/ul>\n<p>During the project implementation, you’ll face many times how things go wrong. But you can reduce the level of uncertainty and pressure by finding the right people who possess deep expertise. They can address all these challenges and bring your overall project&#8217;s effectiveness to the new level.<\/p>\n<ul>\n<li>Establish direct control over a dedicated team under team extension<\/li>\n<\/ul>\n<p>Never transfer the reins of power to your team situated in another office! The team extension model presupposes that you are a full owner of the project still. Thus, be ready to manage the constant flow of technical improvements, edits needing your attention, and various types of strategic and tactical decision-making. Moreover, your responsibilities will include possessing control over the development process, effective team communication, and performance evaluation. In short, the team’s increased effectiveness doesn’t mean you’ll have less work — and you should embrace that responsibility.<\/p>\n<ul>\n<li>Clearly define project goals and criteria<\/li>\n<\/ul>\n<p>To measure the speed and effectiveness of a dedicated team under team expansion, you need a clear vision of your project and where it leads. Moreover, determine the roles of each team member to avoid ambiguity and their low effectiveness. In practical terms, that means setting milestones for the project and creating the assessment plan for each new project member. Don’t hesitate to use the SMART approach to goal-setting and direct discussion with your extended team members.<\/p>\n<p>For the best result, look for software development companies who have been working in IT for well over five years. Many of them offer the new dedicated team model. The service offering might slightly differ from company to company, but the main promise should be the same. Also, some companies prefer the classic “Dedicated Team” name for the updated service.<\/p>\n<h2><b>Dedicated Team Structure in Team Extension<\/b><\/h2>\n<p>Last but not least, the structure of a new model team is almost the same and largely depends on the project: UI and UX designers, business analysts, the right engineers, and a project manager. The main difference is Human Resources experts play a more actionable role besides a team extension manager.<\/p>\n<p>Among all, you should determine the exact reasons why you hire each specialist in your dedicated team. In most cases, the effective inclusion of a dedicated team under the team extension works when you have urgent, complex tasks and limited resources for hiring new in-house professionals to complete them. In this wide definition, hundreds of smaller reasons and nuances that can be your case, such as:<\/p>\n<ul>\n<li>You need to develop MVP really quickly,<\/li>\n<li>Your in-house team doesn’t have free resources to manage critical project tasks,<\/li>\n<li>There’s the need to address the growing scope of the project ASAP,<\/li>\n<li>You have ambiguous goals you cannot achieve with your current team.<\/li>\n<\/ul>\n<p>The key principle for hiring an extended team is to turn it into an integral part of your current project team. In practical terms, that means smart empowerment and supplementation. For example, you have an experienced developer but a PPC specialist that never worked with the needed market niche before. In this case, you’ll benefit the most by hiring an assistant to your developer and an experienced PPC professional who possess the needed knowledge and experience. The same principle applies to all the project areas. If you can identify all the problems and gaps, try finding each specialist on a freelance platform. However, it’s always easier to hire an online vendor who will do all the necessary audit, hiring, and management work over your dedicated team.<\/p>\n<p>If you need the checklist to start, here’s the typical structure of a dedicated team that we advise our clients:<\/p>\n<ul>\n<li>Front-end engineer,<\/li>\n<li>Back-end engineer,<\/li>\n<li>QA,<\/li>\n<li>UX\/UI designer,<\/li>\n<li>DevOps engineer,<\/li>\n<li>BA,<\/li>\n<li>PM.<\/li>\n<\/ul>\n<p>Why is it better to hire an expert to find this dedicated team for you? That’s because an outside vendor holds the responsibilities over administrative and management work. And so, you can concentrate on developing the general strategic vision as a project owner. With this expert, your team extension can operate as a self-managed team. They won’t burden you with hiring new team members. But they will expect the direction and the assessment of their speed and effectiveness from you. In short, you set your criteria, and the extended team presents you with the result.<\/p>\n<p>In general, the dedicated team in team extension has the perfect structure to fit a startup with several ambitious projects, an established business that manages long-term projects with complex tasks, and a digital agency that aims at expanding. And it doesn’t work that well when you have limited funds, small project scope, or high quality is not your priority. In these cases, you won’t be able to maintain the extended team management and enjoy the advantages of its speed and effectiveness.<\/p>\n<p><i><span style=\"font-weight: 400;\">You can find out more on our our <\/span><\/i><a href=\"https:\/\/www.intellectsoft.net\/services\/dedicated-development-team\" target=\"_blank\" rel=\"noopener noreferrer\"><i><span style=\"font-weight: 400;\">Team Extension<\/span><\/i><\/a><i><span style=\"font-weight: 400;\"> page. <\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">If you a ready to hire and lead a team of developers, do not hesitate to <\/span><\/i><a href=\"https:\/\/www.intellectsoft.net\/contacts\"><i><span style=\"font-weight: 400;\">get in touch with us<\/span><\/i><\/a><i><span style=\"font-weight: 400;\">. Our software engineers have been helping startups, SMBs, and Fortune 500 companies for over 10 years.<\/span><\/i><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-5042\" src=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wesson-wang-110739-unsplash-1024x683.jpg\" alt=\"dedicated team of developers\" width=\"640\" height=\"427\" srcset=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wesson-wang-110739-unsplash-1024x683.jpg 1024w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wesson-wang-110739-unsplash-300x200.jpg 300w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wesson-wang-110739-unsplash-768x512.jpg 768w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wesson-wang-110739-unsplash-600x400.jpg 600w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wesson-wang-110739-unsplash-450x300.jpg 450w, https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/wesson-wang-110739-unsplash-1000x667.jpg 1000w\" sizes=\"(max-width: 640px) 100vw, 640px\" \/><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Everything you need to know about the most effective hiring model of today.<\/p>\n","protected":false},"author":63,"featured_media":5044,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,6],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"Team extension is a new, faster way to hire the right dedicated software development team for a project. Read our post to learn everything about the new dedicated team model.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/dedicated-development-team-reimagined-and-improved\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Team Extension Services — Dedicated Development Team\" \/>\n<meta property=\"og:description\" content=\"Team extension is a new, faster way to hire the right dedicated software development team for a project. Read our post to learn everything about the new dedicated team model.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/dedicated-development-team-reimagined-and-improved\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2018-06-19T15:00:24+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-07-06T13:09:27+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/redd-angelo-269935-unsplash-2.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1300\" \/>\n\t<meta property=\"og:image:height\" content=\"600\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/dedicated-development-team-reimagined-and-improved\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/redd-angelo-269935-unsplash-2.jpg\",\"width\":1300,\"height\":600,\"caption\":\"Developers Team\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/dedicated-development-team-reimagined-and-improved\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/dedicated-development-team-reimagined-and-improved\/\",\"name\":\"Team Extension Services \\u2014 Dedicated Development Team\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/dedicated-development-team-reimagined-and-improved\/#primaryimage\"},\"datePublished\":\"2018-06-19T15:00:24+00:00\",\"dateModified\":\"2020-07-06T13:09:27+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\"},\"description\":\"Team extension is a new, faster way to hire the right dedicated software development team for a project. Read our post to learn everything about the new dedicated team model.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/dedicated-development-team-reimagined-and-improved\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\",\"name\":\"Anastasiia Hibaieva\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5e777493cd8ae0902fee5b35c44765ce?s=96&d=mm&r=g\",\"caption\":\"Anastasiia Hibaieva\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/5038"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/63"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=5038"}],"version-history":[{"count":0,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/5038\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/5044"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=5038"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=5038"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=5038"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}