{"id":8528,"date":"2015-01-14T13:36:26","date_gmt":"2015-01-14T11:36:26","guid":{"rendered":"https:\/\/stanfy.com\/?p=8528"},"modified":"2019-12-20T17:53:32","modified_gmt":"2019-12-20T14:53:32","slug":"the-internet-of-things-and-mobile-connected-world","status":"publish","type":"post","link":"https:\/\/www.intellectsoft.net\/blog\/the-internet-of-things-and-mobile-connected-world\/","title":{"rendered":"The Internet of Things and Mobile-Connected World"},"content":{"rendered":"<p dir=\"ltr\">Look around. What do you see? You are most probably reading this article on your laptop or tablet. At the same time your iPhone is buzzing with a new email and your smartwatch displays an alert to complete your 10,000 steps daily challenge. But what about other things: doors, windows, a fridge? How many of them are not yet connected to the Internet and simply exist in the physical world without any connection to the virtual cloud? Well, it won’t last long. <a href=\"http:\/\/share.cisco.com\/internet-of-things.html\">Cisco experts predict<\/a> that there will be about 15B devices connected to Internet in 2015, and around 40B devices by 2020. The widely discussed trend of the ‘Internet of Things’ will soon become the ‘Internet of Everything’ &#8211; the connection of people, processes, data, and things.<\/p>\n<p>We decided to take a closer look at the overwhelming trend of smart, connected devices and find out how we got here, how to benefit from it and what the new connected way of life has prepared for us in the future.<\/p>\n<h2 dir=\"ltr\"><img loading=\"lazy\" class=\"aligncenter size-full wp-image-8529\" title=\"Image 1\" src=\"https:\/\/stanfy.com\/wp-content\/uploads\/2015\/01\/Image-1.png\" alt=\"\" width=\"589\" height=\"296\" \/><\/h2>\n<h2 dir=\"ltr\">What are smart, connected products?<\/h2>\n<p dir=\"ltr\">By Internet of Things (IoT) we usually refer to everyday objects that have the capability to connect and communicate to the network and are usually controlled by external smart devices. Smart, connected products are emerging across all industries and start influencing many spheres of our everyday lives: including a smart house controlled remotely via an iPad, a light bulb which colour can be changed with an iPhone app, smart ice cubes that keep track of your alcohol consumption, and many more.<\/p>\n<p dir=\"ltr\">Smart, connected products are comprised of three core elements: physical components (various mechanical and electrical parts), smart components (such as sensors, controls, software, embedded operating system and user interface) and connectivity components (ports, antennae, and protocols for wired or wireless connections).<\/p>\n<p>All of the components are interconnected and amplify the value of each other. Thus, connectivity components allow for a big value of a product (health and fitness data collected by smartbands like Fitbit and stored in the cloud, for instance) to exist outside the product itself. Probably everyone one us has taken a modern Schindler’s elevator. Did you know that the elevator is actually a smart elevator that asses various patterns in elevator operations? Their PORT Technology calculates the fastest time to destinations and even predicts elevator demand patterns. Altogether it helps to reduce elevator wait times by 50%.<\/p>\n<h2 dir=\"ltr\">Innovation beyond smartphones and tablets<\/h2>\n<p dir=\"ltr\">There is a number of important factors contributing to the growing adoption of the Internet of things. Mobile subscribers are growing rapidly and bandwidth demand due to data and video consumption is increasing. What’s more, improvement of WiFi and cellular, emergence of wearable devices and many other innovations across the technology landscape fuel the expansion of IoT.<\/p>\n<p dir=\"ltr\">Whereas the past decade has been about the rise of mobile, nowadays it’s hard to surprise anyone with a cool mobile app or large-screen phablet. Entrepreneurs and manufacturers are beginning to recognize a great potential a synergy of software and hardware on many levels and are determined to derive the full benefits from it. There is no doubt that that smartphones and tablets are here to stay and their sales will only grow. However, with every year they start to fulfil many new roles except for being a phone or an electronic book. They are the portals to the world and remote controls for many new connected devices.<\/p>\n<p dir=\"ltr\">Rapid growth in a number of smartphones &amp; 3G- and 4G-connected tablets stipulates the growth and improvement of mobile connection as well. Cisco forecasts that smartphones will see 20% growth in numbers, while the data they consume will grow by 81%. Already in 2013 mobile data traffic was nearly 18 times the size of the entire global Internet in 2000. Growth rates vary by region showing the fastest growth of 86% in Asia Pacific, 77% in North America, and 57% in Western Europe. What’s more, researchers predict that global mobile data traffic will increase nearly 11-fold between 2013 and 2018, reaching 16 exabytes per month by 2018.<\/p>\n<p dir=\"ltr\">Transition from 2G and 3G to 4G has a transformative effect on technology, as 4G provides higher bandwidth, lower latency, and increased security. Altogether this leads to even higher adoption of mobile technologies by end users, and by 2018, over half of all devices connected to the mobile network will be “smart” devices.<\/p>\n<div>\n<h2 dir=\"ltr\">What can smart, connected products do?<\/h2>\n<p dir=\"ltr\">Combining the potential of physical, smart and connected components, smart devices have an entirely new set of product functions and capabilities, which can be grouped into four areas: monitoring, control, optimization, and autonomy. Some products represent just one, but some combine all four.<\/p>\n<p dir=\"ltr\">Monitoring. Due to in-built sensors and external data sources, connected products can gather and provide comprehensive monitoring data, such as medical data, safety parameters and various indicators. Healthcare is one of the fields that have been revolutionised with this kind of devices. Many smart devices, such as glucose monitors, weight and blood pressure trackers are already empowering people to live healthier lives by using them on a day-to-day basis. A lot of new startups also spring up in this field. For example, <a href=\"http:\/\/adheretech.com\">AdhereTech<\/a> created a a connected pill bottle that ensures patients take their medications. Statistics shows that as many as 125 thousand deaths per year in the U.S. alone can be attributed to medication non-adherence. AdhereTech&#8217;s pill bottle helps to increase adherence and reduce the costs associated with missed or misdosing haphazards.<\/p>\n<p dir=\"ltr\">Control. Software that’s embedded into smart devices enables their remote control and high levels of customization. Thus, users can personalize their interaction with the product in many new ways.<\/p>\n<p dir=\"ltr\">Let’s just take a look at Philips lightbulbs that can be controlled via smartphone (you can customize your lighting in many ways using just your smartphone &#8211; turn them on\/off, dim the lights through the night, program them to change different colours and even blink red if an intruder enters the house). Philips has been selling light bulbs since 1891 but smart lighting solutions is definitely something very new. “With the new digitization of light, we have only begun to scratch the surface on how we can control it, integrate it with other systems, and collect rich data,” <a href=\"https:\/\/georgepulse.wordpress.com\/2014\/09\/09\/the-light-bulb-gets-a-digital-makeover\/\">says<\/a> Brian Bernstein, Philips’s global head of indoor lighting systems.<\/p>\n<div>\n<p dir=\"ltr\">Optimization. Of course, having the ability to monitor big chunks of data and control the devices remotely open up new possibilities for opitimization on various levels. Many companies are already  using such devices to increase equipment utilization and efficiency, conduct remote diagnosis and optimise service performance. Schindler’s elevators are a great example for the above. However, smart devices can also greatly improve every day lives of individuals as well. Everyday we charge our smartphones (sometimes even more often then once a day if you have an iPhone 🙂 and how do you know that no power is wasted in the process? <a href=\"https:\/\/web.velvetwire.com\">Velvetwire Powerslayer Blu<\/a> charger is one of the smart chargers out there. The charger has a tiny computer inside that communicates with your smartphone. It protects against overcharging, eliminates waste of power and keeps your device safe by preventing overheating.<\/p>\n<p dir=\"ltr\">Autonomy. Not only smart devices combine monitoring, controlling and optimisation capabilities, but they also sustain a previously unheard level of autonomy. They can learn about their environment, self-diagnose their own service needs, and adapt to users’ preferences. What is more, autonomous products can also act in coordination with other products and systems. Autonomous devices are already heavily used across many sectors starting from manufacturing and heavy machinery to healthcare.<\/p>\n<p> <iframe id=\"dit-video-embed\" src=\"http:\/\/snagplayer.video.howstuffworks.com\/814747\/snag-it-player.htm?auto=no\" width=\"640\" height=\"360\" frameborder=\"0\" scrolling=\"no\"><\/iframe><\/p>\n<div>\n<h2 dir=\"ltr\">Let’s get ready for the connected future<\/h2>\n<p dir=\"ltr\">Spectacular advances in technology bring Internet of Things in every home and workplace. These smart, connected devices are having an increasing impact not only with consumer electronics, but also on a larger scale (starting from smart houses and expanding to smart cities).<\/p>\n<p dir=\"ltr\">Their “immediate value” is the ability to capture extensive data that can be leveraged in real time. But there are many other benefits that can derived from smart products as well. Connected devices are usually easy in the setup and provide new level of comfort and convenience (like Nest thermostat which has become the gold-standard in its category). As smart components replace many hardware parts, physical connected devices can be more compact and perform at a variety of levels. Their value can also be measured with the real-world usefullness such as increasing efficiency and saving power (Sonte’s Wi-Fi-enabled Smart Film allows you to remotely flip between transparent and non-transparent modes on your windows, which helps to eliminate about 40% percent of unwanted heat in the warm summer months and help you save on air conditioning a big deal).<\/p>\n<p dir=\"ltr\">While there have been vast technological improvements to make smart devices possible as an emerging device category, they still have some barriers need to be overcome. This includes improvement of wireless connectivity, software applications and an operating systems embedded in the product itself, network communications to support connectivity, a product cloud consisting of software running on remote servers. Not to mention various safety and government regulations that need to be adapted to the new reality.<\/p>\n<p dir=\"ltr\">“The next 5 years will be pivotal in its growth and establishment as a tangible concept to the consumer,” <a href=\"https:\/\/www.abiresearch.com\/press\/more-than-30-billion-devices-will-wirelessly-conne\">says<\/a> ABI Analyst Cooney. All tech factors above are important, however, the “long-term expansion of the market”, according to Cooney, depends on wireless technology “becoming invisible so that the consumer will be oblivious to which technology is used and only know that it works.”<\/p>\n<p dir=\"ltr\">With the changing nature of products around us a whole new set of technological possibilities have emerged. We are just learning to leverage them. The connected device market has great potential and presents over $1.2 T revenue opportunity by 2020. So, I am sure manufactures and technology startups will keep surprise us with their new inventions.<\/p>\n<\/div>\n<\/div>\n<\/div>\n<div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>We decided to take a closer look at the overwhelming trend of smart, connected devices and find out how we got here, how to benefit from it and what the new connected way of life has prepared for us in the future.<\/p>\n","protected":false},"author":63,"featured_media":14508,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[797],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"IoT is getting wider as the number of devices connected to the Internet is growing year by year. Let’s take a look at the future mobile-connected world.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.intellectsoft.net\/blog\/the-internet-of-things-and-mobile-connected-world\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"IoT: Turning Into Mobile-Connected World\" \/>\n<meta property=\"og:description\" content=\"IoT is getting wider as the number of devices connected to the Internet is growing year by year. Let’s take a look at the future mobile-connected world.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.intellectsoft.net\/blog\/the-internet-of-things-and-mobile-connected-world\/\" \/>\n<meta property=\"og:site_name\" content=\"Intellectsoft Blog\" \/>\n<meta property=\"article:published_time\" content=\"2015-01-14T11:36:26+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-12-20T14:53:32+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Image-1.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1596\" \/>\n\t<meta property=\"og:image:height\" content=\"753\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/\",\"name\":\"Intellectsoft Blog\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.intellectsoft.net\/blog\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/the-internet-of-things-and-mobile-connected-world\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/wp-content\/uploads\/Image-1.png\",\"width\":1596,\"height\":753},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/the-internet-of-things-and-mobile-connected-world\/#webpage\",\"url\":\"https:\/\/www.intellectsoft.net\/blog\/the-internet-of-things-and-mobile-connected-world\/\",\"name\":\"IoT: Turning Into Mobile-Connected World\",\"isPartOf\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/the-internet-of-things-and-mobile-connected-world\/#primaryimage\"},\"datePublished\":\"2015-01-14T11:36:26+00:00\",\"dateModified\":\"2019-12-20T14:53:32+00:00\",\"author\":{\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\"},\"description\":\"IoT is getting wider as the number of devices connected to the Internet is growing year by year. Let\\u2019s take a look at the future mobile-connected world.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.intellectsoft.net\/blog\/the-internet-of-things-and-mobile-connected-world\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#\/schema\/person\/934d88e6448434bc0f87550678a8637e\",\"name\":\"Anastasiia Hibaieva\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.intellectsoft.net\/blog\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5e777493cd8ae0902fee5b35c44765ce?s=96&d=mm&r=g\",\"caption\":\"Anastasiia Hibaieva\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/8528"}],"collection":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/users\/63"}],"replies":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/comments?post=8528"}],"version-history":[{"count":0,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/posts\/8528\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media\/14508"}],"wp:attachment":[{"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/media?parent=8528"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/categories?post=8528"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.intellectsoft.net\/blog\/wp-json\/wp\/v2\/tags?post=8528"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}